[
  {
    "ControlID": "AC-2",
    "ControlFamily": "ACCESS CONTROL",
    "ID": "AC-2 (1)",
    "ControlTitle": "ACCOUNT MANAGEMENT",
    "EnhancementText": "The organization employs automated mechanisms to support the management of information system accounts.\n\n",
    "FedrampGuidance": "",
    "SupplementalGuidance": " The use of automated mechanisms can include, for example: using email or text messaging to automatically notify account managers when users are terminated or transferred; using the information system to monitor account usage; and using telephonic notification to report atypical system account usage.\n",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "AC-2",
    "ControlFamily": "ACCESS CONTROL",
    "ID": "AC-2 (2)",
    "ControlTitle": "ACCOUNT MANAGEMENT",
    "EnhancementText": "The information system automatically [Selection: removes; disables] temporary and emergency accounts after [Assignment: organization-defined time period for each type of account].\n\n",
    "FedrampGuidance": "",
    "SupplementalGuidance": " This control enhancement requires the removal of both temporary and emergency accounts automatically after a predefined period of time has elapsed, rather than at the convenience of the systems administrator.\n",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [],
    "Parameters": [
      {
        "Level": "High",
        "Param": "AC-2 (2) [Selection: disables] \n[Assignment: 24 hours from last use]"
      },
      {
        "Level": "Moderate",
        "Param": "AC-2 (2) [no more than 30 days for temporary and emergency account types]"
      }
    ]
  },
  {
    "ControlID": "AC-2",
    "ControlFamily": "ACCESS CONTROL",
    "ID": "AC-2 (3)",
    "ControlTitle": "ACCOUNT MANAGEMENT",
    "EnhancementText": "The information system automatically disables inactive accounts after [Assignment: organization-defined time period].\n",
    "FedrampGuidance": "AC-2 (3) Requirement: The service provider defines the time period for non-user accounts (e.g., accounts associated with devices).  The time periods are approved and accepted by the JAB/AO. Where user management is a function of the service, reports of activity of consumer users shall be made available.",
    "SupplementalGuidance": "",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [],
    "Parameters": [
      {
        "Level": "High",
        "Param": "AC-2 (3) [35 days for user accounts]"
      },
      {
        "Level": "Moderate",
        "Param": "AC-2 (3) [90 days for user accounts]"
      }
    ]
  },
  {
    "ControlID": "AC-2",
    "ControlFamily": "ACCESS CONTROL",
    "ID": "AC-2 (4)",
    "ControlTitle": "ACCOUNT MANAGEMENT",
    "EnhancementText": "The information system automatically audits account creation, modification, enabling, disabling, and removal actions, and notifies [Assignment: organization-defined personnel or roles].\n\n",
    "FedrampGuidance": "",
    "SupplementalGuidance": " ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "au-2",
      "au-12"
    ],
    "Parameters": [
      {
        "Level": "High",
        "Param": "AC-2 (4) [organization and/or service provider system owner]"
      }
    ]
  },
  {
    "ControlID": "AC-2",
    "ControlFamily": "ACCESS CONTROL",
    "ID": "AC-2 (5)",
    "ControlTitle": "ACCOUNT MANAGEMENT",
    "EnhancementText": "The organization requires that users log out when [Assignment: organization-defined time-period of expected inactivity or description of when to log out].\n\n",
    "FedrampGuidance": "AC-2 (5) Guidance: Should use a shorter timeframe than AC-12.",
    "SupplementalGuidance": " ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "sc-23"
    ],
    "Parameters": [
      {
        "Level": "High",
        "Param": "AC-2 (5) [inactivity is anticipated to exceed Fifteen (15) minutes]"
      }
    ]
  },
  {
    "ControlID": "AC-2",
    "ControlFamily": "ACCESS CONTROL",
    "ID": "AC-2 (7)",
    "ControlTitle": "ACCOUNT MANAGEMENT",
    "EnhancementText": "The organization:\n(a) Establishes and administers privileged user accounts in accordance with a role-based access scheme that organizes allowed information system access and privileges into roles;\n(b) Monitors privileged role assignments; and\n(c) Takes [Assignment: organization-defined actions] when privileged role assignments are no longer appropriate.\n\n",
    "FedrampGuidance": "",
    "SupplementalGuidance": " Privileged roles are organization-defined roles assigned to individuals that allow those individuals to perform certain security-relevant functions that ordinary users are not authorized to perform. These privileged roles include, for example, key management, account management, network and system administration, database administration, and web administration.\n",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [],
    "Parameters": [
      {
        "Level": "High",
        "Param": "AC-2 (7) (c) [disables/revokes access within a organization-specified timeframe]"
      }
    ]
  },
  {
    "ControlID": "AC-2",
    "ControlFamily": "ACCESS CONTROL",
    "ID": "AC-2 (9)",
    "ControlTitle": "ACCOUNT MANAGEMENT",
    "EnhancementText": "The organization only permits the use of shared/group accounts that meet [Assignment: organization-defined conditions for establishing shared/group accounts].\n",
    "FedrampGuidance": "AC-2 (9) Required if shared/group accounts are deployed",
    "SupplementalGuidance": "",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [],
    "Parameters": [
      {
        "Level": "High",
        "Param": "AC-2 (9) [organization-defined need with justification statement that explains why such accounts are necessary]"
      }
    ]
  },
  {
    "ControlID": "AC-2",
    "ControlFamily": "ACCESS CONTROL",
    "ID": "AC-2 (10)",
    "ControlTitle": "ACCOUNT MANAGEMENT",
    "EnhancementText": "The information system terminates shared/group account credentials when members leave the group.\n",
    "FedrampGuidance": "AC-2 (10) Required if shared/group accounts are deployed",
    "SupplementalGuidance": "",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "AC-2",
    "ControlFamily": "ACCESS CONTROL",
    "ID": "AC-2 (11)",
    "ControlTitle": "ACCOUNT MANAGEMENT",
    "EnhancementText": "The information system enforces [Assignment: organization-defined circumstances and/or usage conditions] for [Assignment: organization-defined information system accounts].\n\n",
    "FedrampGuidance": "",
    "SupplementalGuidance": " Organizations can describe the specific conditions or circumstances under which information system accounts can be used, for example, by restricting usage to certain days of the week, time of day, or specific durations of time.\n",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "AC-2",
    "ControlFamily": "ACCESS CONTROL",
    "ID": "AC-2 (12)",
    "ControlTitle": "ACCOUNT MANAGEMENT",
    "EnhancementText": "The organization:\n (a) Monitors information system accounts for [Assignment: organization-defined atypical use]; and\n (b) Reports atypical usage of information system accounts to [Assignment: organization-defined personnel or roles].\n\n",
    "FedrampGuidance": "AC-2 (12)(a) Guidance: Required for privileged accounts.\nAC-2 (12)(b) Guidance: Required for privileged accounts.",
    "SupplementalGuidance": " Atypical usage includes, for example, accessing information systems at certain times of the day and from locations that are not consistent with the normal usage patterns of individuals working in organizations. ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "ca-7"
    ],
    "Parameters": [
      {
        "Level": "High",
        "Param": "AC-2 (12) (b)[at a minimum, the ISSO and/or similar role within the organization]"
      }
    ]
  },
  {
    "ControlID": "AC-2",
    "ControlFamily": "ACCESS CONTROL",
    "ID": "AC-2 (13)",
    "ControlTitle": "ACCOUNT MANAGEMENT",
    "EnhancementText": "The organization disables accounts of users posing a significant risk within [Assignment: organization-defined time period] of discovery of the risk.\n\n",
    "FedrampGuidance": "",
    "SupplementalGuidance": " Users posing a significant risk to organizations include individuals for whom reliable evidence or intelligence indicates either the intention to use authorized access to information systems to cause harm or through whom adversaries will cause harm. Harm includes potential adverse impacts to organizational operations and assets, individuals, other organizations, or the Nation. Close coordination between authorizing officials, information system administrators, and human resource managers is essential in order for timely execution of this control enhancement. ",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [
      "ps-4"
    ],
    "Parameters": [
      {
        "Level": "High",
        "Param": "AC-2 (13) [one (1) hour]"
      }
    ]
  },
  {
    "ControlID": "AC-4",
    "ControlFamily": "ACCESS CONTROL",
    "ID": "AC-4 (8)",
    "ControlTitle": "INFORMATION FLOW ENFORCEMENT",
    "EnhancementText": "The information system enforces information flow control using [Assignment: organization-defined security policy filters] as a basis for flow control decisions for [Assignment: organization-defined information flows].\n\n",
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Organization-defined security policy filters can address data structures and content. For example, security policy filters for data structures can check for maximum file lengths, maximum field sizes, and data/file types (for structured and unstructured data). Security policy filters for data content can check for specific words (e.g., dirty/clean word filters), enumerated values or data value ranges, and hidden content. Structured data permits the interpretation of data content by applications. Unstructured data typically refers to digital information without a particular data structure or with a data structure that does not facilitate the development of rule sets to address the particular sensitivity of the information conveyed by the data or the associated flow enforcement decisions. Unstructured data consists of: (i) bitmap objects that are inherently non language-based (i.e., image, video, or audio files); and (ii) textual objects that are based on written or printed languages (e.g., commercial off-the- shelf word processing documents, spreadsheets, or emails). Organizations can implement more than one security policy filter to meet information flow control objectives (e.g., employing clean word lists in conjunction with dirty word lists may help to reduce false positives).\n",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "AC-4",
    "ControlFamily": "ACCESS CONTROL",
    "ID": "AC-4 (21)",
    "ControlTitle": "INFORMATION FLOW ENFORCEMENT",
    "EnhancementText": "The information system separates information flows logically or physically using [Assignment: organization-defined mechanisms and/or techniques] to accomplish [Assignment: organization- defined required separations by types of information].\n\n",
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Enforcing the separation of information flows by type can enhance protection by ensuring that information is not commingled while in transit and by enabling flow control by transmission paths perhaps not otherwise achievable. Types of separable information include, for example, inbound and outbound communications traffic, service requests and responses, and information of differing security categories.\n",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "AC-6",
    "ControlFamily": "ACCESS CONTROL",
    "ID": "AC-6 (1)",
    "ControlTitle": "LEAST PRIVILEGE",
    "EnhancementText": "The organization explicitly authorizes access to [Assignment: organization-defined security functions (deployed in hardware, software, and firmware) and security-relevant information].\n\n",
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Security functions include, for example, establishing system accounts, configuring access authorizations (i.e., permissions, privileges), setting events to be audited, and setting intrusion detection parameters. Security-relevant information includes, for example, filtering rules for routers/firewalls, cryptographic key management information, configuration parameters for security services, and access control lists. Explicitly authorized personnel include, for example, security administrators, system and network administrators, system security officers, system maintenance personnel, system programmers, and other privileged users. ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "ac-17",
      "ac-18",
      "ac-19"
    ],
    "Parameters": [
      {
        "Level": "High",
        "Param": "AC-6 (1) [all functions not publicly accessible and all security-relevant information not publicly available]"
      }
    ]
  },
  {
    "ControlID": "AC-6",
    "ControlFamily": "ACCESS CONTROL",
    "ID": "AC-6 (2)",
    "ControlTitle": "LEAST PRIVILEGE",
    "EnhancementText": "The organization requires that users of information system accounts, or roles, with access to [Assignment: organization-defined security functions or security-relevant information], use non- privileged accounts or roles, when accessing nonsecurity functions.\n\n",
    "FedrampGuidance": "AC-6 (2) Guidance:  Examples of security functions include but are not limited to: establishing system accounts, configuring access authorizations (i.e., permissions, privileges), setting events to be audited, and setting intrusion detection parameters, system programming, system and security administration, other privileged functions.",
    "SupplementalGuidance": "  This control enhancement limits exposure when operating from within privileged accounts or roles. The inclusion of roles addresses situations where organizations implement access control policies such as role-based access control and where a change of role provides the same degree of assurance in the change of access authorizations for both the user and all processes acting on behalf of the user as would be provided by a change between a privileged and non-privileged account. ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "pl-4"
    ],
    "Parameters": [
      {
        "Level": "High",
        "Param": "AC-6 (2) [all security functions]"
      },
      {
        "Level": "Moderate",
        "Param": "AC-6 (2) [all security functions]"
      }
    ]
  },
  {
    "ControlID": "AC-6",
    "ControlFamily": "ACCESS CONTROL",
    "ID": "AC-6 (3)",
    "ControlTitle": "LEAST PRIVILEGE",
    "EnhancementText": "The organization authorizes network access to [Assignment: organization-defined privileged commands] only for [Assignment: organization-defined compelling operational needs] and documents the rationale for such access in the security plan for the information system.\n\n",
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Network access is any access across a network connection in lieu of local access (i.e., user being physically present at the device). ",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [
      "ac-17"
    ],
    "Parameters": [
      {
        "Level": "High",
        "Param": "AC-6 (3)-1 [all privileged commands] "
      }
    ]
  },
  {
    "ControlID": "AC-6",
    "ControlFamily": "ACCESS CONTROL",
    "ID": "AC-6 (5)",
    "ControlTitle": "LEAST PRIVILEGE",
    "EnhancementText": "The organization restricts privileged accounts on the information system to [Assignment:\norganization-defined personnel or roles].\n\n",
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Privileged accounts, including super user accounts, are typically described as system administrator for various types of commercial off-the-shelf operating systems. Restricting privileged accounts to specific personnel or roles prevents day-to-day users from having access to privileged information/functions. Organizations may differentiate in the application of this control enhancement between allowed privileges for local accounts and for domain accounts provided organizations retain the ability to control information system configurations for key security parameters and as otherwise necessary to sufficiently mitigate risk. ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "cm-6"
    ],
    "Parameters": []
  },
  {
    "ControlID": "AC-6",
    "ControlFamily": "ACCESS CONTROL",
    "ID": "AC-6 (7)",
    "ControlTitle": "LEAST PRIVILEGE",
    "EnhancementText": "The organization:\n (a)   Reviews [Assignment: organization-defined frequency] the privileges assigned to [Assignment: organization-defined roles or classes of users] to validate the need for such privileges; and\n (b)   Reassigns or removes privileges, if necessary, to correctly reflect organizational mission/business needs.\n\n",
    "FedrampGuidance": "",
    "SupplementalGuidance": "  The need for certain assigned user privileges may change over time reflecting changes in organizational missions/business function, environments of operation, technologies, or threat. Periodic review of assigned user privileges is necessary to determine if the rationale for assigning such privileges remains valid. If the need cannot be revalidated, organizations take appropriate corrective actions. ",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [
      "ca-7"
    ],
    "Parameters": [
      {
        "Level": "High",
        "Param": "AC-6 (7)(a)-1  at a minimum, annually\nAC-6 (7)(a)-2  all users with privileges"
      }
    ]
  },
  {
    "ControlID": "AC-6",
    "ControlFamily": "ACCESS CONTROL",
    "ID": "AC-6 (8)",
    "ControlTitle": "LEAST PRIVILEGE",
    "EnhancementText": "The information system prevents [Assignment: organization-defined software] from executing at higher privilege levels than users executing the software.\n\n",
    "FedrampGuidance": "",
    "SupplementalGuidance": "  In certain situations, software applications/programs need to execute with elevated privileges to perform required functions. However, if the privileges required for execution are at a higher level than the privileges assigned to organizational users invoking such applications/programs, those users are indirectly provided with greater privileges than assigned by organizations.\n",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [],
    "Parameters": [
      {
        "Level": "High",
        "Param": "AC-6 (8) [any software except software explicitly documented]"
      }
    ]
  },
  {
    "ControlID": "AC-6",
    "ControlFamily": "ACCESS CONTROL",
    "ID": "AC-6 (9)",
    "ControlTitle": "LEAST PRIVILEGE",
    "EnhancementText": "The information system audits the execution of privileged functions.\n\n",
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Misuse of privileged functions, either intentionally or unintentionally by authorized users, or by unauthorized external entities that have compromised information system accounts, is a serious and ongoing concern and can have significant adverse impacts on organizations. Auditing the use of privileged functions is one way to detect such misuse, and in doing so, help mitigate the risk from insider threats and the advanced persistent threat (APT). ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "au-2"
    ],
    "Parameters": []
  },
  {
    "ControlID": "AC-6",
    "ControlFamily": "ACCESS CONTROL",
    "ID": "AC-6 (10)",
    "ControlTitle": "LEAST PRIVILEGE",
    "EnhancementText": "The information system prevents non-privileged users from executing privileged functions to include disabling, circumventing, or altering implemented security safeguards/countermeasures.\n\n",
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Privileged functions include, for example, establishing information system accounts, performing system integrity checks, or administering cryptographic key management activities. Non-privileged users are individuals that do not possess appropriate authorizations. Circumventing intrusion detection and prevention mechanisms or malicious code protection mechanisms are examples of privileged functions that require protection from non-privileged users.\n",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "AC-7",
    "ControlFamily": "ACCESS CONTROL",
    "ID": "AC-7 (2)",
    "ControlTitle": "UNSUCCESSFUL LOGON ATTEMPTS",
    "EnhancementText": "The information system purges/wipes information from [Assignment: organization-defined mobile devices] based on [Assignment: organization-defined purging/wiping requirements/techniques] after [Assignment: organization-defined number] consecutive, unsuccessful device logon attempts.\n\n",
    "FedrampGuidance": "",
    "SupplementalGuidance": " This control enhancement applies only to mobile devices for which a logon occurs (e.g., personal digital assistants, smart phones, tablets). The logon is to the mobile device, not to any one account on the device. Therefore, successful logons to any accounts on mobile devices reset the unsuccessful logon count to zero. Organizations define information to be purged/wiped carefully in order to avoid over purging/wiping which may result in devices becoming unusable. Purging/wiping may be unnecessary if the information on the device is protected with sufficiently strong encryption mechanisms. ",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [
      "ac-19",
      "mp-5",
      "mp-6",
      "sc-13"
    ],
    "Parameters": [
      {
        "Level": "High",
        "Param": "AC-7 (2)-1 [mobile devices as defined by organization policy]\nAC-7 (2)-3 [three (3)]"
      }
    ]
  },
  {
    "ControlID": "AC-11",
    "ControlFamily": "ACCESS CONTROL",
    "ID": "AC-11 (1)",
    "ControlTitle": "SESSION LOCK",
    "EnhancementText": "The information system conceals, via the session lock, information previously visible on the display with a publicly viewable image.\n\n",
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Publicly viewable images can include static or dynamic images, for example, patterns used with screen savers, photographic images, solid colors, clock, battery life indicator, or a blank screen, with the additional caveat that none of the images convey sensitive information.\n\nReferences:  OMB Memorandum 06-16.\n",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [],
    "Parameters": []
  }
]
