[
  {
    "ControlID": "AC-2",
    "ControlFamily": "ACCESS CONTROL",
    "ID": "AC-2 (1)",
    "ControlTitle": "ACCOUNT MANAGEMENT",
    "EnhancementText": "The organization employs automated mechanisms to support the management of information system accounts.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": " The use of automated mechanisms can include, for example: using email or text messaging to automatically notify account managers when users are terminated or transferred; using the information system to monitor account usage; and using telephonic notification to report atypical system account usage.\n",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "AC-2",
    "ControlFamily": "ACCESS CONTROL",
    "ID": "AC-2 (2)",
    "ControlTitle": "ACCOUNT MANAGEMENT",
    "EnhancementText": "The information system automatically [Selection: removes; disables] temporary and emergency accounts after [Assignment: organization-defined time period for each type of account].\n\n",
    "IaseGuidance": "For temporary user accounts: 72 hours \n\r\nFor emergency admin accounts: never (see supplemental recommendation)\n\r\nSource: \r\nDoD RMF TAG",
    "FedrampGuidance": "",
    "SupplementalGuidance": " This control enhancement requires the removal of both temporary and emergency accounts automatically after a predefined period of time has elapsed, rather than at the convenience of the systems administrator.\n",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [],
    "Parameters": [
      {
        "Level": "High",
        "Param": "AC-2 (2) [Selection: disables] \n[Assignment: 24 hours from last use]"
      },
      {
        "Level": "Moderate",
        "Param": "AC-2 (2) [no more than 30 days for temporary and emergency account types]"
      }
    ]
  },
  {
    "ControlID": "AC-2",
    "ControlFamily": "ACCESS CONTROL",
    "ID": "AC-2 (3)",
    "ControlTitle": "ACCOUNT MANAGEMENT",
    "EnhancementText": "The information system automatically disables inactive accounts after [Assignment: organization-defined time period].\n",
    "IaseGuidance": "35 days\n\r\nSource: \r\nDoD RMF TAG",
    "FedrampGuidance": "AC-2 (3) Requirement: The service provider defines the time period for non-user accounts (e.g., accounts associated with devices).  The time periods are approved and accepted by the JAB/AO. Where user management is a function of the service, reports of activity of consumer users shall be made available.",
    "SupplementalGuidance": "",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [],
    "Parameters": [
      {
        "Level": "High",
        "Param": "AC-2 (3) [35 days for user accounts]"
      },
      {
        "Level": "Moderate",
        "Param": "AC-2 (3) [90 days for user accounts]"
      }
    ]
  },
  {
    "ControlID": "AC-2",
    "ControlFamily": "ACCESS CONTROL",
    "ID": "AC-2 (4)",
    "ControlTitle": "ACCOUNT MANAGEMENT",
    "EnhancementText": "The information system automatically audits account creation, modification, enabling, disabling, and removal actions, and notifies [Assignment: organization-defined personnel or roles].\n\n",
    "IaseGuidance": "System administrator and ISSO\n\r\nSource: \r\nDoD RMF TAG",
    "FedrampGuidance": "",
    "SupplementalGuidance": " ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "au-2",
      "au-12"
    ],
    "Parameters": [
      {
        "Level": "High",
        "Param": "AC-2 (4) [organization and/or service provider system owner]"
      }
    ]
  },
  {
    "ControlID": "AC-2",
    "ControlFamily": "ACCESS CONTROL",
    "ID": "AC-2 (5)",
    "ControlTitle": "ACCOUNT MANAGEMENT",
    "EnhancementText": "The organization requires that users log out when [Assignment: organization-defined time-period of expected inactivity or description of when to log out].\n\n",
    "IaseGuidance": "At the end of the users standard work period unless otherwise defined in formal organizational policy.\n\r\nSource: \r\nDoD RMF TAG",
    "FedrampGuidance": "AC-2 (5) Guidance: Should use a shorter timeframe than AC-12.",
    "SupplementalGuidance": " ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "sc-23"
    ],
    "Parameters": [
      {
        "Level": "High",
        "Param": "AC-2 (5) [inactivity is anticipated to exceed Fifteen (15) minutes]"
      }
    ]
  },
  {
    "ControlID": "AC-2",
    "ControlFamily": "ACCESS CONTROL",
    "ID": "AC-2 (7)",
    "ControlTitle": "ACCOUNT MANAGEMENT",
    "EnhancementText": "The organization:\n(a) Establishes and administers privileged user accounts in accordance with a role-based access scheme that organizes allowed information system access and privileges into roles;\n(b) Monitors privileged role assignments; and\n(c) Takes [Assignment: organization-defined actions] when privileged role assignments are no longer appropriate.\n\n",
    "IaseGuidance": "c. Disables (or revokes) privileged user account\n\r\nSource: \r\nDoD RMF TAG",
    "FedrampGuidance": "",
    "SupplementalGuidance": " Privileged roles are organization-defined roles assigned to individuals that allow those individuals to perform certain security-relevant functions that ordinary users are not authorized to perform. These privileged roles include, for example, key management, account management, network and system administration, database administration, and web administration.\n",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [],
    "Parameters": [
      {
        "Level": "High",
        "Param": "AC-2 (7) (c) [disables/revokes access within a organization-specified timeframe]"
      }
    ]
  },
  {
    "ControlID": "AC-2",
    "ControlFamily": "ACCESS CONTROL",
    "ID": "AC-2 (9)",
    "ControlTitle": "ACCOUNT MANAGEMENT",
    "EnhancementText": "The organization only permits the use of shared/group accounts that meet [Assignment: organization-defined conditions for establishing shared/group accounts].\n",
    "IaseGuidance": "Not appropriate for DoD to define for all CSP's infrastructure or service offerings\n\r\nSource: \r\nDoD RMF TAG",
    "FedrampGuidance": "AC-2 (9) Required if shared/group accounts are deployed",
    "SupplementalGuidance": "",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [],
    "Parameters": [
      {
        "Level": "High",
        "Param": "AC-2 (9) [organization-defined need with justification statement that explains why such accounts are necessary]"
      }
    ]
  },
  {
    "ControlID": "AC-2",
    "ControlFamily": "ACCESS CONTROL",
    "ID": "AC-2 (10)",
    "ControlTitle": "ACCOUNT MANAGEMENT",
    "EnhancementText": "The information system terminates shared/group account credentials when members leave the group.\n",
    "IaseGuidance": null,
    "FedrampGuidance": "AC-2 (10) Required if shared/group accounts are deployed",
    "SupplementalGuidance": "",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "AC-2",
    "ControlFamily": "ACCESS CONTROL",
    "ID": "AC-2 (11)",
    "ControlTitle": "ACCOUNT MANAGEMENT",
    "EnhancementText": "The information system enforces [Assignment: organization-defined circumstances and/or usage conditions] for [Assignment: organization-defined information system accounts].\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": " Organizations can describe the specific conditions or circumstances under which information system accounts can be used, for example, by restricting usage to certain days of the week, time of day, or specific durations of time.\n",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "AC-2",
    "ControlFamily": "ACCESS CONTROL",
    "ID": "AC-2 (12)",
    "ControlTitle": "ACCOUNT MANAGEMENT",
    "EnhancementText": "The organization:\n (a) Monitors information system accounts for [Assignment: organization-defined atypical use]; and\n (b) Reports atypical usage of information system accounts to [Assignment: organization-defined personnel or roles].\n\n",
    "IaseGuidance": "a. Not appropriate for DoD to define for all CSP's infrastructure or service offerings\n\r\nb. at a minimum, the ISSO\n\r\nSource: \r\nDoD RMF TAG",
    "FedrampGuidance": "AC-2 (12)(a) Guidance: Required for privileged accounts.\nAC-2 (12)(b) Guidance: Required for privileged accounts.",
    "SupplementalGuidance": " Atypical usage includes, for example, accessing information systems at certain times of the day and from locations that are not consistent with the normal usage patterns of individuals working in organizations. ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "ca-7"
    ],
    "Parameters": [
      {
        "Level": "High",
        "Param": "AC-2 (12) (b)[at a minimum, the ISSO and/or similar role within the organization]"
      }
    ]
  },
  {
    "ControlID": "AC-2",
    "ControlFamily": "ACCESS CONTROL",
    "ID": "AC-2 (13)",
    "ControlTitle": "ACCOUNT MANAGEMENT",
    "EnhancementText": "The organization disables accounts of users posing a significant risk within [Assignment: organization-defined time period] of discovery of the risk.\n\n",
    "IaseGuidance": "30 minutes unless otherwise defined in formal organizational policy\n\r\nSource: \r\nDoD RMF TAG",
    "FedrampGuidance": "",
    "SupplementalGuidance": " Users posing a significant risk to organizations include individuals for whom reliable evidence or intelligence indicates either the intention to use authorized access to information systems to cause harm or through whom adversaries will cause harm. Harm includes potential adverse impacts to organizational operations and assets, individuals, other organizations, or the Nation. Close coordination between authorizing officials, information system administrators, and human resource managers is essential in order for timely execution of this control enhancement. ",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [
      "ps-4"
    ],
    "Parameters": [
      {
        "Level": "High",
        "Param": "AC-2 (13) [one (1) hour]"
      }
    ]
  },
  {
    "ControlID": "AC-4",
    "ControlFamily": "ACCESS CONTROL",
    "ID": "AC-4 (8)",
    "ControlTitle": "INFORMATION FLOW ENFORCEMENT",
    "EnhancementText": "The information system enforces information flow control using [Assignment: organization-defined security policy filters] as a basis for flow control decisions for [Assignment: organization-defined information flows].\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Organization-defined security policy filters can address data structures and content. For example, security policy filters for data structures can check for maximum file lengths, maximum field sizes, and data/file types (for structured and unstructured data). Security policy filters for data content can check for specific words (e.g., dirty/clean word filters), enumerated values or data value ranges, and hidden content. Structured data permits the interpretation of data content by applications. Unstructured data typically refers to digital information without a particular data structure or with a data structure that does not facilitate the development of rule sets to address the particular sensitivity of the information conveyed by the data or the associated flow enforcement decisions. Unstructured data consists of: (i) bitmap objects that are inherently non language-based (i.e., image, video, or audio files); and (ii) textual objects that are based on written or printed languages (e.g., commercial off-the- shelf word processing documents, spreadsheets, or emails). Organizations can implement more than one security policy filter to meet information flow control objectives (e.g., employing clean word lists in conjunction with dirty word lists may help to reduce false positives).\n",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "AC-4",
    "ControlFamily": "ACCESS CONTROL",
    "ID": "AC-4 (21)",
    "ControlTitle": "INFORMATION FLOW ENFORCEMENT",
    "EnhancementText": "The information system separates information flows logically or physically using [Assignment: organization-defined mechanisms and/or techniques] to accomplish [Assignment: organization- defined required separations by types of information].\n\n",
    "IaseGuidance": "Not appropriate for DoD to define for all CSP's infrastructure or service offerings\n\r\nNot appropriate for DoD to define for all CSP's infrastructure or service offerings\n\r\nSource: \r\nDoD RMF TAG",
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Enforcing the separation of information flows by type can enhance protection by ensuring that information is not commingled while in transit and by enabling flow control by transmission paths perhaps not otherwise achievable. Types of separable information include, for example, inbound and outbound communications traffic, service requests and responses, and information of differing security categories.\n",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "AC-6",
    "ControlFamily": "ACCESS CONTROL",
    "ID": "AC-6 (1)",
    "ControlTitle": "LEAST PRIVILEGE",
    "EnhancementText": "The organization explicitly authorizes access to [Assignment: organization-defined security functions (deployed in hardware, software, and firmware) and security-relevant information].\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Security functions include, for example, establishing system accounts, configuring access authorizations (i.e., permissions, privileges), setting events to be audited, and setting intrusion detection parameters. Security-relevant information includes, for example, filtering rules for routers/firewalls, cryptographic key management information, configuration parameters for security services, and access control lists. Explicitly authorized personnel include, for example, security administrators, system and network administrators, system security officers, system maintenance personnel, system programmers, and other privileged users. ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "ac-17",
      "ac-18",
      "ac-19"
    ],
    "Parameters": [
      {
        "Level": "High",
        "Param": "AC-6 (1) [all functions not publicly accessible and all security-relevant information not publicly available]"
      }
    ]
  },
  {
    "ControlID": "AC-6",
    "ControlFamily": "ACCESS CONTROL",
    "ID": "AC-6 (2)",
    "ControlTitle": "LEAST PRIVILEGE",
    "EnhancementText": "The organization requires that users of information system accounts, or roles, with access to [Assignment: organization-defined security functions or security-relevant information], use non- privileged accounts or roles, when accessing nonsecurity functions.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "AC-6 (2) Guidance:  Examples of security functions include but are not limited to: establishing system accounts, configuring access authorizations (i.e., permissions, privileges), setting events to be audited, and setting intrusion detection parameters, system programming, system and security administration, other privileged functions.",
    "SupplementalGuidance": "  This control enhancement limits exposure when operating from within privileged accounts or roles. The inclusion of roles addresses situations where organizations implement access control policies such as role-based access control and where a change of role provides the same degree of assurance in the change of access authorizations for both the user and all processes acting on behalf of the user as would be provided by a change between a privileged and non-privileged account. ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "pl-4"
    ],
    "Parameters": [
      {
        "Level": "High",
        "Param": "AC-6 (2) [all security functions]"
      },
      {
        "Level": "Moderate",
        "Param": "AC-6 (2) [all security functions]"
      }
    ]
  },
  {
    "ControlID": "AC-6",
    "ControlFamily": "ACCESS CONTROL",
    "ID": "AC-6 (3)",
    "ControlTitle": "LEAST PRIVILEGE",
    "EnhancementText": "The organization authorizes network access to [Assignment: organization-defined privileged commands] only for [Assignment: organization-defined compelling operational needs] and documents the rationale for such access in the security plan for the information system.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Network access is any access across a network connection in lieu of local access (i.e., user being physically present at the device). ",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [
      "ac-17"
    ],
    "Parameters": [
      {
        "Level": "High",
        "Param": "AC-6 (3)-1 [all privileged commands] "
      }
    ]
  },
  {
    "ControlID": "AC-6",
    "ControlFamily": "ACCESS CONTROL",
    "ID": "AC-6 (5)",
    "ControlTitle": "LEAST PRIVILEGE",
    "EnhancementText": "The organization restricts privileged accounts on the information system to [Assignment:\norganization-defined personnel or roles].\n\n",
    "IaseGuidance": "Not appropriate for DoD to define for all CSP's infrastructure or service offerings\n\r\nSource: \r\nDoD RMF TAG",
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Privileged accounts, including super user accounts, are typically described as system administrator for various types of commercial off-the-shelf operating systems. Restricting privileged accounts to specific personnel or roles prevents day-to-day users from having access to privileged information/functions. Organizations may differentiate in the application of this control enhancement between allowed privileges for local accounts and for domain accounts provided organizations retain the ability to control information system configurations for key security parameters and as otherwise necessary to sufficiently mitigate risk. ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "cm-6"
    ],
    "Parameters": []
  },
  {
    "ControlID": "AC-6",
    "ControlFamily": "ACCESS CONTROL",
    "ID": "AC-6 (7)",
    "ControlTitle": "LEAST PRIVILEGE",
    "EnhancementText": "The organization:\n (a)   Reviews [Assignment: organization-defined frequency] the privileges assigned to [Assignment: organization-defined roles or classes of users] to validate the need for such privileges; and\n (b)   Reassigns or removes privileges, if necessary, to correctly reflect organizational mission/business needs.\n\n",
    "IaseGuidance": "a. at a minimum, annually\n\r\na. all users\n\r\nSource: \r\nDoD RMF TAG",
    "FedrampGuidance": "",
    "SupplementalGuidance": "  The need for certain assigned user privileges may change over time reflecting changes in organizational missions/business function, environments of operation, technologies, or threat. Periodic review of assigned user privileges is necessary to determine if the rationale for assigning such privileges remains valid. If the need cannot be revalidated, organizations take appropriate corrective actions. ",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [
      "ca-7"
    ],
    "Parameters": [
      {
        "Level": "High",
        "Param": "AC-6 (7)(a)-1  at a minimum, annually\nAC-6 (7)(a)-2  all users with privileges"
      }
    ]
  },
  {
    "ControlID": "AC-6",
    "ControlFamily": "ACCESS CONTROL",
    "ID": "AC-6 (8)",
    "ControlTitle": "LEAST PRIVILEGE",
    "EnhancementText": "The information system prevents [Assignment: organization-defined software] from executing at higher privilege levels than users executing the software.\n\n",
    "IaseGuidance": "any software except software explicitly documented\n\r\nSource: \r\nDoD RMF TAG",
    "FedrampGuidance": "",
    "SupplementalGuidance": "  In certain situations, software applications/programs need to execute with elevated privileges to perform required functions. However, if the privileges required for execution are at a higher level than the privileges assigned to organizational users invoking such applications/programs, those users are indirectly provided with greater privileges than assigned by organizations.\n",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [],
    "Parameters": [
      {
        "Level": "High",
        "Param": "AC-6 (8) [any software except software explicitly documented]"
      }
    ]
  },
  {
    "ControlID": "AC-6",
    "ControlFamily": "ACCESS CONTROL",
    "ID": "AC-6 (9)",
    "ControlTitle": "LEAST PRIVILEGE",
    "EnhancementText": "The information system audits the execution of privileged functions.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Misuse of privileged functions, either intentionally or unintentionally by authorized users, or by unauthorized external entities that have compromised information system accounts, is a serious and ongoing concern and can have significant adverse impacts on organizations. Auditing the use of privileged functions is one way to detect such misuse, and in doing so, help mitigate the risk from insider threats and the advanced persistent threat (APT). ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "au-2"
    ],
    "Parameters": []
  },
  {
    "ControlID": "AC-6",
    "ControlFamily": "ACCESS CONTROL",
    "ID": "AC-6 (10)",
    "ControlTitle": "LEAST PRIVILEGE",
    "EnhancementText": "The information system prevents non-privileged users from executing privileged functions to include disabling, circumventing, or altering implemented security safeguards/countermeasures.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Privileged functions include, for example, establishing information system accounts, performing system integrity checks, or administering cryptographic key management activities. Non-privileged users are individuals that do not possess appropriate authorizations. Circumventing intrusion detection and prevention mechanisms or malicious code protection mechanisms are examples of privileged functions that require protection from non-privileged users.\n",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "AC-7",
    "ControlFamily": "ACCESS CONTROL",
    "ID": "AC-7 (2)",
    "ControlTitle": "UNSUCCESSFUL LOGON ATTEMPTS",
    "EnhancementText": "The information system purges/wipes information from [Assignment: organization-defined mobile devices] based on [Assignment: organization-defined purging/wiping requirements/techniques] after [Assignment: organization-defined number] consecutive, unsuccessful device logon attempts.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": " This control enhancement applies only to mobile devices for which a logon occurs (e.g., personal digital assistants, smart phones, tablets). The logon is to the mobile device, not to any one account on the device. Therefore, successful logons to any accounts on mobile devices reset the unsuccessful logon count to zero. Organizations define information to be purged/wiped carefully in order to avoid over purging/wiping which may result in devices becoming unusable. Purging/wiping may be unnecessary if the information on the device is protected with sufficiently strong encryption mechanisms. ",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [
      "ac-19",
      "mp-5",
      "mp-6",
      "sc-13"
    ],
    "Parameters": [
      {
        "Level": "High",
        "Param": "AC-7 (2)-1 [mobile devices as defined by organization policy]\nAC-7 (2)-3 [three (3)]"
      }
    ]
  },
  {
    "ControlID": "AC-11",
    "ControlFamily": "ACCESS CONTROL",
    "ID": "AC-11 (1)",
    "ControlTitle": "SESSION LOCK",
    "EnhancementText": "The information system conceals, via the session lock, information previously visible on the display with a publicly viewable image.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Publicly viewable images can include static or dynamic images, for example, patterns used with screen savers, photographic images, solid colors, clock, battery life indicator, or a blank screen, with the additional caveat that none of the images convey sensitive information.\n\nReferences:  OMB Memorandum 06-16.\n",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "AC-12",
    "ControlFamily": "ACCESS CONTROL",
    "ID": "AC-12 (1)",
    "ControlTitle": "SESSION TERMINATION",
    "EnhancementText": "The information system:\n (a)   Provides a logout capability for user-initiated communications sessions whenever authentication is used to gain access to [Assignment: organization-defined information resources]; and\n (b)   Displays an explicit logout message to users indicating the reliable termination of authenticated communications sessions.\n\n",
    "IaseGuidance": "a. all\n\r\nSource: \r\nDoD RMF TAG",
    "FedrampGuidance": "AC-12 (1) Guidance: https://www.owasp.org/index.php/Testing_for_logout_functionality_%28OTG-SESS-006%29",
    "SupplementalGuidance": "  Information resources to which users gain access via authentication include, for example, local workstations, databases, and password-protected websites/web- based services. Logout messages for web page access, for example, can be displayed after authenticated sessions have been terminated. However, for some types of interactive sessions including, for example, file transfer protocol (FTP) sessions, information systems typically send logout messages as final messages prior to terminating sessions.\n",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "AC-17",
    "ControlFamily": "ACCESS CONTROL",
    "ID": "AC-17 (1)",
    "ControlTitle": "REMOTE ACCESS",
    "EnhancementText": "The information system monitors and controls remote access methods.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Automated monitoring and control of remote access sessions allows organizations to detect cyber attacks and also ensure ongoing compliance with remote access policies by auditing connection activities of remote users on a variety of information system components (e.g., servers, workstations, notebook computers, smart phones, and tablets). ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "au-2",
      "au-12"
    ],
    "Parameters": []
  },
  {
    "ControlID": "AC-17",
    "ControlFamily": "ACCESS CONTROL",
    "ID": "AC-17 (2)",
    "ControlTitle": "REMOTE ACCESS",
    "EnhancementText": "The information system implements cryptographic mechanisms to protect the confidentiality and integrity of remote access sessions.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  The encryption strength of mechanism is selected based on the security categorization of the information. ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "sc-8",
      "sc-12",
      "sc-13"
    ],
    "Parameters": []
  },
  {
    "ControlID": "AC-17",
    "ControlFamily": "ACCESS CONTROL",
    "ID": "AC-17 (3)",
    "ControlTitle": "REMOTE ACCESS",
    "EnhancementText": "The information system routes all remote accesses through [Assignment: organization-defined number] managed network access control points.\n\n",
    "IaseGuidance": "Not appropriate for DoD to define for all CSP's infrastructure or service offerings\n\r\nSource: \r\nDoD RMF TAG",
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Limiting the number of access control points for remote accesses reduces the attack surface for organizations. Organizations consider the Trusted Internet Connections (TIC) initiative requirements for external network connections. ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "sc-7"
    ],
    "Parameters": []
  },
  {
    "ControlID": "AC-17",
    "ControlFamily": "ACCESS CONTROL",
    "ID": "AC-17 (4)",
    "ControlTitle": "REMOTE ACCESS",
    "EnhancementText": "The organization:\n (a)   Authorizes the execution of privileged commands and access to security-relevant information via remote access only for [Assignment: organization-defined needs]; and\n (b)   Documents the rationale for such access in the security plan for the information system.\n\n",
    "IaseGuidance": "a. Not appropriate for DoD to define for all CSP's infrastructure or service offerings\n\r\nSource: \r\nDoD RMF TAG",
    "FedrampGuidance": "",
    "SupplementalGuidance": "  ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "ac-6"
    ],
    "Parameters": []
  },
  {
    "ControlID": "AC-17",
    "ControlFamily": "ACCESS CONTROL",
    "ID": "AC-17 (9)",
    "ControlTitle": "REMOTE ACCESS",
    "EnhancementText": "The organization provides the capability to expeditiously disconnect or disable remote access to the information system within [Assignment: organization-defined time period].\n\n",
    "IaseGuidance": "immediately\n\r\nSource: \r\nDoD RMF TAG",
    "FedrampGuidance": "",
    "SupplementalGuidance": "  This control enhancement requires organizations to have the capability to rapidly disconnect current users remotely accessing the information system and/or disable further remote access. The speed of disconnect or disablement varies based on the criticality of missions/business functions and the need to eliminate immediate or future remote access to organizational information systems.\n",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [],
    "Parameters": [
      {
        "Level": "High",
        "Param": "AC-17 (9) [fifteen (15) minutes]"
      },
      {
        "Level": "Moderate",
        "Param": "AC-17 (9) [fifteen (15) minutes]"
      }
    ]
  },
  {
    "ControlID": "AC-18",
    "ControlFamily": "ACCESS CONTROL",
    "ID": "AC-18 (1)",
    "ControlTitle": "WIRELESS ACCESS",
    "EnhancementText": "The information system protects wireless access to the system using authentication of [Selection\n(one or more): users; devices] and encryption.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "sc-8",
      "sc-13"
    ],
    "Parameters": []
  },
  {
    "ControlID": "AC-18",
    "ControlFamily": "ACCESS CONTROL",
    "ID": "AC-18 (3)",
    "ControlTitle": "WIRELESS ACCESS",
    "EnhancementText": "The organization disables, when not intended for use, wireless networking capabilities internally embedded within information system components prior to issuance and deployment.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  ",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [
      "ac-19"
    ],
    "Parameters": []
  },
  {
    "ControlID": "AC-18",
    "ControlFamily": "ACCESS CONTROL",
    "ID": "AC-18 (4)",
    "ControlTitle": "WIRELESS ACCESS",
    "EnhancementText": "The organization identifies and explicitly authorizes users allowed to independently configure wireless networking capabilities.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Organizational authorizations to allow selected users to configure wireless networking capability are enforced in part, by the access enforcement mechanisms employed within organizational information systems. ",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [
      "ac-3",
      "sc-15"
    ],
    "Parameters": []
  },
  {
    "ControlID": "AC-18",
    "ControlFamily": "ACCESS CONTROL",
    "ID": "AC-18 (5)",
    "ControlTitle": "WIRELESS ACCESS",
    "EnhancementText": "The organization selects radio antennas and calibrates transmission power levels to reduce the probability that usable signals can be received outside of organization-controlled boundaries.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Actions that may be taken by organizations to limit unauthorized use of wireless communications outside of organization-controlled boundaries include, for example: (i) reducing the power of wireless transmissions so that the transmissions are less likely to emit a signal that can be used by adversaries outside of the physical perimeters of organizations; (ii) employing measures such as TEMPEST to control wireless emanations; and (iii) using directional/beam forming antennas that reduce the likelihood that unintended receivers will be able to intercept signals. Prior to taking such actions, organizations can conduct periodic wireless surveys to understand the radio frequency profile of organizational information systems as well as other systems that may be operating in the area. ",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [
      "pe-19"
    ],
    "Parameters": []
  },
  {
    "ControlID": "AC-19",
    "ControlFamily": "ACCESS CONTROL",
    "ID": "AC-19 (5)",
    "ControlTitle": "ACCESS CONTROL FOR MOBILE DEVICES",
    "EnhancementText": "The organization employs [Selection: full-device encryption; container encryption] to protect the confidentiality and integrity of information on [Assignment: organization-defined mobile devices].\n\n",
    "IaseGuidance": "Not appropriate for DoD to define for all CSP's infrastructure or service offerings\n\r\nSource: \r\nDoD RMF TAG",
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Container-based encryption provides a more fine-grained approach to the encryption of data/information on mobile devices, including for example, encrypting selected data structures such as files, records, or fields. ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "mp-5",
      "sc-13",
      "sc-28"
    ],
    "Parameters": []
  },
  {
    "ControlID": "AC-20",
    "ControlFamily": "ACCESS CONTROL",
    "ID": "AC-20 (1)",
    "ControlTitle": "USE OF EXTERNAL INFORMATION SYSTEMS",
    "EnhancementText": "The organization permits authorized individuals to use an external information system to access the information system or to process, store, or transmit organization-controlled information only when the organization:\n (a)   Verifies the implementation of required security controls on the external system as specified in the organization’s information security policy and security plan; or\n (b)   Retains approved information system connection or processing agreements with the organizational entity hosting the external information system.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  This control enhancement recognizes that there are circumstances where individuals using external information systems (e.g., contractors, coalition partners) need to access organizational information systems. In those situations, organizations need confidence that the external information systems contain the necessary security safeguards (i.e., security controls), so as not to compromise, damage, or otherwise harm organizational information systems. Verification that the required security controls have been implemented can be achieved, for example, by third-party, independent assessments, attestations, or other means, depending on the confidence level required by organizations. ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "ca-2"
    ],
    "Parameters": []
  },
  {
    "ControlID": "AC-20",
    "ControlFamily": "ACCESS CONTROL",
    "ID": "AC-20 (2)",
    "ControlTitle": "USE OF EXTERNAL INFORMATION SYSTEMS",
    "EnhancementText": "The organization [Selection: restricts; prohibits] the use of organization-controlled portable storage devices by authorized individuals on external information systems.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Limits on the use of organization-controlled portable storage devices in external information systems include, for example, complete prohibition of the use of such devices or restrictions on how the devices may be used and under what conditions the devices may be used.\n",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "AT-2",
    "ControlFamily": "AWARENESS AND TRAINING",
    "ID": "AT-2 (2)",
    "ControlTitle": "SECURITY AWARENESS TRAINING",
    "EnhancementText": "The organization includes security awareness training on recognizing and reporting potential indicators of insider threat.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Potential indicators and possible precursors of insider threat can include behaviors such as inordinate, long-term job dissatisfaction, attempts to gain access to information not required for job performance, unexplained access to financial resources, bullying or sexual harassment of fellow employees, workplace violence, and other serious violations of organizational policies, procedures, directives, rules, or practices. Security awareness training includes how to communicate employee and management concerns regarding potential indicators of insider threat through appropriate organizational channels in accordance with established organizational policies and procedures. ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "pl-4",
      "pm-12",
      "ps-3",
      "ps-6"
    ],
    "Parameters": []
  },
  {
    "ControlID": "AT-3",
    "ControlFamily": "AWARENESS AND TRAINING",
    "ID": "AT-3 (3)",
    "ControlTitle": "ROLE-BASED SECURITY TRAINING",
    "EnhancementText": "The organization includes practical exercises in security training that reinforce training objectives.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Practical exercises may include, for example, security training for software developers that includes simulated cyber attacks exploiting common software vulnerabilities (e.g., buffer overflows), or spear/whale phishing attacks targeted at senior leaders/executives. These types of practical exercises help developers better understand the effects of such vulnerabilities and appreciate the need for security coding standards and processes.\n",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "AT-3",
    "ControlFamily": "AWARENESS AND TRAINING",
    "ID": "AT-3 (4)",
    "ControlTitle": "ROLE-BASED SECURITY TRAINING",
    "EnhancementText": "The organization provides training to its personnel on [Assignment: organization-defined indicators of malicious code] to recognize suspicious communications and anomalous behavior in organizational information systems.\n\n",
    "IaseGuidance": "Not appropriate for DoD to define for all CSP's infrastructure or service offerings\n\r\nSource: \r\nDoD RMF TAG",
    "FedrampGuidance": "",
    "SupplementalGuidance": "  A well-trained workforce provides another organizational safeguard that can be employed as part of a defense-in-depth strategy to protect organizations against malicious code coming in to organizations via email or the web applications. Personnel are trained to look for indications of potentially suspicious email (e.g., receiving an unexpected email, receiving an email containing strange or poor grammar, or receiving an email from an unfamiliar sender but who appears to be from a known sponsor or contractor). Personnel are also trained on how to respond to such suspicious email or web communications (e.g., not opening attachments, not clicking on embedded web links, and checking the source of email addresses). For this process to work effectively, all organizational personnel are trained and made aware of what constitutes suspicious communications. Training personnel on how to recognize anomalous behaviors in organizational information systems can potentially provide early warning for the presence of malicious code. Recognition of such anomalous behavior by organizational personnel can supplement automated malicious code detection and protection tools and systems employed by organizations.",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [],
    "Parameters": [
      {
        "Level": "High",
        "Param": "AT-3 (4) [malicious code indicators as defined by organization  incident policy/capability]"
      }
    ]
  },
  {
    "ControlID": "AU-2",
    "ControlFamily": "AUDIT AND ACCOUNTABILITY",
    "ID": "AU-2 (3)",
    "ControlTitle": "AUDIT EVENTS",
    "EnhancementText": "The organization reviews and updates the audited events [Assignment: organization-defined frequency].\n\n",
    "IaseGuidance": "Annually and based on situational awareness of threats, vulnerabilities\n\r\nSource: \r\nDoD RMF TAG",
    "FedrampGuidance": "AU-2 (3) Guidance: Annually or whenever changes in the threat environment are communicated to the service provider by the JAB/AO.",
    "SupplementalGuidance": "  Over time, the events that organizations believe should be audited may change. Reviewing and updating the set of audited events periodically is necessary to ensure that the current set is still necessary and sufficient.\n",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [],
    "Parameters": [
      {
        "Level": "High",
        "Param": "AU-2 (3) [annually or whenever there is a change in the threat environment] "
      },
      {
        "Level": "Moderate",
        "Param": "AU-2 (3) [annually or whenever there is a change in the threat environment] "
      }
    ]
  },
  {
    "ControlID": "AU-3",
    "ControlFamily": "AUDIT AND ACCOUNTABILITY",
    "ID": "AU-3 (1)",
    "ControlTitle": "CONTENT OF AUDIT RECORDS",
    "EnhancementText": "The information system generates audit records containing the following additional information: [Assignment: organization-defined additional, more detailed information].\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "AU-3 (1) Guidance: For client-server transactions, the number of bytes sent and received gives bidirectional transfer information that can be helpful during an investigation or inquiry.",
    "SupplementalGuidance": "  Detailed information that organizations may consider in audit records includes, for example, full text recording of privileged commands or the individual identities of group account users. Organizations consider limiting the additional audit information to only that information explicitly needed for specific audit requirements. This facilitates the use of audit trails and audit logs by not including information that could potentially be misleading or could make it more difficult to locate information of interest.\n",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [],
    "Parameters": [
      {
        "Level": "High",
        "Param": "AU-3 (1) [session, connection, transaction, or activity duration; for client-server transactions, the number of bytes received and bytes sent; additional informational messages to diagnose or identify the event; characteristics that describe or identify the object or resource being acted upon; individual identities of group account users; full-text of privileged commands]"
      },
      {
        "Level": "Moderate",
        "Param": "AU-3 (1) [Assignment: organization-defined additional, more detailed information]                                                                            Parameter: [session, connection, transaction, or activity duration; for client-server transactions, the number of bytes received and bytes sent; additional informational messages to diagnose or identify the event; characteristics that describe or identify the object or resource being acted upon]"
      }
    ]
  },
  {
    "ControlID": "AU-3",
    "ControlFamily": "AUDIT AND ACCOUNTABILITY",
    "ID": "AU-3 (2)",
    "ControlTitle": "CONTENT OF AUDIT RECORDS",
    "EnhancementText": "The information system provides centralized management and configuration of the content to be captured in audit records generated by [Assignment: organization-defined information system components].\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": " This control enhancement requires that the content to be captured in audit records be configured from a central location (necessitating automation). Organizations coordinate the selection of required audit content to support the centralized management and configuration capability provided by the information system. ",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [
      "au-6",
      "au-7"
    ],
    "Parameters": [
      {
        "Level": "High",
        "Param": "AU-3 (2) [all network, data storage, and computing devices]"
      }
    ]
  },
  {
    "ControlID": "AU-5",
    "ControlFamily": "AUDIT AND ACCOUNTABILITY",
    "ID": "AU-5 (1)",
    "ControlTitle": "RESPONSE TO AUDIT PROCESSING FAILURES",
    "EnhancementText": "The information system provides a warning to [Assignment: organization-defined personnel, roles, and/or locations] within [Assignment: organization-defined time period] when allocated audit record storage volume reaches [Assignment: organization-defined percentage] of repository maximum audit record storage capacity.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Organizations may have multiple audit data storage repositories distributed across multiple information system components, with each repository having different storage volume capacities.\n",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "AU-5",
    "ControlFamily": "AUDIT AND ACCOUNTABILITY",
    "ID": "AU-5 (2)",
    "ControlTitle": "RESPONSE TO AUDIT PROCESSING FAILURES",
    "EnhancementText": "The information system provides an alert in [Assignment: organization-defined real-time period] to [Assignment: organization-defined personnel, roles, and/or locations] when the following audit failure events occur: [Assignment: organization-defined audit failure events requiring real-time alerts].\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Alerts provide organizations with urgent messages. Real-time alerts provide these messages at information technology speed (i.e., the time from event detection to alert occurs in seconds or less).\n",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [],
    "Parameters": [
      {
        "Level": "High",
        "Param": "AU-5 (2)-1 [real-time] \nAU-5 (1)-2 [service provider personnel with authority to address failed audit events] \nAU-5 (1)-3 [audit failure events requiring real-time alerts, as defined by organization  audit policy]."
      }
    ]
  },
  {
    "ControlID": "AU-6",
    "ControlFamily": "AUDIT AND ACCOUNTABILITY",
    "ID": "AU-6 (1)",
    "ControlTitle": "AUDIT REVIEW, ANALYSIS, AND REPORTING",
    "EnhancementText": "The organization employs automated mechanisms to integrate audit review, analysis, and reporting processes to support organizational processes for investigation and response to suspicious activities.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Organizational processes benefiting from integrated audit review, analysis, and reporting include, for example, incident response, continuous monitoring, contingency planning, and Inspector General audits. ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "au-12",
      "pm-7"
    ],
    "Parameters": []
  },
  {
    "ControlID": "AU-6",
    "ControlFamily": "AUDIT AND ACCOUNTABILITY",
    "ID": "AU-6 (3)",
    "ControlTitle": "AUDIT REVIEW, ANALYSIS, AND REPORTING",
    "EnhancementText": "The organization analyzes and correlates audit records across different repositories to gain organization-wide situational awareness.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Organization-wide situational awareness includes awareness across all three tiers of risk management (i.e., organizational, mission/business process, and information system) and supports cross-organization awareness. ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "au-12",
      "ir-4"
    ],
    "Parameters": []
  },
  {
    "ControlID": "AU-6",
    "ControlFamily": "AUDIT AND ACCOUNTABILITY",
    "ID": "AU-6 (4)",
    "ControlTitle": "AUDIT REVIEW, ANALYSIS, AND REPORTING",
    "EnhancementText": "The information system provides the capability to centrally review and analyze audit records from multiple components within the system.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Automated mechanisms for centralized reviews and analyses include, for example, Security Information Management products. ",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [
      "au-2",
      "au-12"
    ],
    "Parameters": []
  },
  {
    "ControlID": "AU-6",
    "ControlFamily": "AUDIT AND ACCOUNTABILITY",
    "ID": "AU-6 (5)",
    "ControlTitle": "AUDIT REVIEW, ANALYSIS, AND REPORTING",
    "EnhancementText": "The organization integrates analysis of audit records with analysis of [Selection (one or more): vulnerability scanning information; performance data; information system monitoring information; [Assignment: organization-defined data/information collected from other sources]] to further enhance the ability to identify inappropriate or unusual activity.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  This control enhancement does not require vulnerability scanning, the generation of performance data, or information system monitoring. Rather, the enhancement requires that the analysis of information being otherwise produced in these areas is integrated with the analysis of audit information. Security Event and Information Management System tools can facilitate audit record aggregation/consolidation from multiple information system components as well as audit record correlation and analysis. The use of standardized audit record analysis scripts developed by organizations (with localized script adjustments, as necessary) provides more cost-effective approaches for analyzing audit record information collected. The correlation of audit record information with vulnerability scanning information is important in determining the veracity of vulnerability scans and correlating attack detection events with scanning results. Correlation with performance data can help uncover denial of service attacks or cyber attacks resulting in unauthorized use of resources. Correlation with system monitoring information can assist in uncovering attacks and in better relating audit information to operational situations. ",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [
      "au-12",
      "ir-4",
      "ra-5"
    ],
    "Parameters": [
      {
        "Level": "High",
        "Param": "AU-6 (5) [Selection (one or more): vulnerability scanning information; performance data; information system monitoring information; penetration test data; [Organization -defined data/information collected from other sources]]"
      }
    ]
  },
  {
    "ControlID": "AU-6",
    "ControlFamily": "AUDIT AND ACCOUNTABILITY",
    "ID": "AU-6 (6)",
    "ControlTitle": "AUDIT REVIEW, ANALYSIS, AND REPORTING",
    "EnhancementText": "The organization correlates information from audit records with information obtained from monitoring physical access to further enhance the ability to identify suspicious, inappropriate, unusual, or malevolent activity.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "AU-6 (6) Requirement: Coordination between service provider and consumer shall be documented and accepted by the JAB/AO.",
    "SupplementalGuidance": "  The correlation of physical audit information and audit logs from information systems may assist organizations in identifying examples of suspicious behavior or supporting evidence of such behavior. For example, the correlation of an individual’s identify for logical access to certain information systems with the additional physical security information that the individual was actually present at the facility when the logical access occurred, may prove to be useful in investigations.\n",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "AU-6",
    "ControlFamily": "AUDIT AND ACCOUNTABILITY",
    "ID": "AU-6 (7)",
    "ControlTitle": "AUDIT REVIEW, ANALYSIS, AND REPORTING",
    "EnhancementText": "The organization specifies the permitted actions for each [Selection (one or more): information system process; role; user] associated with the review, analysis, and reporting of audit information.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Organizations specify permitted actions for information system processes, roles, and/or users associated with the review, analysis, and reporting of audit records through account management techniques. Specifying permitted actions on audit information is a way to enforce the principle of least privilege. Permitted actions are enforced by the information system and include, for example, read, write, execute, append, and delete.\n",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [],
    "Parameters": [
      {
        "Level": "High",
        "Param": "AU-6 (7) [information system process; role; user] "
      }
    ]
  },
  {
    "ControlID": "AU-6",
    "ControlFamily": "AUDIT AND ACCOUNTABILITY",
    "ID": "AU-6 (10)",
    "ControlTitle": "AUDIT REVIEW, ANALYSIS, AND REPORTING",
    "EnhancementText": "The organization adjusts the level of audit review, analysis, and reporting within the information system when there is a change in risk based on law enforcement information, intelligence information, or other credible sources of information.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  The frequency, scope, and/or depth of the audit review, analysis, and reporting may be adjusted to meet organizational needs based on new information received.\n",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "AU-7",
    "ControlFamily": "AUDIT AND ACCOUNTABILITY",
    "ID": "AU-7 (1)",
    "ControlTitle": "AUDIT REDUCTION AND REPORT GENERATION",
    "EnhancementText": "The information system provides the capability to process audit records for events of interest based on [Assignment: organization-defined audit fields within audit records].\n\n",
    "IaseGuidance": "Not appropriate for DoD to define for all CSP's infrastructure or service offerings\n\r\nSource: \r\nDoD RMF TAG",
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Events of interest can be identified by the content of specific audit record fields including, for example, identities of individuals, event types, event locations, event times, event dates, system resources involved, IP addresses involved, or information objects accessed. Organizations may define audit event criteria to any degree of granularity required, for example, locations selectable by general networking location (e.g., by network or subnetwork) or selectable by specific information system component. ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "au-2",
      "au-12"
    ],
    "Parameters": []
  },
  {
    "ControlID": "AU-8",
    "ControlFamily": "AUDIT AND ACCOUNTABILITY",
    "ID": "AU-8 (1)",
    "ControlTitle": "TIME STAMPS",
    "EnhancementText": "The information system:\n (a)   Compares the internal information system clocks [Assignment: organization-defined frequency] with [Assignment: organization-defined authoritative time source]; and\n (b)   Synchronizes the internal system clocks to the authoritative time source when the time difference is greater than [Assignment: organization-defined time period].\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "AU-8 (1) Requirement: The service provider selects primary and secondary time servers used by the NIST Internet time service. The secondary server is selected from a different geographic region than the primary server.\nAU-8 (1) Requirement: The service provider synchronizes the system clocks of network computers that run operating systems other than Windows to the Windows Server Domain Controller emulator or to the same time source for that server.\nAU-8 (1) Guidance: Synchronization of system clocks improves the accuracy of log analysis.",
    "SupplementalGuidance": "  This control enhancement provides uniformity of time stamps for information systems with multiple system clocks and systems connected over a network.\n",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [],
    "Parameters": [
      {
        "Level": "High",
        "Param": "AU-8 (1) [http://tf.nist.gov/tf-cgi/servers.cgi] [At least hourly]"
      },
      {
        "Level": "Moderate",
        "Param": "AU-8 (1) [http://tf.nist.gov/tf-cgi/servers.cgi] [At least hourly]"
      }
    ]
  },
  {
    "ControlID": "AU-9",
    "ControlFamily": "AUDIT AND ACCOUNTABILITY",
    "ID": "AU-9 (2)",
    "ControlTitle": "PROTECTION OF AUDIT INFORMATION",
    "EnhancementText": "The information system backs up audit records [Assignment: organization-defined frequency] onto a physically different system or system component than the system or component being audited.\n\n",
    "IaseGuidance": "every seven days\n\r\nSource: \r\nDoD RMF TAG",
    "FedrampGuidance": "",
    "SupplementalGuidance": " This control enhancement helps to ensure that a compromise of the information system being audited does not also result in a compromise of the audit records. ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "au-4",
      "au-5",
      "au-11"
    ],
    "Parameters": [
      {
        "Level": "High",
        "Param": "AU-9 (2) [at least weekly] "
      },
      {
        "Level": "Moderate",
        "Param": "AU-9 (2) [at least weekly] "
      }
    ]
  },
  {
    "ControlID": "AU-9",
    "ControlFamily": "AUDIT AND ACCOUNTABILITY",
    "ID": "AU-9 (3)",
    "ControlTitle": "PROTECTION OF AUDIT INFORMATION",
    "EnhancementText": "The information system implements cryptographic mechanisms to protect the integrity of audit information and audit tools.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Cryptographic mechanisms used for protecting the integrity of audit information include, for example, signed hash functions using asymmetric cryptography enabling distribution of the public key to verify the hash information while maintaining the confidentiality of the secret key used to generate the hash. ",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [
      "au-10",
      "sc-12",
      "sc-13"
    ],
    "Parameters": []
  },
  {
    "ControlID": "AU-9",
    "ControlFamily": "AUDIT AND ACCOUNTABILITY",
    "ID": "AU-9 (4)",
    "ControlTitle": "PROTECTION OF AUDIT INFORMATION",
    "EnhancementText": "The organization authorizes access to management of audit functionality to only [Assignment: organization-defined subset of privileged users].\n\n",
    "IaseGuidance": "Not appropriate for DoD to define for all CSP's infrastructure or service offerings\n\r\nSource: \r\nDoD RMF TAG",
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Individuals with privileged access to an information system and who are also the subject of an audit by that system, may affect the reliability of audit information by inhibiting audit activities or modifying audit records. This control enhancement requires that privileged access be further defined between audit-related privileges and other privileges, thus limiting the users with audit-related privileges. ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "ac-5"
    ],
    "Parameters": []
  },
  {
    "ControlID": "AU-12",
    "ControlFamily": "AUDIT AND ACCOUNTABILITY",
    "ID": "AU-12 (1)",
    "ControlTitle": "AUDIT GENERATION",
    "EnhancementText": "The information system compiles audit records from [Assignment: organization-defined information system components] into a system-wide (logical or physical) audit trail that is time- correlated to within [Assignment: organization-defined level of tolerance for relationship between time stamps of individual records in the audit trail].\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Audit trails are time-correlated if the time stamps in the individual audit records can be reliably related to the time stamps in other audit records to achieve a time ordering of the records within organizational tolerances. ",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [
      "au-8",
      "au-12"
    ],
    "Parameters": [
      {
        "Level": "High",
        "Param": "AU-12 (1) [all network, data storage, and computing devices]"
      }
    ]
  },
  {
    "ControlID": "AU-12",
    "ControlFamily": "AUDIT AND ACCOUNTABILITY",
    "ID": "AU-12 (3)",
    "ControlTitle": "AUDIT GENERATION",
    "EnhancementText": "The information system provides the capability for [Assignment: organization-defined individuals or roles] to change the auditing to be performed on [Assignment: organization-defined information system components] based on [Assignment: organization-defined selectable event criteria] within [Assignment: organization-defined time thresholds].\n\n",
    "IaseGuidance": "Not appropriate for DoD to define for all CSP's infrastructure or service offerings; \n\r\nNot appropriate for DoD to define for all CSP's infrastructure or service offerings; \n\r\nNot appropriate for DoD to define for all CSP's infrastructure or service offerings; \n\r\nNot appropriate for DoD to define for all CSP's infrastructure or service offerings\n\r\nSource: \r\nDoD RMF TAG",
    "FedrampGuidance": "",
    "SupplementalGuidance": "  This control enhancement enables organizations to extend or limit auditing as necessary to meet organizational requirements. Auditing that is limited to conserve information system resources may be extended to address certain threat situations. In addition, auditing may be limited to a specific set of events to facilitate audit reduction, analysis, and reporting. Organizations can establish time thresholds in which audit actions are changed, for example, near real-time, within minutes, or within hours. ",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [
      "au-7"
    ],
    "Parameters": [
      {
        "Level": "High",
        "Param": "AU-12 (3) (1) [service provider-defined individuals or roles with audit configuration responsibilities]  \nAU-12 (3) (2) [all network, data storage, and computing devices]"
      }
    ]
  },
  {
    "ControlID": "CA-2",
    "ControlFamily": "SECURITY ASSESSMENT AND AUTHORIZATION",
    "ID": "CA-2 (1)",
    "ControlTitle": "SECURITY ASSESSMENTS",
    "EnhancementText": "The organization employs assessors or assessment teams with [Assignment: organization-defined level of independence] to conduct security control assessments.\n\n",
    "IaseGuidance": "Not appropriate for DoD to define for all CSP's infrastructure or service offerings\n\r\nSource: \r\nDoD RMF TAG",
    "FedrampGuidance": "CA-2 (1) Requirement: For JAB Authorization, must use an accredited 3PAO.",
    "SupplementalGuidance": "  Independent assessors or assessment teams are individuals or groups who conduct impartial assessments of organizational information systems. Impartiality implies that assessors are free from any perceived or actual conflicts of interest with regard to the development, operation, or management of the organizational information systems under assessment or to the determination of security control effectiveness. To achieve impartiality, assessors should not: (i) create a mutual or conflicting interest with the organizations where the assessments are being conducted; (ii) assess their own work; (iii) act as management or employees of the organizations they are serving; or (iv) place themselves in positions of advocacy for the organizations acquiring their services. Independent assessments can be obtained from elements within organizations or can be contracted to public or private sector entities outside of organizations. Authorizing officials determine the required level of independence based on the security categories of information systems and/or the ultimate risk to organizational operations, organizational assets, or individuals. Authorizing officials also determine if the level of assessor independence provides sufficient assurance that the results are sound and can be used to make credible, risk-based decisions. This includes determining whether contracted security assessment services have sufficient independence, for example, when information system owners are not directly involved in contracting processes or cannot unduly influence the impartiality of assessors conducting assessments. In special situations,\nfor example, when organizations that own the information systems are small or organizational structures require that assessments are conducted by individuals that are in the developmental, operational, or management chain of system owners, independence in assessment processes can be achieved by ensuring that assessment results are carefully reviewed and analyzed by independent teams of experts to validate the completeness, accuracy, integrity, and reliability of the results. Organizations recognize that assessments performed for purposes other than direct support to authorization decisions are, when performed by assessors with sufficient independence, more likely to be useable for such decisions, thereby reducing the need to\nrepeat assessments.",
    "Impacts": [
      "High",
      "Moderate",
      "Low"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "CA-2",
    "ControlFamily": "SECURITY ASSESSMENT AND AUTHORIZATION",
    "ID": "CA-2 (2)",
    "ControlTitle": "SECURITY ASSESSMENTS",
    "EnhancementText": "The organization includes as part of security control assessments, [Assignment: organization- defined frequency], [Selection: announced; unannounced], [Selection (one or more): in-depth monitoring; vulnerability scanning; malicious user testing; insider threat assessment; performance/load testing; [Assignment: organization-defined other forms of security assessment]].\n\n",
    "IaseGuidance": "annually\n\r\nNot appropriate for DoD to define for all CSP's infrastructure or service offerings\n\r\nNot appropriate for DoD to define for all CSP's infrastructure or service offerings\n\r\nNot appropriate for DoD to define for all CSP's infrastructure or service offerings\n\r\nSource: \r\nDoD RMF TAG",
    "FedrampGuidance": "CA-2 (2) Requirement: To include 'announced', 'vulnerability scanning'",
    "SupplementalGuidance": "  Organizations can employ information system monitoring, insider threat assessments, malicious user testing, and other forms of testing (e.g., verification and validation) to improve readiness by exercising organizational capabilities and indicating current performance levels as a means of focusing actions to improve security. Organizations conduct assessment activities in accordance with applicable federal laws, Executive Orders, directives, policies, regulations, and standards. Authorizing officials approve the assessment methods in coordination with the organizational risk executive function. Organizations can incorporate vulnerabilities uncovered during assessments into vulnerability remediation processes. ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "pe-3",
      "si-2"
    ],
    "Parameters": [
      {
        "Level": "High",
        "Param": "CA-2 (2) [at least annually]"
      },
      {
        "Level": "Moderate",
        "Param": "CA-2 (2) [at least annually]"
      }
    ]
  },
  {
    "ControlID": "CA-2",
    "ControlFamily": "SECURITY ASSESSMENT AND AUTHORIZATION",
    "ID": "CA-2 (3)",
    "ControlTitle": "SECURITY ASSESSMENTS",
    "EnhancementText": "The organization accepts the results of an assessment of [Assignment: organization-defined information system] performed by [Assignment: organization-defined external organization] when the assessment meets [Assignment: organization-defined requirements].\n\n",
    "IaseGuidance": "Not appropriate for DoD to define for all CSP's infrastructure or service offerings\n\r\nNot appropriate for DoD to define for all CSP's infrastructure or service offerings\n\r\nNot appropriate for DoD to define for all CSP's infrastructure or service offerings\n\r\nSource: \r\nDoD RMF TAG",
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Organizations may often rely on assessments of specific information systems by other (external) organizations. Utilizing such existing assessments (i.e., reusing existing assessment evidence) can significantly decrease the time and resources required for organizational assessments by limiting the amount of independent assessment activities that organizations need to perform. The factors that organizations may consider in determining whether to accept assessment results from external organizations can vary. Determinations for accepting assessment results can be based on, for example, past assessment experiences one organization has had with another organization, the reputation that organizations have with regard to assessments, the level of detail of supporting assessment documentation provided, or mandates imposed upon organizations by federal legislation, policies, or directives.\n",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [],
    "Parameters": [
      {
        "Level": "High",
        "Param": "CA-2 (3)-1 [any FedRAMP Accredited 3PAO]\nCA-2 (3)-1-2 [any FedRAMP Accredited 3PAO]\nCA-2 (3)-1-3 [the conditions of the JAB/AO in the FedRAMP Repository]"
      },
      {
        "Level": "Moderate",
        "Param": "CA-2 (3)-1 [any FedRAMP Accredited 3PAO]\nCA-2 (3)-1-2 [any FedRAMP Accredited 3PAO]\nCA-2 (3)-1-3 [the conditions of the JAB/AO in the FedRAMP Repository]"
      }
    ]
  },
  {
    "ControlID": "CA-3",
    "ControlFamily": "SECURITY ASSESSMENT AND AUTHORIZATION",
    "ID": "CA-3 (3)",
    "ControlTitle": "SYSTEM INTERCONNECTIONS",
    "EnhancementText": "The organization prohibits the direct connection of an [Assignment: organization-defined unclassified, non-national security system] to an external network without the use of [Assignment; organization-defined boundary protection device].\n\n",
    "IaseGuidance": "Not appropriate for DoD to define for all CSP's infrastructure or service offerings\n\r\nNot appropriate for DoD to define for all CSP's infrastructure or service offerings\n\r\nSource: \r\nDoD RMF TAG",
    "FedrampGuidance": "CA-3 (3) Guidance: Refer to Appendix H – Cloud Considerations of the TIC 2.0 Reference Architecture document.",
    "SupplementalGuidance": "  Organizations typically do not have control over external networks (e.g., the Internet). Approved boundary protection devices (e.g., routers, firewalls) mediate communications (i.e., information flows) between unclassified non-national security systems and external networks. This control enhancement is required for organizations processing, storing, or transmitting Controlled Unclassified Information (CUI).\n",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [],
    "Parameters": [
      {
        "Level": "High",
        "Param": "CA-3 (3)-2 [Boundary Protections which meet the Trusted Internet Connection (TIC) requirements]"
      },
      {
        "Level": "Moderate",
        "Param": "CA-3 (3)-2 [Boundary Protections which meet the Trusted Internet Connection (TIC) requirements]"
      }
    ]
  },
  {
    "ControlID": "CA-3",
    "ControlFamily": "SECURITY ASSESSMENT AND AUTHORIZATION",
    "ID": "CA-3 (5)",
    "ControlTitle": "SYSTEM INTERCONNECTIONS",
    "EnhancementText": "The organization employs [Selection: allow-all, deny-by-exception; deny-all, permit-by-exception] policy for allowing [Assignment: organization-defined information systems] to connect to external information systems.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "CA-3 (5) Guidance: For JAB Authorization, CSPs shall include details of this control in their Architecture Briefing",
    "SupplementalGuidance": "  Organizations can constrain information system connectivity to external domains (e.g., websites) by employing one of two policies with regard to such connectivity: (i) allow-all, deny by exception, also known as blacklisting (the weaker of the two policies); or (ii) deny-all, allow by exception, also known as whitelisting (the stronger of the two policies). For either policy, organizations determine what exceptions, if any, are acceptable. ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "cm-7"
    ],
    "Parameters": [
      {
        "Level": "High",
        "Param": "CA-3 (5) [deny-all, permit by exception]\n\n[any systems]"
      }
    ]
  },
  {
    "ControlID": "CA-7",
    "ControlFamily": "SECURITY ASSESSMENT AND AUTHORIZATION",
    "ID": "CA-7 (1)",
    "ControlTitle": "CONTINUOUS MONITORING",
    "EnhancementText": "The organization employs assessors or assessment teams with [Assignment: organization-defined level of independence] to monitor the security controls in the information system on an ongoing basis.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Organizations can maximize the value of assessments of security controls during the continuous monitoring process by requiring that such assessments be conducted by assessors or assessment teams with appropriate levels of independence based on continuous monitoring strategies. Assessor independence provides a degree of impartiality to the monitoring process. To achieve such impartiality, assessors should not: (i) create a mutual or conflicting interest with the organizations where the assessments are being conducted; (ii) assess their own work; (iii) act as management or employees of the organizations they are serving; or (iv) place themselves in advocacy positions for the organizations acquiring their services.\n",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "CA-7",
    "ControlFamily": "SECURITY ASSESSMENT AND AUTHORIZATION",
    "ID": "CA-7 (3)",
    "ControlTitle": "CONTINUOUS MONITORING",
    "EnhancementText": "The organization employs trend analyses to determine if security control implementations, the frequency of continuous monitoring activities, and/or the types of activities used in the continuous monitoring process need to be modified based on empirical data.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Trend analyses can include, for example, examining recent threat information regarding the types of threat events that have occurred within the organization or across the federal government, success rates of certain types of cyber attacks, emerging vulnerabilities in information technologies, evolving social engineering techniques, results from multiple security control assessments, the effectiveness of configuration settings, and findings from Inspectors General or auditors.\n",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "CA-8",
    "ControlFamily": "SECURITY ASSESSMENT AND AUTHORIZATION",
    "ID": "CA-8 (1)",
    "ControlTitle": "PENETRATION TESTING",
    "EnhancementText": "The organization employs an independent penetration agent or penetration team to perform penetration testing on the information system or system components.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Independent penetration agents or teams are individuals or groups who conduct impartial penetration testing of organizational information systems. Impartiality implies that penetration agents or teams are free from any perceived or actual conflicts of interest with regard to the development, operation, or management of the information systems that are the targets of the penetration testing. Supplemental guidance for CA-2 (1) provides additional information regarding independent assessments that can be applied to penetration testing. ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "ca-2"
    ],
    "Parameters": []
  },
  {
    "ControlID": "CM-2",
    "ControlFamily": "CONFIGURATION MANAGEMENT",
    "ID": "CM-2 (1)",
    "ControlTitle": "BASELINE CONFIGURATION",
    "EnhancementText": "The organization reviews and updates the baseline configuration of the information system: \n (a)   [Assignment: organization-defined frequency];\n (b)   When required due to [Assignment organization-defined circumstances]; and\n (c)   As an integral part of information system component installations and upgrades.\n\n",
    "IaseGuidance": "a. annually;\r\nb. baseline configuration changes or as events dictate such as changes due to USCYBERCOM tactical orders/ directives or cyber attacks.\n\r\nSource: \r\nDoD RMF TAG",
    "FedrampGuidance": "CM-2 (1) (a) Guidance: Significant change is defined in NIST Special Publication 800-37 Revision 1, Appendix F, page F-7.",
    "SupplementalGuidance": "  ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "cm-5"
    ],
    "Parameters": [
      {
        "Level": "High",
        "Param": "CM-2 (1) (a) [at least annually or when a significant change occurs]\nCM-2 (1) (b) [to include when  directed by the JAB]"
      },
      {
        "Level": "Moderate",
        "Param": "CM-2 (1) (a) [at least annually or when a significant change occurs]\nCM-2 (1) (b) [to include when  directed by the JAB]"
      }
    ]
  },
  {
    "ControlID": "CM-2",
    "ControlFamily": "CONFIGURATION MANAGEMENT",
    "ID": "CM-2 (2)",
    "ControlTitle": "BASELINE CONFIGURATION",
    "EnhancementText": "The organization employs automated mechanisms to maintain an up-to-date, complete, accurate, and readily available baseline configuration of the information system.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Automated mechanisms that help organizations maintain consistent baseline configurations for information systems include, for example, hardware and software inventory tools, configuration management tools, and network management tools. Such tools can be deployed and/or allocated as common controls, at the information system level, or at the operating system or component level (e.g., on workstations, servers, notebook computers, network components, or mobile devices). Tools can be used, for example, to track version numbers on operating system applications, types of software installed, and current patch levels. This control enhancement can be satisfied by the implementation of CM-8 (2) for organizations that choose to combine information system component inventory and baseline configuration activities. ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "cm-7",
      "ra-5"
    ],
    "Parameters": []
  },
  {
    "ControlID": "CM-2",
    "ControlFamily": "CONFIGURATION MANAGEMENT",
    "ID": "CM-2 (3)",
    "ControlTitle": "BASELINE CONFIGURATION",
    "EnhancementText": "The organization retains [Assignment: organization-defined previous versions of baseline configurations of the information system] to support rollback.\n\n",
    "IaseGuidance": "the previous approved baseline configuration of IS components for a minimum of 3 month\n\r\nSource: \r\nDoD RMF TAG",
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Retaining previous versions of baseline configurations to support rollback may include, for example, hardware, software, firmware, configuration files, and configuration records.\n",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [],
    "Parameters": [
      {
        "Level": "High",
        "Param": "CM-2 (3) [organization-defined previous versions of baseline configurations of the previously approved baseline configuration of IS components]"
      }
    ]
  },
  {
    "ControlID": "CM-2",
    "ControlFamily": "CONFIGURATION MANAGEMENT",
    "ID": "CM-2 (7)",
    "ControlTitle": "BASELINE CONFIGURATION",
    "EnhancementText": "The organization:\n (a)   Issues [Assignment: organization-defined information systems, system components, or devices] with [Assignment: organization-defined configurations] to individuals traveling to locations that the organization deems to be of significant risk; and\n (b)   Applies [Assignment: organization-defined security safeguards] to the devices when the individuals return.\n\n",
    "IaseGuidance": "a. Not appropriate for DoD to define for all CSP's infrastructure or service offerings;\r\na. Not appropriate for DoD to define for all CSP's infrastructure or service offerings;\r\nb. Not appropriate for DoD to define for all CSP's infrastructure or service offerings\n\r\nSource: \r\nDoD RMF TAG",
    "FedrampGuidance": "",
    "SupplementalGuidance": "  When it is known that information systems, system components, or devices (e.g., notebook computers, mobile devices) will be located in high-risk areas, additional security controls may be implemented to counter the greater threat in such areas coupled with the lack of physical security relative to organizational-controlled areas. For example, organizational policies and procedures for notebook computers used by individuals departing on and returning from travel include, for example, determining which locations are of concern, defining required configurations for the devices, ensuring that the devices are configured as intended before travel is initiated, and applying specific safeguards to the device after travel is completed. Specially configured notebook computers include, for\nexample, computers with sanitized hard drives, limited applications, and additional hardening (e.g., more stringent configuration settings). Specified safeguards applied to mobile devices upon return from travel include, for example, examining the device for signs of physical tampering and purging/reimaging the hard disk drive. Protecting information residing on mobile devices is covered in the media protection family..\\\n",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "CM-3",
    "ControlFamily": "CONFIGURATION MANAGEMENT",
    "ID": "CM-3 (1)",
    "ControlTitle": "CONFIGURATION CHANGE CONTROL",
    "EnhancementText": "The organization employs automated mechanisms to:\n (a)   Document proposed changes to the information system;\n (b)   Notify [Assignment: organized-defined approval authorities] of proposed changes to the information system and request change approval;\n (c)   Highlight proposed changes to the information system that have not been approved or disapproved by [Assignment: organization-defined time period];\n (d)   Prohibit changes to the information system until designated approvals are received; \n (e)   Document all changes to the information system; and\n (f) Notify [Assignment: organization-defined personnel] when approved changes to the information system are completed.\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [],
    "Parameters": [
      {
        "Level": "High",
        "Param": "CM-3 (1) (c)  [organization agreed upon time period] \nCM-3 (1) (f) [organization defined configuration management approval authorities] "
      }
    ]
  },
  {
    "ControlID": "CM-3",
    "ControlFamily": "CONFIGURATION MANAGEMENT",
    "ID": "CM-3 (2)",
    "ControlTitle": "CONFIGURATION CHANGE CONTROL",
    "EnhancementText": "The organization tests, validates, and documents changes to the information system before implementing the changes on the operational system.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Changes to information systems include modifications to hardware, software, or firmware components and configuration settings defined in CM-6. Organizations ensure that testing does not interfere with information system operations. Individuals/groups conducting tests understand organizational security policies and procedures, information system security policies and procedures, and the specific health, safety, and environmental risks associated with particular facilities/processes. Operational systems may need to be taken off-line, or replicated to the extent feasible, before testing can be conducted. If information systems must be taken off-line for testing, the tests are scheduled to occur during planned system outages whenever possible. If testing cannot be conducted on operational systems, organizations employ compensating controls (e.g., testing on replicated systems).\n",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "CM-3",
    "ControlFamily": "CONFIGURATION MANAGEMENT",
    "ID": "CM-3 (4)",
    "ControlTitle": "CONFIGURATION CHANGE CONTROL",
    "EnhancementText": "The organization requires an information security representative to be a member of the [Assignment: organization-defined configuration change control element].\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Information security representatives can include, for example, senior agency information security officers, information system security officers, or information system security managers. Representation by personnel with information security expertise is important because changes to information system configurations can have unintended side effects, some of which may be security-relevant. Detecting such changes early in the process can help avoid unintended, negative consequences that could ultimately affect the security state of organizational information systems. The configuration change control element in this control enhancement reflects the change control elements defined by organizations in CM-3.\n",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [],
    "Parameters": [
      {
        "Level": "High",
        "Param": "CM-3 (4) Configuration control board (CCB) or similar (as defined in CM-3)"
      }
    ]
  },
  {
    "ControlID": "CM-3",
    "ControlFamily": "CONFIGURATION MANAGEMENT",
    "ID": "CM-3 (6)",
    "ControlTitle": "CONFIGURATION CHANGE CONTROL",
    "EnhancementText": "The organization ensures that cryptographic mechanisms used to provide [Assignment: organization-defined security safeguards] are under configuration management.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Regardless of the cryptographic means employed (e.g., public key, private key, shared secrets), organizations ensure that there are processes and procedures in place to effectively manage those means. For example, if devices use certificates as a basis for identification and authentication, there needs to be a process in place to address the expiration of those certificates. ",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [
      "sc-13"
    ],
    "Parameters": [
      {
        "Level": "High",
        "Param": "CM-3 (6) All security safeguards that rely on cryptography"
      }
    ]
  },
  {
    "ControlID": "CM-4",
    "ControlFamily": "CONFIGURATION MANAGEMENT",
    "ID": "CM-4 (1)",
    "ControlTitle": "SECURITY IMPACT ANALYSIS",
    "EnhancementText": "The organization analyzes changes to the information system in a separate test environment before implementation in an operational environment, looking for security impacts due to flaws, weaknesses, incompatibility, or intentional malice.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Separate test environment in this context means an environment that is physically or logically isolated and distinct from the operational environment. The separation is sufficient to ensure that activities in the test environment do not impact activities in the operational environment, and information in the operational environment is not inadvertently transmitted to the test environment. Separate environments can be achieved by physical or logical means. If physically separate test environments are not used, organizations determine the strength of mechanism required when implementing logical separation (e.g., separation achieved through virtual machines). ",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [
      "sa-11",
      "sc-3",
      "sc-7"
    ],
    "Parameters": []
  },
  {
    "ControlID": "CM-5",
    "ControlFamily": "CONFIGURATION MANAGEMENT",
    "ID": "CM-5 (1)",
    "ControlTitle": "ACCESS RESTRICTIONS FOR CHANGE",
    "EnhancementText": "The information system enforces access restrictions and supports auditing of the enforcement actions.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "au-2",
      "au-12",
      "au-6",
      "cm-3",
      "cm-6"
    ],
    "Parameters": []
  },
  {
    "ControlID": "CM-5",
    "ControlFamily": "CONFIGURATION MANAGEMENT",
    "ID": "CM-5 (2)",
    "ControlTitle": "ACCESS RESTRICTIONS FOR CHANGE",
    "EnhancementText": "The organization reviews information system changes [Assignment: organization-defined frequency] and [Assignment: organization-defined circumstances] to determine whether unauthorized changes have occurred.\n\n",
    "IaseGuidance": "Every 90 days or more frequently as the organization defines for high systems AND at least annually or more frequently as the organization defines for low and moderate systems;\n\r\nWhen there is an incident or when planned changes have been performed\n\r\nSource: \r\nDoD RMF TAG",
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Indications that warrant review of information system changes and the specific circumstances justifying such reviews may be obtained from activities carried out by organizations during the configuration change process. ",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [
      "au-6",
      "au-7",
      "cm-3",
      "cm-5",
      "pe-6",
      "pe-8"
    ],
    "Parameters": [
      {
        "Level": "High",
        "Param": "CM-5 (2) [at least every thirty (30) days]"
      }
    ]
  },
  {
    "ControlID": "CM-5",
    "ControlFamily": "CONFIGURATION MANAGEMENT",
    "ID": "CM-5 (3)",
    "ControlTitle": "ACCESS RESTRICTIONS FOR CHANGE",
    "EnhancementText": "The information system prevents the installation of [Assignment: organization-defined software and firmware components] without verification that the component has been digitally signed using a certificate that is recognized and approved by the organization.\n\n",
    "IaseGuidance": "Any software or firmware components when the vendor provides digitally signed products\n\r\nSource: \r\nDoD RMF TAG",
    "FedrampGuidance": "CM-5 (3) Guidance: If digital signatures/certificates are unavailable, alternative cryptographic integrity checks (hashes, self-signed certs, etc.) can be utilized.",
    "SupplementalGuidance": "  Software and firmware components prevented from installation unless signed with recognized and approved certificates include, for example, software and firmware version updates, patches, service packs, device drivers, and basic input output system (BIOS) updates. Organizations can identify applicable software and firmware components by type, by specific items, or a combination of both. Digital signatures and organizational verification of such signatures, is a method of code authentication. ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "cm-7",
      "sc-13",
      "si-7"
    ],
    "Parameters": []
  },
  {
    "ControlID": "CM-5",
    "ControlFamily": "CONFIGURATION MANAGEMENT",
    "ID": "CM-5 (5)",
    "ControlTitle": "ACCESS RESTRICTIONS FOR CHANGE",
    "EnhancementText": "The organization:\n (a)   Limits privileges to change information system components and system-related information within a production or operational environment; and\n (b)   Reviews and reevaluates privileges [Assignment: organization-defined frequency].\n\n",
    "IaseGuidance": "b. every 90 days\n\r\nSource: \r\nDoD RMF TAG",
    "FedrampGuidance": "",
    "SupplementalGuidance": "  In many organizations, information systems support multiple core missions/business functions. Limiting privileges to change information system components with respect to operational systems is necessary because changes to a particular information system component may have far-reaching effects on mission/business processes supported by the system where the component resides. The complex, many-to-many relationships between systems and mission/business processes are in some cases, unknown to developers. ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "ac-2"
    ],
    "Parameters": [
      {
        "Level": "High",
        "Param": "CM-5 (5) (b) [at least quarterly] "
      },
      {
        "Level": "Moderate",
        "Param": "CM-5 (5) (b) [at least quarterly] "
      }
    ]
  },
  {
    "ControlID": "CM-6",
    "ControlFamily": "CONFIGURATION MANAGEMENT",
    "ID": "CM-6 (1)",
    "ControlTitle": "CONFIGURATION SETTINGS",
    "EnhancementText": "The organization employs automated mechanisms to centrally manage, apply, and verify configuration settings for [Assignment: organization-defined information system components].\n\n",
    "IaseGuidance": "Not appropriate for DoD to define for all CSP's infrastructure or service offerings\n\r\nSource: \r\nDoD RMF TAG",
    "FedrampGuidance": "",
    "SupplementalGuidance": "  ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "ca-7",
      "cm-4"
    ],
    "Parameters": []
  },
  {
    "ControlID": "CM-6",
    "ControlFamily": "CONFIGURATION MANAGEMENT",
    "ID": "CM-6 (2)",
    "ControlTitle": "CONFIGURATION SETTINGS",
    "EnhancementText": "The organization employs [Assignment: organization-defined security safeguards] to respond to unauthorized changes to [Assignment: organization-defined configuration settings].\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Responses to unauthorized changes to configuration settings can include, for example, alerting designated organizational personnel, restoring established configuration settings, or in extreme cases, halting affected information system processing. ",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [
      "ir-4",
      "si-7"
    ],
    "Parameters": []
  },
  {
    "ControlID": "CM-7",
    "ControlFamily": "CONFIGURATION MANAGEMENT",
    "ID": "CM-7 (1)",
    "ControlTitle": "LEAST FUNCTIONALITY",
    "EnhancementText": "The organization:\n (a)   Reviews the information system [Assignment: organization-defined frequency] to identify unnecessary and/or nonsecure functions, ports, protocols, and services; and\n (b)   Disables [Assignment: organization-defined functions, ports, protocols, and services within the information system deemed to be unnecessary and/or nonsecure].\n\n",
    "IaseGuidance": "a. every 30 days;\r\nb. Not appropriate to define unnecessary functions, ports, protocols and service at the Enterprise level. Nonsecure functions, ports, protocols and services are defined in DoDI 8551.01.\n\r\nSource: \r\nDoD RMF TAG",
    "FedrampGuidance": "",
    "SupplementalGuidance": "  The organization can either make a determination of the relative security of the function, port, protocol, and/or service or base the security decision on the assessment of other entities. Bluetooth, FTP, and peer-to-peer networking are examples of less than secure protocols. ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "ac-18",
      "cm-7",
      "ia-2"
    ],
    "Parameters": [
      {
        "Level": "High",
        "Param": "CM-7 (1) (a) [at least monthly] "
      },
      {
        "Level": "Moderate",
        "Param": "CM-7 (1) (a) [at least monthly] "
      }
    ]
  },
  {
    "ControlID": "CM-7",
    "ControlFamily": "CONFIGURATION MANAGEMENT",
    "ID": "CM-7 (2)",
    "ControlTitle": "LEAST FUNCTIONALITY",
    "EnhancementText": "The information system prevents program execution in accordance with [Selection (one or more): [Assignment: organization-defined policies regarding software program usage and restrictions]; rules authorizing the terms and conditions of software program usage].\n\n",
    "IaseGuidance": "Not appropriate for DoD to define for all CSP's infrastructure or service offerings\n\r\nSource: \r\nDoD RMF TAG",
    "FedrampGuidance": "CM-7 (2) Guidance: This control shall be implemented in a technical manner on the information system to only allow programs to run that adhere to the policy (i.e. white listing). This control is not to be based off of strictly written policy on what is allowed or not allowed to run.",
    "SupplementalGuidance": "  ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "cm-8",
      "pm-5"
    ],
    "Parameters": []
  },
  {
    "ControlID": "CM-7",
    "ControlFamily": "CONFIGURATION MANAGEMENT",
    "ID": "CM-7 (5)",
    "ControlTitle": "LEAST FUNCTIONALITY",
    "EnhancementText": "The organization:\n (a)   Identifies [Assignment: organization-defined software programs authorized to execute on the information system];\n (b)   Employs a deny-all, permit-by-exception policy to allow the execution of authorized software programs on the information system; and\n (c)   Reviews and updates the list of authorized software programs [Assignment: organization- defined frequency].\n\n",
    "IaseGuidance": "a. Not appropriate for DoD to define for all CSP's infrastructure or service offerings; \r\nc. Monthly\n\r\nSource: \r\nDoD RMF TAG",
    "FedrampGuidance": "",
    "SupplementalGuidance": "  The process used to identify software programs that are authorized to execute on organizational information systems is commonly referred to as whitelisting. In addition to whitelisting, organizations consider verifying the integrity of white-listed software programs using, for example, cryptographic checksums, digital signatures, or hash functions. Verification of white-listed software can occur either prior to execution or at system startup. ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "cm-2",
      "cm-6",
      "cm-8",
      "pm-5",
      "sa-10",
      "sc-34",
      "si-7"
    ],
    "Parameters": [
      {
        "Level": "High",
        "Param": "CM-7(5) (c) [at least quarterly or when there is a change]"
      },
      {
        "Level": "Moderate",
        "Param": "CM-7(5) (c) [ at least Annually or when there is a change]"
      }
    ]
  },
  {
    "ControlID": "CM-8",
    "ControlFamily": "CONFIGURATION MANAGEMENT",
    "ID": "CM-8 (1)",
    "ControlTitle": "INFORMATION SYSTEM COMPONENT INVENTORY",
    "EnhancementText": "The organization updates the inventory of information system components as an integral part of component installations, removals, and information system updates.\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "CM-8",
    "ControlFamily": "CONFIGURATION MANAGEMENT",
    "ID": "CM-8 (2)",
    "ControlTitle": "INFORMATION SYSTEM COMPONENT INVENTORY",
    "EnhancementText": "The organization employs automated mechanisms to help maintain an up-to-date, complete, accurate, and readily available inventory of information system components.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Organizations maintain information system inventories to the extent feasible. Virtual machines, for example, can be difficult to monitor because such machines are not visible to the network when not in use. In such cases, organizations maintain as up-to-date, complete, and accurate an inventory as is deemed reasonable. This control enhancement can be satisfied by the implementation of CM-2 (2) for organizations that choose to combine information system component inventory and baseline configuration activities. ",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [
      "si-7"
    ],
    "Parameters": []
  },
  {
    "ControlID": "CM-8",
    "ControlFamily": "CONFIGURATION MANAGEMENT",
    "ID": "CM-8 (3)",
    "ControlTitle": "INFORMATION SYSTEM COMPONENT INVENTORY",
    "EnhancementText": "The organization:\n (a)   Employs automated mechanisms [Assignment: organization-defined frequency] to detect the presence of unauthorized hardware, software, and firmware components within the information system; and\n (b)   Takes the following actions when unauthorized components are detected: [Selection (one or more): disables network access by such components; isolates the components; notifies [Assignment: organization-defined personnel or roles]].\n\n",
    "IaseGuidance": "a. continuously;\r\nb. the ISSO and ISSM and others as the local organization deems appropriate\n\r\nSource: \r\nDoD RMF TAG",
    "FedrampGuidance": "",
    "SupplementalGuidance": "  This control enhancement is applied in addition to the monitoring for unauthorized remote connections and mobile devices. Monitoring for unauthorized system components may be accomplished on an ongoing basis or by the periodic scanning of systems for that purpose. Automated mechanisms can be implemented within information systems or in other separate devices. Isolation can be achieved, for example, by placing unauthorized information system components in separate domains or subnets or otherwise quarantining such components. This type of component isolation is commonly referred to as sandboxing. ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "ac-17",
      "ac-18",
      "ac-19",
      "ca-7",
      "si-3",
      "si-4",
      "si-7",
      "ra-5"
    ],
    "Parameters": [
      {
        "Level": "High",
        "Param": "CM-8 (3) (a) [Continuously, using automated mechanisms with a maximum five-minute delay in detection.] "
      },
      {
        "Level": "Moderate",
        "Param": "CM-8 (3) (a) [Continuously, using automated mechanisms with a maximum five-minute delay in detection] "
      }
    ]
  },
  {
    "ControlID": "CM-8",
    "ControlFamily": "CONFIGURATION MANAGEMENT",
    "ID": "CM-8 (4)",
    "ControlTitle": "INFORMATION SYSTEM COMPONENT INVENTORY",
    "EnhancementText": "The organization includes in the information system component inventory information, a means for identifying by [Selection (one or more): name; position; role], individuals responsible/accountable for administering those components.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Identifying individuals who are both responsible and accountable for administering information system components helps to ensure that the assigned components are properly administered and organizations can contact those individuals if some action is required (e.g., component is determined to be the source of a breach/compromise, component needs to be recalled/replaced, or component needs to be relocated).\n",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [],
    "Parameters": [
      {
        "Level": "High",
        "Param": "CM-8 (4) [position and role]"
      }
    ]
  },
  {
    "ControlID": "CM-8",
    "ControlFamily": "CONFIGURATION MANAGEMENT",
    "ID": "CM-8 (5)",
    "ControlTitle": "INFORMATION SYSTEM COMPONENT INVENTORY",
    "EnhancementText": "The organization verifies that all components within the authorization boundary of the information system are not duplicated in other information system inventories.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  This control enhancement addresses the potential problem of duplicate accounting of information system components in large or complex interconnected systems.\n",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "CM-10",
    "ControlFamily": "CONFIGURATION MANAGEMENT",
    "ID": "CM-10 (1)",
    "ControlTitle": "SOFTWARE USAGE RESTRICTIONS",
    "EnhancementText": "The organization establishes the following restrictions on the use of open source software: [Assignment: organization-defined restrictions].\n\n",
    "IaseGuidance": "IAW DoD Memorandum \"Clarifying Guidance Regarding Open Source Software (OSS)\" 16 Oct 2009 (http://dodcio.defense.gov/Home/Issuances/ DoDCIOMemorandums.aspx).\n\r\nSource: \r\nDoD RMF TAG",
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Open source software refers to software that is available in source code form. Certain software rights normally reserved for copyright holders are routinely provided under software license agreements that permit individuals to study, change, and improve the software. From a security perspective, the major advantage of open source software is that it provides organizations with the ability to examine the source code. However, there are also various licensing issues associated with open source software including, for example, the constraints on derivative use of such software.\n",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "CM-11",
    "ControlFamily": "CONFIGURATION MANAGEMENT",
    "ID": "CM-11 (1)",
    "ControlTitle": "USER-INSTALLED SOFTWARE",
    "EnhancementText": "The information system alerts [Assignment: organization-defined personnel or roles] when the unauthorized installation of software is detected.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  ",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [
      "ca-7",
      "si-4"
    ],
    "Parameters": []
  },
  {
    "ControlID": "CP-2",
    "ControlFamily": "CONTINGENCY PLANNING",
    "ID": "CP-2 (1)",
    "ControlTitle": "CONTINGENCY PLAN",
    "EnhancementText": "The organization coordinates contingency plan development with organizational elements responsible for related plans.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Plans related to contingency plans for organizational information systems include, for example, Business Continuity Plans, Disaster Recovery Plans, Continuity of Operations Plans, Crisis Communications Plans, Critical Infrastructure Plans, Cyber Incident Response Plans, Insider Threat Implementation Plan, and Occupant Emergency Plans.\n",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "CP-2",
    "ControlFamily": "CONTINGENCY PLANNING",
    "ID": "CP-2 (2)",
    "ControlTitle": "CONTINGENCY PLAN",
    "EnhancementText": "The organization conducts capacity planning so that necessary capacity for information processing, telecommunications, and environmental support exists during contingency operations.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Capacity planning is needed because different types of threats (e.g., natural disasters, targeted cyber attacks) can result in a reduction of the available processing, telecommunications, and support services originally intended to support the organizational missions/business functions. Organizations may need to anticipate degraded operations during contingency operations and factor such degradation into capacity planning.\n",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "CP-2",
    "ControlFamily": "CONTINGENCY PLANNING",
    "ID": "CP-2 (3)",
    "ControlTitle": "CONTINGENCY PLAN",
    "EnhancementText": "The organization plans for the resumption of essential missions and business functions within\n[Assignment: organization-defined time period] of contingency plan activation.\n\n",
    "IaseGuidance": "1 hour (Availability High ) \r\n12 hours (Availability Moderate) \r\nas defined in the contingency plan\n\r\nSource: \r\nDoD RMF TAG",
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Organizations may choose to carry out the contingency planning activities in this control enhancement as part of organizational business continuity planning including, for example, as part of business impact analyses. The time period for resumption of essential missions/business functions may be dependent on the severity/extent of disruptions\nto the information system and its supporting infrastructure. ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "pe-12"
    ],
    "Parameters": []
  },
  {
    "ControlID": "CP-2",
    "ControlFamily": "CONTINGENCY PLANNING",
    "ID": "CP-2 (4)",
    "ControlTitle": "CONTINGENCY PLAN",
    "EnhancementText": "The organization plans for the resumption of all missions and business functions within\n[Assignment: organization-defined time period] of contingency plan activation.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Organizations may choose to carry out the contingency planning activities in this control enhancement as part of organizational business continuity planning including, for example, as part of business impact analyses. The time period for resumption of all missions/business functions may be dependent on the severity/extent of disruptions to the information system and its supporting infrastructure. ",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [
      "pe-12"
    ],
    "Parameters": [
      {
        "Level": "High",
        "Param": "CP-2 (4) [time period defined in service provider and organization  SLA]"
      }
    ]
  },
  {
    "ControlID": "CP-2",
    "ControlFamily": "CONTINGENCY PLANNING",
    "ID": "CP-2 (5)",
    "ControlTitle": "CONTINGENCY PLAN",
    "EnhancementText": "The organization plans for the continuance of essential missions and business functions with little or no loss of operational continuity and sustains that continuity until full information system restoration at primary processing and/or storage sites.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Organizations may choose to carry out the contingency planning activities in this control enhancement as part of organizational business continuity planning including, for example, as part of business impact analyses. Primary processing and/or storage sites defined by organizations as part of contingency planning may change depending on the circumstances associated with the contingency (e.g., backup sites may become primary sites). ",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [
      "pe-12"
    ],
    "Parameters": []
  },
  {
    "ControlID": "CP-2",
    "ControlFamily": "CONTINGENCY PLANNING",
    "ID": "CP-2 (8)",
    "ControlTitle": "CONTINGENCY PLAN",
    "EnhancementText": "The organization identifies critical information system assets supporting essential missions and business functions.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Organizations may choose to carry out the contingency planning activities in this control enhancement as part of organizational business continuity planning including, for example, as part of business impact analyses. Organizations identify critical information system assets so that additional safeguards and countermeasures can be employed (above and beyond those safeguards and countermeasures routinely implemented) to help ensure that organizational missions/business functions can continue to be conducted during contingency operations. In addition, the identification of critical information assets facilitates the prioritization of organizational resources. Critical information system assets include technical and operational aspects. Technical aspects include, for example, information technology services, information system components, information technology products, and mechanisms. Operational aspects include, for example, procedures (manually executed operations) and personnel (individuals operating technical safeguards and/or executing manual procedures). Organizational program protection plans can provide assistance in identifying critical assets. ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "sa-14",
      "sa-15"
    ],
    "Parameters": []
  },
  {
    "ControlID": "CP-3",
    "ControlFamily": "CONTINGENCY PLANNING",
    "ID": "CP-3 (1)",
    "ControlTitle": "CONTINGENCY TRAINING",
    "EnhancementText": "The organization incorporates simulated events into contingency training to facilitate effective response by personnel in crisis situations.\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "CP-4",
    "ControlFamily": "CONTINGENCY PLANNING",
    "ID": "CP-4 (1)",
    "ControlTitle": "CONTINGENCY PLAN TESTING",
    "EnhancementText": "The organization coordinates contingency plan testing with organizational elements responsible for related plans.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Plans related to contingency plans for organizational information systems include, for example, Business Continuity Plans, Disaster Recovery Plans, Continuity of Operations Plans, Crisis Communications Plans, Critical Infrastructure Plans, Cyber Incident Response Plans, and Occupant Emergency Plans. This control enhancement does not require organizations to create organizational elements to handle related plans or to align such elements with specific plans. It does require, however, that if such organizational elements are responsible for related plans, organizations should coordinate with those elements. ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "ir-8",
      "pm-8"
    ],
    "Parameters": []
  },
  {
    "ControlID": "CP-4",
    "ControlFamily": "CONTINGENCY PLANNING",
    "ID": "CP-4 (2)",
    "ControlTitle": "CONTINGENCY PLAN TESTING",
    "EnhancementText": "The organization tests the contingency plan at the alternate processing site:\n (a)   To familiarize contingency personnel with the facility and available resources; and\n (b)   To evaluate the capabilities of the alternate processing site to support contingency operations.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  ",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [
      "cp-7"
    ],
    "Parameters": []
  },
  {
    "ControlID": "CP-6",
    "ControlFamily": "CONTINGENCY PLANNING",
    "ID": "CP-6 (1)",
    "ControlTitle": "ALTERNATE STORAGE SITE",
    "EnhancementText": "The organization identifies an alternate storage site that is separated from the primary storage site to reduce susceptibility to the same threats.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Threats that affect alternate storage sites are typically defined in organizational assessments of risk and include, for example, natural disasters, structural failures, hostile cyber attacks, and errors of omission/commission. Organizations determine what is considered a sufficient degree of separation between primary and alternate storage sites based on the types of threats that are of concern. For one particular type of threat (i.e., hostile cyber attack), the degree of separation between sites is less relevant. ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "ra-3"
    ],
    "Parameters": []
  },
  {
    "ControlID": "CP-6",
    "ControlFamily": "CONTINGENCY PLANNING",
    "ID": "CP-6 (2)",
    "ControlTitle": "ALTERNATE STORAGE SITE",
    "EnhancementText": "The organization configures the alternate storage site to facilitate recovery operations in accordance with recovery time and recovery point objectives.\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "CP-6",
    "ControlFamily": "CONTINGENCY PLANNING",
    "ID": "CP-6 (3)",
    "ControlTitle": "ALTERNATE STORAGE SITE",
    "EnhancementText": "The organization identifies potential accessibility problems to the alternate storage site in the event of an area-wide disruption or disaster and outlines explicit mitigation actions.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Area-wide disruptions refer to those types of disruptions that are broad in geographic scope (e.g., hurricane, regional power outage) with such determinations made by organizations based on organizational assessments of risk. Explicit mitigation actions include, for example: (i) duplicating backup information at other alternate storage sites if access problems occur at originally designated alternate sites; or (ii) planning for physical access to retrieve backup information if electronic accessibility to the alternate site is disrupted. ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "ra-3"
    ],
    "Parameters": []
  },
  {
    "ControlID": "CP-7",
    "ControlFamily": "CONTINGENCY PLANNING",
    "ID": "CP-7 (1)",
    "ControlTitle": "ALTERNATE PROCESSING SITE",
    "EnhancementText": "The organization identifies an alternate processing site that is separated from the primary processing site to reduce susceptibility to the same threats.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "CP-7 (1) Guidance: The service provider may determine what is considered a sufficient degree of separation between the primary and alternate processing sites, based on the types of threats that are of concern. For one particular type of threat (i.e., hostile cyber attack), the degree of separation between sites will be less relevant.",
    "SupplementalGuidance": "  Threats that affect alternate processing sites are typically defined in organizational assessments of risk and include, for example, natural disasters, structural failures, hostile cyber attacks, and errors of omission/commission. Organizations determine what is considered a sufficient degree of separation between primary and alternate processing sites based on the types of threats that are of concern. For one particular type of threat (i.e., hostile cyber attack), the degree of separation between sites is less relevant. ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "ra-3"
    ],
    "Parameters": []
  },
  {
    "ControlID": "CP-7",
    "ControlFamily": "CONTINGENCY PLANNING",
    "ID": "CP-7 (2)",
    "ControlTitle": "ALTERNATE PROCESSING SITE",
    "EnhancementText": "The organization identifies potential accessibility problems to the alternate processing site in the event of an area-wide disruption or disaster and outlines explicit mitigation actions.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Area-wide disruptions refer to those types of disruptions that are broad in geographic scope (e.g., hurricane, regional power outage) with such determinations made by organizations based on organizational assessments of risk. ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "ra-3"
    ],
    "Parameters": []
  },
  {
    "ControlID": "CP-7",
    "ControlFamily": "CONTINGENCY PLANNING",
    "ID": "CP-7 (3)",
    "ControlTitle": "ALTERNATE PROCESSING SITE",
    "EnhancementText": "The organization develops alternate processing site agreements that contain priority-of-service provisions in accordance with organizational availability requirements (including recovery time objectives).\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Priority-of-service agreements refer to negotiated agreements with service providers that ensure that organizations receive priority treatment consistent with their availability requirements and the availability of information resources at the alternate processing site.\n",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "CP-7",
    "ControlFamily": "CONTINGENCY PLANNING",
    "ID": "CP-7 (4)",
    "ControlTitle": "ALTERNATE PROCESSING SITE",
    "EnhancementText": "The organization prepares the alternate processing site so that the site is ready to be used as the operational site supporting essential missions and business functions.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Site preparation includes, for example, establishing configuration settings for information system components at the alternate processing site consistent with the requirements for such settings at the primary site and ensuring that essential supplies and other logistical considerations are in place. ",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [
      "cm-2",
      "cm-6"
    ],
    "Parameters": []
  },
  {
    "ControlID": "CP-8",
    "ControlFamily": "CONTINGENCY PLANNING",
    "ID": "CP-8 (1)",
    "ControlTitle": "TELECOMMUNICATIONS SERVICES",
    "EnhancementText": "The organization:\n (a)   Develops primary and alternate telecommunications service agreements that contain priority- of-service provisions in accordance with organizational availability requirements (including recovery time objectives); and\n (b)   Requests Telecommunications Service Priority for all telecommunications services used for national security emergency preparedness in the event that the primary and/or alternate telecommunications services are provided by a common carrier.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Organizations consider the potential mission/business impact in situations where telecommunications service providers are servicing other organizations with similar priority-of-service provisions.\n",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "CP-8",
    "ControlFamily": "CONTINGENCY PLANNING",
    "ID": "CP-8 (2)",
    "ControlTitle": "TELECOMMUNICATIONS SERVICES",
    "EnhancementText": "The organization obtains alternate telecommunications services to reduce the likelihood of sharing a single point of failure with primary telecommunications services.\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "CP-8",
    "ControlFamily": "CONTINGENCY PLANNING",
    "ID": "CP-8 (3)",
    "ControlTitle": "TELECOMMUNICATIONS SERVICES",
    "EnhancementText": "The organization obtains alternate telecommunications services from providers that are separated from primary service providers to reduce susceptibility to the same threats.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Threats that affect telecommunications services are typically defined in organizational assessments of risk and include, for example, natural disasters, structural failures, hostile cyber/physical attacks, and errors of omission/commission. Organizations seek to reduce common susceptibilities by, for example, minimizing shared infrastructure among telecommunications service providers and achieving sufficient geographic separation between services. Organizations may consider using a single service provider in situations where the service provider can provide alternate telecommunications services meeting the separation needs addressed in the risk assessment.\n",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "CP-8",
    "ControlFamily": "CONTINGENCY PLANNING",
    "ID": "CP-8 (4)",
    "ControlTitle": "TELECOMMUNICATIONS SERVICES",
    "EnhancementText": "The organization:\n (a)   Requires primary and alternate telecommunications service providers to have contingency plans;\n (b)   Reviews provider contingency plans to ensure that the plans meet organizational contingency requirements; and\n (c)   Obtains evidence of contingency testing/training by providers [Assignment: organization- defined frequency].\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Reviews of provider contingency plans consider the proprietary nature of such plans. In some situations, a summary of provider contingency plans may be sufficient evidence for organizations to satisfy the review requirement. Telecommunications service providers may also participate in ongoing disaster recovery exercises in coordination with the Department of Homeland Security, state, and local governments. Organizations may use these types of activities to satisfy evidentiary requirements related to service provider contingency plan reviews, testing, and training.\n",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [],
    "Parameters": [
      {
        "Level": "High",
        "Param": "CP-8 (4) (c) [annually]"
      }
    ]
  },
  {
    "ControlID": "CP-9",
    "ControlFamily": "CONTINGENCY PLANNING",
    "ID": "CP-9 (1)",
    "ControlTitle": "INFORMATION SYSTEM BACKUP",
    "EnhancementText": "The organization tests backup information [Assignment: organization-defined frequency] to verify media reliability and information integrity.\n \n",
    "IaseGuidance": "at least monthly in accordance with contingency plan\n\r\nSource: \r\nDoD RMF TAG",
    "FedrampGuidance": "",
    "SupplementalGuidance": "  ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "cp-4"
    ],
    "Parameters": [
      {
        "Level": "High",
        "Param": "CP-9 (1). [at least monthly]"
      },
      {
        "Level": "Moderate",
        "Param": "CP-9 (1) [at least annually]"
      }
    ]
  },
  {
    "ControlID": "CP-9",
    "ControlFamily": "CONTINGENCY PLANNING",
    "ID": "CP-9 (2)",
    "ControlTitle": "INFORMATION SYSTEM BACKUP",
    "EnhancementText": "The organization uses a sample of backup information in the restoration of selected information system functions as part of contingency plan testing.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  ",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [
      "cp-4"
    ],
    "Parameters": []
  },
  {
    "ControlID": "CP-9",
    "ControlFamily": "CONTINGENCY PLANNING",
    "ID": "CP-9 (3)",
    "ControlTitle": "INFORMATION SYSTEM BACKUP",
    "EnhancementText": "The organization stores backup copies of [Assignment: organization-defined critical information system software and other security-related information] in a separate facility or in a fire-rated container that is not collocated with the operational system.\n\n",
    "IaseGuidance": "Not appropriate for DoD to define for all CSP's infrastructure or service offerings\n\r\nSource: \r\nDoD RMF TAG",
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Critical information system software includes, for example, operating systems, cryptographic key management systems, and intrusion detection/prevention systems. Security-related information includes, for example, organizational inventories of hardware, software, and firmware components. Alternate storage sites typically serve as separate storage facilities for organizations. ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "cm-2",
      "cm-8"
    ],
    "Parameters": []
  },
  {
    "ControlID": "CP-9",
    "ControlFamily": "CONTINGENCY PLANNING",
    "ID": "CP-9 (5)",
    "ControlTitle": "INFORMATION SYSTEM BACKUP",
    "EnhancementText": "The organization transfers information system backup information to the alternate storage site [Assignment: organization-defined time period and transfer rate consistent with the recovery time and recovery point objectives].\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Information system backup information can be transferred to alternate storage sites either electronically or by physical shipment of storage media.\n",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [],
    "Parameters": [
      {
        "Level": "High",
        "Param": "CP-9 (5) [time period and transfer rate consistent with the recovery time and recovery point objectives defined in the service provider and organization  SLA]."
      }
    ]
  },
  {
    "ControlID": "CP-10",
    "ControlFamily": "CONTINGENCY PLANNING",
    "ID": "CP-10 (2)",
    "ControlTitle": "INFORMATION SYSTEM RECOVERY AND\nRECONSTITUTION",
    "EnhancementText": "The information system implements transaction recovery for systems that are transaction-based.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Transaction-based information systems include, for example, database management systems and transaction processing systems. Mechanisms supporting transaction recovery include, for example, transaction rollback and transaction journaling.\n",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "CP-10",
    "ControlFamily": "CONTINGENCY PLANNING",
    "ID": "CP-10 (4)",
    "ControlTitle": "INFORMATION SYSTEM RECOVERY AND\nRECONSTITUTION",
    "EnhancementText": "The organization provides the capability to restore information system components within [Assignment: organization-defined restoration time-periods] from configuration-controlled and integrity-protected information representing a known, operational state for the components.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Restoration of information system components includes, for example, reimaging which restores components to known, operational states. ",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [
      "cm-2"
    ],
    "Parameters": [
      {
        "Level": "High",
        "Param": "CP-10 (4) [time period consistent with the restoration time-periods defined in the service provider and organization  SLA]"
      }
    ]
  },
  {
    "ControlID": "IA-2",
    "ControlFamily": "IDENTIFICATION AND AUTHENTICATION",
    "ID": "IA-2 (1)",
    "ControlTitle": "IDENTIFICATION AND AUTHENTICATION\n(ORGANIZATIONAL USERS)",
    "EnhancementText": "The information system implements multifactor authentication for network access to privileged accounts.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  ",
    "Impacts": [
      "High",
      "Moderate",
      "Low"
    ],
    "RelatedControls": [
      "ac-6"
    ],
    "Parameters": []
  },
  {
    "ControlID": "IA-2",
    "ControlFamily": "IDENTIFICATION AND AUTHENTICATION",
    "ID": "IA-2 (2)",
    "ControlTitle": "IDENTIFICATION AND AUTHENTICATION\n(ORGANIZATIONAL USERS)",
    "EnhancementText": "The information system implements multifactor authentication for network access to non- privileged accounts.\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "IA-2",
    "ControlFamily": "IDENTIFICATION AND AUTHENTICATION",
    "ID": "IA-2 (3)",
    "ControlTitle": "IDENTIFICATION AND AUTHENTICATION\n(ORGANIZATIONAL USERS)",
    "EnhancementText": "The information system implements multifactor authentication for local access to privileged accounts.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "ac-6"
    ],
    "Parameters": []
  },
  {
    "ControlID": "IA-2",
    "ControlFamily": "IDENTIFICATION AND AUTHENTICATION",
    "ID": "IA-2 (4)",
    "ControlTitle": "IDENTIFICATION AND AUTHENTICATION\n(ORGANIZATIONAL USERS)",
    "EnhancementText": "The information system implements multifactor authentication for local access to non-privileged accounts.\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "IA-2",
    "ControlFamily": "IDENTIFICATION AND AUTHENTICATION",
    "ID": "IA-2 (5)",
    "ControlTitle": "IDENTIFICATION AND AUTHENTICATION\n(ORGANIZATIONAL USERS)",
    "EnhancementText": "The organization requires individuals to be authenticated with an individual authenticator when a group authenticator is employed.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Requiring individuals to use individual authenticators as a second level of authentication helps organizations to mitigate the risk of using group authenticators.\n",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "IA-2",
    "ControlFamily": "IDENTIFICATION AND AUTHENTICATION",
    "ID": "IA-2 (8)",
    "ControlTitle": "IDENTIFICATION AND AUTHENTICATION\n(ORGANIZATIONAL USERS)",
    "EnhancementText": "The information system implements replay-resistant authentication mechanisms for network access to privileged accounts.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Authentication processes resist replay attacks if it is impractical to achieve successful authentications by replaying previous authentication messages. Replay- resistant techniques include, for example, protocols that use nonces or challenges such as Transport Layer Security (TLS) and time synchronous or challenge-response one-time authenticators.\n",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "IA-2",
    "ControlFamily": "IDENTIFICATION AND AUTHENTICATION",
    "ID": "IA-2 (9)",
    "ControlTitle": "IDENTIFICATION AND AUTHENTICATION\n(ORGANIZATIONAL USERS)",
    "EnhancementText": "The information system implements replay-resistant authentication mechanisms for network access to non-privileged accounts.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Authentication processes resist replay attacks if it is impractical to achieve successful authentications by recording/replaying previous authentication messages. Replay-resistant techniques include, for example, protocols that use nonces or challenges such as Transport Layer Security (TLS) and time synchronous or challenge-response one-time authenticators.\n",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "IA-2",
    "ControlFamily": "IDENTIFICATION AND AUTHENTICATION",
    "ID": "IA-2 (11)",
    "ControlTitle": "IDENTIFICATION AND AUTHENTICATION\n(ORGANIZATIONAL USERS)",
    "EnhancementText": "The information system implements multifactor authentication for remote access to privileged and non-privileged accounts such that one of the factors is provided by a device separate from the system gaining access and the device meets [Assignment: organization-defined strength of mechanism requirements].\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "IA-2 (11) Guidance: PIV=separate device. Please refer to NIST SP 800-157 Guidelines for Derived Personal Identity Verification (PIV) Credentials.",
    "SupplementalGuidance": "  For remote access to privileged/non-privileged accounts, the purpose of requiring a device that is separate from the information system gaining access for one of the factors during multifactor authentication is to reduce the likelihood of compromising authentication credentials stored on the system. For example, adversaries deploying malicious code on organizational information systems can potentially compromise such credentials resident on the system and subsequently impersonate authorized users. ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "ac-6"
    ],
    "Parameters": [
      {
        "Level": "High",
        "Param": "IA-2 (11) [FIPS 140-2, NIAP Certification, or NSA approval]"
      },
      {
        "Level": "Moderate",
        "Param": "IA-2 (11) [FIPS 140-2, NIAP Certification, or NSA approval]"
      }
    ]
  },
  {
    "ControlID": "IA-2",
    "ControlFamily": "IDENTIFICATION AND AUTHENTICATION",
    "ID": "IA-2 (12)",
    "ControlTitle": "IDENTIFICATION AND AUTHENTICATION\n(ORGANIZATIONAL USERS)",
    "EnhancementText": "The information system accepts and electronically verifies Personal Identity Verification (PIV)\ncredentials.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "IA-2 (12) Guidance: Include Common Access Card (CAC), i.e., the DoD technical implementation of PIV/FIPS 201/HSPD-12.",
    "SupplementalGuidance": "  This control enhancement applies to organizations implementing logical access control systems (LACS) and physical access control systems (PACS). Personal Identity Verification (PIV) credentials are those credentials issued by federal agencies that conform to FIPS Publication 201 and supporting guidance documents. OMB Memorandum 11-11 requires federal agencies to continue implementing the requirements specified in HSPD-12 to enable agency-wide use of PIV credentials. ",
    "Impacts": [
      "High",
      "Moderate",
      "Low"
    ],
    "RelatedControls": [
      "au-2",
      "pe-3",
      "sa-4"
    ],
    "Parameters": []
  },
  {
    "ControlID": "IA-4",
    "ControlFamily": "IDENTIFICATION AND AUTHENTICATION",
    "ID": "IA-4 (4)",
    "ControlTitle": "IDENTIFIER MANAGEMENT",
    "EnhancementText": "The organization manages individual identifiers by uniquely identifying each individual as\n[Assignment: organization-defined characteristic identifying individual status].\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Characteristics identifying the status of individuals include, for example, contractors and foreign nationals. Identifying the status of individuals by specific characteristics provides additional information about the people with whom organizational personnel are communicating. For example, it might be useful for a government employee to know that one of the individuals on an email message is a contractor. ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "at-2"
    ],
    "Parameters": [
      {
        "Level": "High",
        "Param": "IA-4 (4) [contractors; foreign nationals] "
      },
      {
        "Level": "Moderate",
        "Param": "IA-4 (4) [contractors; foreign nationals] "
      }
    ]
  },
  {
    "ControlID": "IA-5",
    "ControlFamily": "IDENTIFICATION AND AUTHENTICATION",
    "ID": "IA-5 (1)",
    "ControlTitle": "AUTHENTICATOR MANAGEMENT",
    "EnhancementText": "The information system, for password-based authentication:\n (a)   Enforces minimum password complexity of [Assignment: organization-defined requirements for case sensitivity, number of characters, mix of upper-case letters, lower-case letters, numbers, and special characters, including minimum requirements for each type];\n (b)   Enforces at least the following number of changed characters when new passwords are created: [Assignment: organization-defined number];\n (c)   Stores and transmits only encrypted representations of passwords;\n (d)   Enforces password minimum and maximum lifetime restrictions of [Assignment: organization- defined numbers for lifetime minimum, lifetime maximum];\n (e)   Prohibits password reuse for [Assignment: organization-defined number] generations; and\n (f) Allows the use of a temporary password for system logons with an immediate change to a permanent password.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "IA-5 (1) (a), and (d) Additional FedRAMP Requirements and Guidance:\nGuidance: If password policies are compliant with NIST SP 800-63B Memorized Secret (Section 5.1.1) Guidance, the control may be considered compliant",
    "SupplementalGuidance": "  This control enhancement applies to single-factor authentication of individuals using passwords as individual or group authenticators, and in a similar manner, when passwords are part of multifactor authenticators. This control enhancement does not apply when passwords are used to unlock hardware authenticators (e.g., Personal Identity Verification cards). The implementation of such password mechanisms may not meet all of the requirements in the enhancement. Encrypted representations of passwords include, for example, encrypted versions of passwords and one-way cryptographic hashes of passwords. The number of changed characters refers to the number of changes required with respect to the total number of positions in the current password. Password lifetime restrictions do not apply to temporary passwords. ",
    "Impacts": [
      "High",
      "Moderate",
      "Low"
    ],
    "RelatedControls": [
      "ia-6"
    ],
    "Parameters": [
      {
        "Level": "High",
        "Param": "IA-5 (1) (b) [at least fifty percent (50%)]\nIA-5 (1) (e) [twenty four (24)]"
      },
      {
        "Level": "Moderate",
        "Param": "IA-5 (1) (b) [at least one]\nIA-5 (1) (e) [twenty four]"
      },
      {
        "Level": "Low",
        "Param": "IA-5 (1) (b) [at least one]\nIA-5 (1) (e) [twenty four]"
      }
    ]
  },
  {
    "ControlID": "IA-5",
    "ControlFamily": "IDENTIFICATION AND AUTHENTICATION",
    "ID": "IA-5 (2)",
    "ControlTitle": "AUTHENTICATOR MANAGEMENT",
    "EnhancementText": "The information system, for PKI-based authentication:\n (a)   Validates certifications by constructing and verifying a certification path to an accepted trust anchor including checking certificate status information;\n (b)   Enforces authorized access to the corresponding private key;\n (c)   Maps the authenticated identity to the account of the individual or group; and\n (d)   Implements a local cache of revocation data to support path discovery and validation in case of inability to access revocation information via the network.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Status information for certification paths includes, for example, certificate revocation lists or certificate status protocol responses. For PIV cards, validation of certifications involves the construction and verification of a certification path to the Common Policy Root trust anchor including certificate policy processing. ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "ia-6"
    ],
    "Parameters": []
  },
  {
    "ControlID": "IA-5",
    "ControlFamily": "IDENTIFICATION AND AUTHENTICATION",
    "ID": "IA-5 (3)",
    "ControlTitle": "AUTHENTICATOR MANAGEMENT",
    "EnhancementText": "The organization requires that the registration process to receive [Assignment: organization- defined types of and/or specific authenticators] be conducted [Selection: in person; by a trusted third party] before [Assignment: organization-defined registration authority] with authorization by [Assignment: organization-defined personnel or roles].\n",
    "IaseGuidance": "The DoD PKI CP defines the role and responsibilities of a DoD PKI Registration Authority (RA). The NSS PKI CP defines the role and responsibilities of an NSS PKI RA.\n\r\nThe DoD PKI RAâ€“LRA CPS defines the nomination process for DoD PKI RAs. The NSS PKI DoD RPS defines the nomination process for NSS PKI RAs for DoD.\n\r\nThe DoD PKI CP defines DoD PKI subscribers and the authentication requirements for issuance of credentials to subscribers. The NSS PKI CP defines NSS PKI subscribers and the authentication requirements for issuance of credentials to subscribers.\n\r\nSource: \r\nDoD RMF TAG",
    "FedrampGuidance": "",
    "SupplementalGuidance": "",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [],
    "Parameters": [
      {
        "Level": "High",
        "Param": "IA-5 (3)-1 [All hardware/biometric (multifactor authenticators] \nIA-5 (3)-2 [in person]\n"
      },
      {
        "Level": "Moderate",
        "Param": "IA-5 (3)-1 [All hardware/biometric (multifactor authenticators] \nIA-5 (3)-2 [in person]\n"
      }
    ]
  },
  {
    "ControlID": "IA-5",
    "ControlFamily": "IDENTIFICATION AND AUTHENTICATION",
    "ID": "IA-5 (4)",
    "ControlTitle": "AUTHENTICATOR MANAGEMENT",
    "EnhancementText": "The organization employs automated tools to determine if password authenticators are sufficiently strong to satisfy [Assignment: organization-defined requirements].\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "IA-5 (4) Guidance: If automated mechanisms which enforce password authenticator strength at creation are not used, automated mechanisms must be used to audit strength of created password authenticators.",
    "SupplementalGuidance": "  This control enhancement focuses on the creation of strong passwords and the characteristics of such passwords (e.g., complexity) prior to use, the enforcement of which is carried out by organizational information systems in IA-5 (1). ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "ca-2",
      "ca-7",
      "ra-5"
    ],
    "Parameters": [
      {
        "Level": "High",
        "Param": "IA-5 (4) [complexity as identified in IA-5 (1) Control Enhancement Part (a)]"
      }
    ]
  },
  {
    "ControlID": "IA-5",
    "ControlFamily": "IDENTIFICATION AND AUTHENTICATION",
    "ID": "IA-5 (6)",
    "ControlTitle": "AUTHENTICATOR MANAGEMENT",
    "EnhancementText": "The organization protects authenticators commensurate with the security category of the information to which use of the authenticator permits access.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  For information systems containing multiple security categories of information without reliable physical or logical separation between categories, authenticators used to grant access to the systems are protected commensurate with the highest security category of information on the systems.\n",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "IA-5",
    "ControlFamily": "IDENTIFICATION AND AUTHENTICATION",
    "ID": "IA-5 (7)",
    "ControlTitle": "AUTHENTICATOR MANAGEMENT",
    "EnhancementText": "The organization ensures that unencrypted static authenticators are not embedded in applications or access scripts or stored on function keys.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Organizations exercise caution in determining whether embedded or stored authenticators are in encrypted or unencrypted form. If authenticators are used in the manner stored, then those representations are considered unencrypted authenticators. This is irrespective of whether that representation is perhaps an encrypted version of something else (e.g., a password).\n",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "IA-5",
    "ControlFamily": "IDENTIFICATION AND AUTHENTICATION",
    "ID": "IA-5 (8)",
    "ControlTitle": "AUTHENTICATOR MANAGEMENT",
    "EnhancementText": "The organization implements [Assignment: organization-defined security safeguards] to manage the risk of compromise due to individuals having accounts on multiple information systems.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  When individuals have accounts on multiple information systems, there is the risk that the compromise of one account may lead to the compromise of other accounts if individuals use the same authenticators. Possible alternatives include, for example: (i) having different authenticators on all systems; (ii) employing some form of single sign-on mechanism; or (iii) including some form of one-time passwords on all systems.\n",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [],
    "Parameters": [
      {
        "Level": "High",
        "Param": "IA-5 (8) [different authenticators on different systems]"
      }
    ]
  },
  {
    "ControlID": "IA-5",
    "ControlFamily": "IDENTIFICATION AND AUTHENTICATION",
    "ID": "IA-5 (11)",
    "ControlTitle": "AUTHENTICATOR MANAGEMENT",
    "EnhancementText": "The information system, for hardware token-based authentication, employs mechanisms that satisfy [Assignment: organization-defined token quality requirements].\n\n",
    "IaseGuidance": "DoDI 8520.03\n\r\nSource: \r\nDoD RMF TAG",
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Hardware token-based authentication typically refers to the use of PKI-based tokens, such as the U.S. Government Personal Identity Verification (PIV) card. Organizations define specific requirements for tokens, such as working with a particular PKI.\n",
    "Impacts": [
      "High",
      "Moderate",
      "Low"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "IA-5",
    "ControlFamily": "IDENTIFICATION AND AUTHENTICATION",
    "ID": "IA-5 (13)",
    "ControlTitle": "AUTHENTICATOR MANAGEMENT",
    "EnhancementText": "The information system prohibits the use of cached authenticators after [Assignment: organization-defined time period].\n",
    "IaseGuidance": "Not appropriate for DoD to define for all CSP's infrastructure or service offerings\n\r\nSource: \r\nDoD RMF TAG",
    "FedrampGuidance": "",
    "SupplementalGuidance": "",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "IA-8",
    "ControlFamily": "IDENTIFICATION AND AUTHENTICATION",
    "ID": "IA-8 (1)",
    "ControlTitle": "IDENTIFICATION AND AUTHENTICATION (NON- ORGANIZATIONAL USERS)",
    "EnhancementText": "The information system accepts and electronically verifies Personal Identity Verification (PIV) credentials from other federal agencies.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  This control enhancement applies to logical access control systems (LACS) and physical access control systems (PACS). Personal Identity Verification (PIV) credentials are those credentials issued by federal agencies that conform to FIPS Publication 201 and supporting guidance documents. OMB Memorandum 11-11 requires federal agencies to continue implementing the requirements specified in HSPD-12 to enable agency-wide use of PIV credentials. ",
    "Impacts": [
      "High",
      "Moderate",
      "Low"
    ],
    "RelatedControls": [
      "au-2",
      "pe-3",
      "sa-4"
    ],
    "Parameters": []
  },
  {
    "ControlID": "IA-8",
    "ControlFamily": "IDENTIFICATION AND AUTHENTICATION",
    "ID": "IA-8 (2)",
    "ControlTitle": "IDENTIFICATION AND AUTHENTICATION (NON- ORGANIZATIONAL USERS)",
    "EnhancementText": "The information system accepts only FICAM-approved third-party credentials.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  This control enhancement typically applies to organizational information systems that are accessible to the general public, for example, public-facing websites. Third-party credentials are those credentials issued by nonfederal government entities approved by the Federal Identity, Credential, and Access Management (FICAM) Trust Framework Solutions initiative. Approved third-party credentials meet or exceed the set of minimum federal government-wide technical, security, privacy, and organizational maturity requirements. This allows federal government relying parties to trust such credentials at their approved assurance levels. ",
    "Impacts": [
      "High",
      "Moderate",
      "Low"
    ],
    "RelatedControls": [
      "au-2"
    ],
    "Parameters": []
  },
  {
    "ControlID": "IA-8",
    "ControlFamily": "IDENTIFICATION AND AUTHENTICATION",
    "ID": "IA-8 (3)",
    "ControlTitle": "IDENTIFICATION AND AUTHENTICATION (NON- ORGANIZATIONAL USERS)",
    "EnhancementText": "The organization employs only FICAM-approved information system components in [Assignment:\norganization-defined information systems] to accept third-party credentials.\n\n",
    "IaseGuidance": "Not appropriate for DoD to define for all CSP's infrastructure or service offerings\n\r\nSource: \r\nDoD RMF TAG",
    "FedrampGuidance": "",
    "SupplementalGuidance": "  This control enhancement typically applies to information systems that are accessible to the general public, for example, public-facing websites. FICAM-approved information system components include, for example, information technology products and software libraries that have been approved by the Federal Identity, Credential, and Access Management conformance program. ",
    "Impacts": [
      "High",
      "Moderate",
      "Low"
    ],
    "RelatedControls": [
      "sa-4"
    ],
    "Parameters": []
  },
  {
    "ControlID": "IA-8",
    "ControlFamily": "IDENTIFICATION AND AUTHENTICATION",
    "ID": "IA-8 (4)",
    "ControlTitle": "IDENTIFICATION AND AUTHENTICATION (NON- ORGANIZATIONAL USERS)",
    "EnhancementText": "The information system conforms to FICAM-issued profiles.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  This control enhancement addresses open identity management standards. To ensure that these standards are viable, robust, reliable, sustainable (e.g., available in commercial information technology products), and interoperable as documented, the United States Government assesses and scopes identity management standards and technology implementations against applicable federal legislation, directives, policies, and requirements. The result is FICAM-issued implementation profiles of approved protocols (e.g., FICAM authentication protocols such as SAML 2.0 and OpenID 2.0, as well as other protocols such as the FICAM Backend Attribute Exchange). ",
    "Impacts": [
      "High",
      "Moderate",
      "Low"
    ],
    "RelatedControls": [
      "sa-4"
    ],
    "Parameters": []
  },
  {
    "ControlID": "IR-2",
    "ControlFamily": "INCIDENT RESPONSE",
    "ID": "IR-2 (1)",
    "ControlTitle": "INCIDENT RESPONSE TRAINING",
    "EnhancementText": "The organization incorporates simulated events into incident response training to facilitate effective response by personnel in crisis situations.\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "IR-2",
    "ControlFamily": "INCIDENT RESPONSE",
    "ID": "IR-2 (2)",
    "ControlTitle": "INCIDENT RESPONSE TRAINING",
    "EnhancementText": "The organization employs automated mechanisms to provide a more thorough and realistic incident response training environment.\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "IR-3",
    "ControlFamily": "INCIDENT RESPONSE",
    "ID": "IR-3 (2)",
    "ControlTitle": "INCIDENT RESPONSE TESTING",
    "EnhancementText": "The organization coordinates incident response testing with organizational elements responsible for related plans.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Organizational plans related to incident response testing include, for example, Business Continuity Plans, Contingency Plans, Disaster Recovery Plans, Continuity of Operations Plans, Crisis Communications Plans, Critical Infrastructure Plans, and\nOccupant Emergency Plans.\n",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "IR-4",
    "ControlFamily": "INCIDENT RESPONSE",
    "ID": "IR-4 (1)",
    "ControlTitle": "INCIDENT HANDLING",
    "EnhancementText": "The organization employs automated mechanisms to support the incident handling process.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Automated mechanisms supporting incident handling processes include, for example, online incident management systems.\n",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "IR-4",
    "ControlFamily": "INCIDENT RESPONSE",
    "ID": "IR-4 (2)",
    "ControlTitle": "INCIDENT HANDLING",
    "EnhancementText": "The organization includes dynamic reconfiguration of [Assignment: organization-defined information system components] as part of the incident response capability.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Dynamic reconfiguration includes, for example, changes to router rules, access control lists, intrusion detection/prevention system parameters, and filter rules for firewalls and gateways. Organizations perform dynamic reconfiguration of information systems, for example, to stop attacks, to misdirect attackers, and to isolate components of systems, thus limiting the extent of the damage from breaches or compromises. Organizations include time frames for achieving the reconfiguration of information systems in the definition of the reconfiguration capability, considering the potential need for rapid response in order to effectively address sophisticated cyber threats. ",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [
      "ac-2",
      "ac-4",
      "ac-16",
      "cm-2",
      "cm-3",
      "cm-4"
    ],
    "Parameters": [
      {
        "Level": "High",
        "Param": "IR-4 (2) [all network, data storage, and computing devices]"
      }
    ]
  },
  {
    "ControlID": "IR-4",
    "ControlFamily": "INCIDENT RESPONSE",
    "ID": "IR-4 (3)",
    "ControlTitle": "INCIDENT HANDLING",
    "EnhancementText": "The organization identifies [Assignment: organization-defined classes of incidents] and [Assignment: organization-defined actions to take in response to classes of incidents] to ensure continuation of organizational missions and business functions.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Classes of incidents include, for example, malfunctions due to design/implementation errors and omissions, targeted malicious attacks, and untargeted malicious attacks. Appropriate incident response actions include, for example, graceful degradation, information system shutdown, fall back to manual mode/alternative technology whereby the system operates differently, employing deceptive measures, alternate information flows, or operating in a mode that is reserved solely for when systems are under attack.\n",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "IR-4",
    "ControlFamily": "INCIDENT RESPONSE",
    "ID": "IR-4 (4)",
    "ControlTitle": "INCIDENT HANDLING",
    "EnhancementText": "The organization correlates incident information and individual incident responses to achieve an organization-wide perspective on incident awareness and response.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Sometimes the nature of a threat event, for example, a hostile cyber attack, is such that it can only be observed by bringing together information from different sources including various reports and reporting procedures established by organizations.\n",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "IR-4",
    "ControlFamily": "INCIDENT RESPONSE",
    "ID": "IR-4 (6)",
    "ControlTitle": "INCIDENT HANDLING",
    "EnhancementText": "The organization implements incident handling capability for insider threats.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  While many organizations address insider threat incidents as an inherent part of their organizational incident response capability, this control enhancement provides additional emphasis on this type of threat and the need for specific incident handling capabilities (as defined within organizations) to provide appropriate and timely responses.\n",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "IR-4",
    "ControlFamily": "INCIDENT RESPONSE",
    "ID": "IR-4 (8)",
    "ControlTitle": "INCIDENT HANDLING",
    "EnhancementText": "The organization coordinates with [Assignment: organization-defined external organizations] to correlate and share [Assignment: organization-defined incident information] to achieve a cross- organization perspective on incident awareness and more effective incident responses.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  The coordination of incident information with external organizations including, for example, mission/business partners, military/coalition partners, customers, and multitiered developers, can provide significant benefits. Cross-organizational coordination with respect to incident handling can serve as an important risk management capability. This capability allows organizations to leverage critical information from a variety of sources to effectively respond to information security-related incidents potentially affecting the organization’s operations, assets, and individuals.\n",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [],
    "Parameters": [
      {
        "Level": "High",
        "Param": "IR-4 (8) [external organizations including consumer incident responders and network defenders and the appropriate CIRT/CERT (such as US-CERT, DOD CERT, IC CERT)]"
      }
    ]
  },
  {
    "ControlID": "IR-5",
    "ControlFamily": "INCIDENT RESPONSE",
    "ID": "IR-5 (1)",
    "ControlTitle": "INCIDENT MONITORING",
    "EnhancementText": "The organization employs automated mechanisms to assist in the tracking of security incidents and in the collection and analysis of incident information.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Automated mechanisms for tracking security incidents and collecting/analyzing incident information include, for example, the Einstein network monitoring device and monitoring online Computer Incident Response Centers (CIRCs) or other electronic databases of incidents. ",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [
      "au-7",
      "ir-4"
    ],
    "Parameters": []
  },
  {
    "ControlID": "IR-6",
    "ControlFamily": "INCIDENT RESPONSE",
    "ID": "IR-6 (1)",
    "ControlTitle": "INCIDENT REPORTING",
    "EnhancementText": "The organization employs automated mechanisms to assist in the reporting of security incidents.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "ir-7"
    ],
    "Parameters": []
  },
  {
    "ControlID": "IR-7",
    "ControlFamily": "INCIDENT RESPONSE",
    "ID": "IR-7 (1)",
    "ControlTitle": "INCIDENT RESPONSE ASSISTANCE",
    "EnhancementText": "The organization employs automated mechanisms to increase the availability of incident response- related information and support.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Automated mechanisms can provide a push and/or pull capability for users to obtain incident response assistance. For example, individuals might have access to a website to query the assistance capability, or conversely, the assistance capability may have the ability to proactively send information to users (general distribution or targeted) as part of increasing understanding of current response capabilities and support.\n",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "IR-7",
    "ControlFamily": "INCIDENT RESPONSE",
    "ID": "IR-7 (2)",
    "ControlTitle": "INCIDENT RESPONSE ASSISTANCE",
    "EnhancementText": "The organization:\n (a)   Establishes a direct, cooperative relationship between its incident response capability and external providers of information system protection capability; and\n (b)   Identifies organizational incident response team members to the external providers.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  External providers of information system protection capability include, for example, the Computer Network Defense program within the U.S. Department of Defense. External providers help to protect, monitor, analyze, detect, and respond to unauthorized activity within organizational information systems and networks.\n",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "IR-9",
    "ControlFamily": "INCIDENT RESPONSE",
    "ID": "IR-9 (1)",
    "ControlTitle": "INFORMATION SPILLAGE RESPONSE",
    "EnhancementText": "The organization assigns [Assignment: organization-defined personnel or roles] with responsibility for responding to information spills. \n",
    "IaseGuidance": "Not appropriate for DoD to define for all CSP's infrastructure or service offerings\n\r\nSource: \r\nDoD RMF TAG",
    "FedrampGuidance": "",
    "SupplementalGuidance": "",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "IR-9",
    "ControlFamily": "INCIDENT RESPONSE",
    "ID": "IR-9 (2)",
    "ControlTitle": "INFORMATION SPILLAGE RESPONSE",
    "EnhancementText": "The organization provides information spillage response training [Assignment: organization- defined frequency].\n",
    "IaseGuidance": "Annually\n\r\nSource: \r\nDoD RMF TAG",
    "FedrampGuidance": "",
    "SupplementalGuidance": "",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [],
    "Parameters": [
      {
        "Level": "High",
        "Param": "IR-9 (2) [at least annually]"
      }
    ]
  },
  {
    "ControlID": "IR-9",
    "ControlFamily": "INCIDENT RESPONSE",
    "ID": "IR-9 (3)",
    "ControlTitle": "INFORMATION SPILLAGE RESPONSE",
    "EnhancementText": "The organization implements [Assignment: organization-defined procedures] to ensure that organizational personnel impacted by information spills can continue to carry out assigned tasks while contaminated systems are undergoing corrective actions.\n\n",
    "IaseGuidance": "Not appropriate for DoD to define for all CSP's infrastructure or service offerings\n\r\nSource: \r\nDoD RMF TAG",
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Correction actions for information systems contaminated due to information spillages may be very time-consuming. During those periods, personnel may not have access to the contaminated systems, which may potentially affect their ability to conduct organizational business.\n",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "IR-9",
    "ControlFamily": "INCIDENT RESPONSE",
    "ID": "IR-9 (4)",
    "ControlTitle": "INFORMATION SPILLAGE RESPONSE",
    "EnhancementText": "The organization employs [Assignment: organization-defined security safeguards] for personnel exposed to information not within assigned access authorizations.\n\n",
    "IaseGuidance": "Not appropriate for DoD to define for all CSP's infrastructure or service offerings\n\r\nSource: \r\nDoD RMF TAG",
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Security safeguards include, for example, making personnel exposed to spilled information aware of the federal laws, directives, policies, and/or regulations regarding the information and the restrictions imposed based on exposure to such information.\n",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "MA-2",
    "ControlFamily": "MAINTENANCE",
    "ID": "MA-2 (2)",
    "ControlTitle": "CONTROLLED MAINTENANCE",
    "EnhancementText": "The organization:\n (a)   Employs automated mechanisms to schedule, conduct, and document maintenance and repairs; and\n (b)   Produces up-to date, accurate, and complete records of all maintenance and repair actions requested, scheduled, in process, and completed.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  ",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [
      "ca-7",
      "ma-3"
    ],
    "Parameters": []
  },
  {
    "ControlID": "MA-3",
    "ControlFamily": "MAINTENANCE",
    "ID": "MA-3 (1)",
    "ControlTitle": "MAINTENANCE TOOLS",
    "EnhancementText": "The organization inspects the maintenance tools carried into a facility by maintenance personnel for improper or unauthorized modifications.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  If, upon inspection of maintenance tools, organizations determine that the tools have been modified in an improper/unauthorized manner or contain malicious code, the incident is handled consistent with organizational policies and procedures for incident handling. ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "si-7"
    ],
    "Parameters": []
  },
  {
    "ControlID": "MA-3",
    "ControlFamily": "MAINTENANCE",
    "ID": "MA-3 (2)",
    "ControlTitle": "MAINTENANCE TOOLS",
    "EnhancementText": "The organization checks media containing diagnostic and test programs for malicious code before the media are used in the information system.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  If, upon inspection of media containing maintenance diagnostic and test programs, organizations determine that the media contain malicious code, the incident is handled consistent with organizational incident handling policies and procedures. ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "si-3"
    ],
    "Parameters": []
  },
  {
    "ControlID": "MA-3",
    "ControlFamily": "MAINTENANCE",
    "ID": "MA-3 (3)",
    "ControlTitle": "MAINTENANCE TOOLS",
    "EnhancementText": "The organization prevents the unauthorized removal of maintenance equipment containing organizational information by:\n (a)   Verifying that there is no organizational information contained on the equipment; \n (b)   Sanitizing or destroying the equipment;\n (c)   Retaining the equipment within the facility; or\n (d)   Obtaining an exemption from [Assignment: organization-defined personnel or roles] explicitly authorizing removal of the equipment from the facility.\n\n",
    "IaseGuidance": "d. Not appropriate for DoD to define for all CSP's infrastructure or service offerings\n\r\nSource:\r\nDoD RMF TAG",
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Organizational information includes all information specifically owned by organizations and information provided to organizations in which organizations serve as information stewards.\n",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [],
    "Parameters": [
      {
        "Level": "High",
        "Param": "MA-3 (3) (d) [the information owner explicitly authorizing removal of the equipment from the facility]"
      },
      {
        "Level": "Moderate",
        "Param": "MA-3 (3) (d) [the information owner explicitly authorizing removal of the equipment from the facility]"
      }
    ]
  },
  {
    "ControlID": "MA-4",
    "ControlFamily": "MAINTENANCE",
    "ID": "MA-4 (2)",
    "ControlTitle": "NONLOCAL MAINTENANCE",
    "EnhancementText": "The organization documents in the security plan for the information system, the policies and procedures for the establishment and use of nonlocal maintenance and diagnostic connections.\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "MA-4",
    "ControlFamily": "MAINTENANCE",
    "ID": "MA-4 (3)",
    "ControlTitle": "NONLOCAL MAINTENANCE",
    "EnhancementText": "The organization:\n (a)   Requires that nonlocal maintenance and diagnostic services be performed from an information system that implements a security capability comparable to the capability implemented on the system being serviced; or\n (b)   Removes the component to be serviced from the information system and prior to nonlocal maintenance or diagnostic services, sanitizes the component (with regard to organizational information) before removal from organizational facilities, and after the service is performed, inspects and sanitizes the component (with regard to potentially malicious software) before reconnecting the component to the information system.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Comparable security capability on information systems, diagnostic tools, and equipment providing maintenance services implies that the implemented security controls on those systems, tools, and equipment are at least as comprehensive as the controls on the information system being serviced. ",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [
      "ma-3",
      "sa-12",
      "si-3",
      "si-7"
    ],
    "Parameters": []
  },
  {
    "ControlID": "MA-4",
    "ControlFamily": "MAINTENANCE",
    "ID": "MA-4 (6)",
    "ControlTitle": "NONLOCAL MAINTENANCE",
    "EnhancementText": "The information system implements cryptographic mechanisms to protect the integrity and confidentiality of nonlocal maintenance and diagnostic communications.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  ",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [
      "sc-8",
      "sc-13"
    ],
    "Parameters": []
  },
  {
    "ControlID": "MA-5",
    "ControlFamily": "MAINTENANCE",
    "ID": "MA-5 (1)",
    "ControlTitle": "MAINTENANCE PERSONNEL",
    "EnhancementText": "The organization:\n (a)   Implements procedures for the use of maintenance personnel that lack appropriate security clearances or are not U.S. citizens, that include the following requirements:\n    (1)   Maintenance personnel who do not have needed access authorizations, clearances, or formal access approvals are escorted and supervised during the performance of maintenance and diagnostic activities on the information system by approved organizational personnel who are fully cleared, have appropriate access authorizations, and are technically qualified;\n   (2)   Prior to initiating maintenance or diagnostic activities by personnel who do not have needed access authorizations, clearances or formal access approvals, all volatile information storage components within the information system are sanitized and all nonvolatile storage media are removed or physically disconnected from the system and secured; and\n (b)   Develops and implements alternate security safeguards in the event an information system component cannot be sanitized, removed, or disconnected from the system.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  This control enhancement denies individuals who lack appropriate security clearances (i.e., individuals who do not possess security clearances or possess security clearances at a lower level than required) or who are not U.S. citizens, visual and\nelectronic access to any classified information, Controlled Unclassified Information (CUI), or any other sensitive information contained on organizational information systems. Procedures for the use of maintenance personnel can be documented in security plans for the information systems. ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "mp-6",
      "pl-2"
    ],
    "Parameters": []
  },
  {
    "ControlID": "MP-5",
    "ControlFamily": "MEDIA PROTECTION",
    "ID": "MP-5 (4)",
    "ControlTitle": "MEDIA TRANSPORT",
    "EnhancementText": "The information system implements cryptographic mechanisms to protect the confidentiality and integrity of information stored on digital media during transport outside of controlled areas.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  This control enhancement applies to both portable storage devices (e.g., USB memory sticks, compact disks, digital video disks, external/removable hard disk drives) and mobile devices with storage capability (e.g., smart phones, tablets, E-readers). ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "mp-2"
    ],
    "Parameters": []
  },
  {
    "ControlID": "MP-6",
    "ControlFamily": "MEDIA PROTECTION",
    "ID": "MP-6 (1)",
    "ControlTitle": "MEDIA SANITIZATION",
    "EnhancementText": "The organization reviews, approves, tracks, documents, and verifies media sanitization and disposal actions.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Organizations review and approve media to be sanitized to ensure compliance with records-retention policies. Tracking/documenting actions include, for example, listing personnel who reviewed and approved sanitization and disposal actions, types of media sanitized, specific files stored on the media, sanitization methods used, date and time of the sanitization actions, personnel who performed the sanitization, verification actions taken, personnel who performed the verification, and disposal action taken.\nOrganizations verify that the sanitization of the media was effective prior to disposal. ",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [
      "si-12"
    ],
    "Parameters": []
  },
  {
    "ControlID": "MP-6",
    "ControlFamily": "MEDIA PROTECTION",
    "ID": "MP-6 (2)",
    "ControlTitle": "MEDIA SANITIZATION",
    "EnhancementText": "The organization tests sanitization equipment and procedures [Assignment: organization-defined frequency] to verify that the intended sanitization is being achieved.\n\n",
    "IaseGuidance": "every 180 days.\n\r\nSource:\r\nDoD RMF TAG",
    "FedrampGuidance": "MP-6 (2) Guidance: Equipment and procedures may be tested or validated for effectiveness",
    "SupplementalGuidance": " Testing of sanitization equipment and procedures may be conducted by qualified and authorized external entities (e.g., other federal agencies or external service providers).\n",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [],
    "Parameters": [
      {
        "Level": "High",
        "Param": "MP-6 (2) [at least every six (6) months]"
      },
      {
        "Level": "Moderate",
        "Param": "MP-6 (2) [At least annually]"
      }
    ]
  },
  {
    "ControlID": "MP-6",
    "ControlFamily": "MEDIA PROTECTION",
    "ID": "MP-6 (3)",
    "ControlTitle": "MEDIA SANITIZATION",
    "EnhancementText": "The organization applies non-destructive sanitization techniques to portable storage devices prior to connecting such devices to the information system under the following circumstances: [Assignment: organization-defined circumstances requiring sanitization of portable storage devices].\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  This control enhancement applies to digital media containing classified information and Controlled Unclassified Information (CUI). Portable storage devices can be the source of malicious code insertions into organizational information systems. Many of\nthese devices are obtained from unknown and potentially untrustworthy sources and may contain malicious code that can be readily transferred to information systems through USB ports or other entry portals. While scanning such storage devices is always recommended, sanitization provides additional assurance that the devices are free of malicious code to include code capable of initiating zero-day attacks. Organizations consider nondestructive sanitization of portable storage devices when such devices are first purchased from the manufacturer or vendor prior to initial use or when organizations lose a positive chain of custody for the devices. ",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [
      "si-3"
    ],
    "Parameters": []
  },
  {
    "ControlID": "MP-7",
    "ControlFamily": "MEDIA PROTECTION",
    "ID": "MP-7 (1)",
    "ControlTitle": "MEDIA USE",
    "EnhancementText": "The organization prohibits the use of portable storage devices in organizational information systems when such devices have no identifiable owner.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Requiring identifiable owners (e.g., individuals, organizations, or projects) for portable storage devices reduces the risk of using such technologies by allowing organizations to assign responsibility and accountability for addressing known vulnerabilities in the devices (e.g., malicious code insertion). ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "pl-4"
    ],
    "Parameters": []
  },
  {
    "ControlID": "PE-3",
    "ControlFamily": "PHYSICAL AND ENVIRONMENTAL PROTECTION",
    "ID": "PE-3 (1)",
    "ControlTitle": "PHYSICAL ACCESS CONTROL",
    "EnhancementText": "The organization enforces physical access authorizations to the information system in addition to the physical access controls for the facility at [Assignment: organization-defined physical spaces containing one or more components of the information system].\n\n",
    "IaseGuidance": "Not appropriate for DoD to define for all CSP's infrastructure or service offerings\n\r\nSource:\r\nDoD RMF TAG",
    "FedrampGuidance": "",
    "SupplementalGuidance": "  This control enhancement provides additional physical security for those areas within facilities where there is a concentration of information system components (e.g., server rooms, media storage areas, data and communications centers). ",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [
      "ps-2"
    ],
    "Parameters": []
  },
  {
    "ControlID": "PE-6",
    "ControlFamily": "PHYSICAL AND ENVIRONMENTAL PROTECTION",
    "ID": "PE-6 (1)",
    "ControlTitle": "MONITORING PHYSICAL ACCESS",
    "EnhancementText": "The organization monitors physical intrusion alarms and surveillance equipment.\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "PE-6",
    "ControlFamily": "PHYSICAL AND ENVIRONMENTAL PROTECTION",
    "ID": "PE-6 (4)",
    "ControlTitle": "MONITORING PHYSICAL ACCESS",
    "EnhancementText": "The organization monitors physical access to the information system in addition to the physical access monitoring of the facility as [Assignment: organization-defined physical spaces containing one or more components of the information system].\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  This control enhancement provides additional monitoring for those areas within facilities where there is a concentration of information system components (e.g., server rooms, media storage areas, communications centers). ",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [
      "ps-2",
      "ps-3"
    ],
    "Parameters": []
  },
  {
    "ControlID": "PE-8",
    "ControlFamily": "PHYSICAL AND ENVIRONMENTAL PROTECTION",
    "ID": "PE-8 (1)",
    "ControlTitle": "VISITOR ACCESS RECORDS",
    "EnhancementText": "The organization employs automated mechanisms to facilitate the maintenance and review of visitor access records.\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "PE-11",
    "ControlFamily": "PHYSICAL AND ENVIRONMENTAL PROTECTION",
    "ID": "PE-11 (1)",
    "ControlTitle": "EMERGENCY POWER",
    "EnhancementText": "The organization provides a long-term alternate power supply for the information system that is capable of maintaining minimally required operational capability in the event of an extended loss of the primary power source.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  This control enhancement can be satisfied, for example, by the use of a secondary commercial power supply or other external power supply. Long-term alternate power supplies for the information system can be either manually or automatically activated.\n",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "PE-13",
    "ControlFamily": "PHYSICAL AND ENVIRONMENTAL PROTECTION",
    "ID": "PE-13 (1)",
    "ControlTitle": "FIRE PROTECTION",
    "EnhancementText": "The organization employs fire detection devices/systems for the information system that activate automatically and notify [Assignment: organization-defined personnel or roles] and [Assignment: organization-defined emergency responders] in the event of a fire.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Organizations can identify specific personnel, roles, and emergency responders in the event that individuals on the notification list must have appropriate access authorizations and/or clearances, for example, to obtain access to facilities where classified operations are taking place or where there are information systems containing classified information.\n",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [],
    "Parameters": [
      {
        "Level": "High",
        "Param": "PE-13 (1) -1 [service provider building maintenance/physical security personnel]\nPE-13 (1) -2 [service provider emergency responders with incident response responsibilities] "
      }
    ]
  },
  {
    "ControlID": "PE-13",
    "ControlFamily": "PHYSICAL AND ENVIRONMENTAL PROTECTION",
    "ID": "PE-13 (2)",
    "ControlTitle": "FIRE PROTECTION",
    "EnhancementText": "The organization employs fire suppression devices/systems for the information system that provide automatic notification of any activation to Assignment: organization-defined personnel or roles] and [Assignment: organization-defined emergency responders].\n\n",
    "IaseGuidance": "Not appropriate for DoD to define for all CSP's infrastructure or service offerings\n\r\nNot appropriate for DoD to define for all CSP's infrastructure or service offerings\n\r\nSource:\r\nDoD RMF TAG",
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Organizations can identify specific personnel, roles, and emergency responders in the event that individuals on the notification list must have appropriate access authorizations and/or clearances, for example, to obtain access to facilities where classified operations are taking place or where there are information systems containing classified information.\n",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "PE-13",
    "ControlFamily": "PHYSICAL AND ENVIRONMENTAL PROTECTION",
    "ID": "PE-13 (3)",
    "ControlTitle": "FIRE PROTECTION",
    "EnhancementText": "The organization employs an automatic fire suppression capability for the information system when the facility is not staffed on a continuous basis.\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "PE-14",
    "ControlFamily": "PHYSICAL AND ENVIRONMENTAL PROTECTION",
    "ID": "PE-14 (2)",
    "ControlTitle": "TEMPERATURE AND HUMIDITY CONTROLS",
    "EnhancementText": "The organization employs temperature and humidity monitoring that provides an alarm or notification of changes potentially harmful to personnel or equipment.\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "PE-15",
    "ControlFamily": "PHYSICAL AND ENVIRONMENTAL PROTECTION",
    "ID": "PE-15 (1)",
    "ControlTitle": "WATER DAMAGE PROTECTION",
    "EnhancementText": "The organization employs automated mechanisms to detect the presence of water in the vicinity of the information system and alerts [Assignment: organization-defined personnel or roles].\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Automated mechanisms can include, for example, water detection sensors, alarms, and notification systems.\n",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [],
    "Parameters": [
      {
        "Level": "High",
        "Param": "PE-15 (1) [service provider building maintenance/physical security personnel]"
      }
    ]
  },
  {
    "ControlID": "PL-2",
    "ControlFamily": "PLANNING",
    "ID": "PL-2 (3)",
    "ControlTitle": "SYSTEM SECURITY PLAN",
    "EnhancementText": "The organization plans and coordinates security-related activities affecting the information system with [Assignment: organization-defined individuals or groups] before conducting such activities in order to reduce the impact on other organizational entities.\n\n",
    "IaseGuidance": "Not appropriate for DoD to define for all CSP's infrastructure or service offerings\n\r\nSource:\r\nDoD RMF TAG",
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Security-related activities include, for example, security assessments, audits, hardware and software maintenance, patch management, and contingency plan testing. Advance planning and coordination includes emergency and nonemergency (i.e., planned or nonurgent unplanned) situations. The process defined by organizations to plan and coordinate security-related activities can be included in security plans for information systems or other documents, as appropriate. ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "cp-4",
      "ir-4"
    ],
    "Parameters": []
  },
  {
    "ControlID": "PL-4",
    "ControlFamily": "PLANNING",
    "ID": "PL-4 (1)",
    "ControlTitle": "RULES OF BEHAVIOR",
    "EnhancementText": "The organization includes in the rules of behavior, explicit restrictions on the use of social media/networking sites and posting organizational information on public websites.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  This control enhancement addresses rules of behavior related to the use of social media/networking sites: (i) when organizational personnel are using such sites for official duties or in the conduct of official business; (ii) when organizational information is involved in social media/networking transactions; and (iii) when personnel are accessing social media/networking sites from organizational information systems. Organizations also address specific rules that prevent unauthorized entities from obtaining and/or inferring non- public organizational information (e.g., system account information, personally identifiable information) from social media/networking sites.\n",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "PS-3",
    "ControlFamily": "PERSONNEL SECURITY",
    "ID": "PS-3 (3)",
    "ControlTitle": "PERSONNEL SCREENING",
    "EnhancementText": "The organization ensures that individuals accessing an information system processing, storing, or transmitting information requiring special protection:\n (a)   Have valid access authorizations that are demonstrated by assigned official government duties; and\n (b)   Satisfy [Assignment: organization-defined additional personnel screening criteria].\n\n",
    "IaseGuidance": "b. Not appropriate for DoD to define for all CSP's infrastructure or service offerings\n\r\nSource:\r\nDoD RMF TAG",
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Organizational information requiring special protection includes, for example, Controlled Unclassified Information (CUI) and Sources and Methods Information (SAMI). Personnel security criteria include, for example, position sensitivity background screening requirements.\n",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [],
    "Parameters": [
      {
        "Level": "High",
        "Param": "PS-3 (3) (b) [personnel screening criteria – as required by specific information]"
      },
      {
        "Level": "Moderate",
        "Param": "PS-3 (3) (b) [personnel screening criteria – as required by specific information]"
      }
    ]
  },
  {
    "ControlID": "PS-4",
    "ControlFamily": "PERSONNEL SECURITY",
    "ID": "PS-4 (2)",
    "ControlTitle": "PERSONNEL TERMINATION",
    "EnhancementText": "The organization employs automated mechanisms to notify [Assignment: organization-defined personnel or roles] upon termination of an individual.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  In organizations with a large number of employees, not all personnel who need to know about termination actions receive the appropriate notifications—or, if such notifications are received, they may not occur in a timely manner. Automated mechanisms\ncan be used to send automatic alerts or notifications to specific organizational personnel or roles (e.g., management personnel, supervisors, personnel security officers, information security officers, systems administrators, or information technology administrators) when individuals are terminated. Such automatic alerts or notifications can be conveyed in a variety of ways, including, for example, telephonically, via electronic mail, via text message, or via websites.\n",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [],
    "Parameters": [
      {
        "Level": "High",
        "Param": "PS-4 (2) [access control personnel responsible for disabling access to the system]"
      }
    ]
  },
  {
    "ControlID": "RA-5",
    "ControlFamily": "RISK ASSESSMENT",
    "ID": "RA-5 (1)",
    "ControlTitle": "VULNERABILITY SCANNING",
    "EnhancementText": "The organization employs vulnerability scanning tools that include the capability to readily update the information system vulnerabilities to be scanned.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  The vulnerabilities to be scanned need to be readily updated as new vulnerabilities are discovered, announced, and scanning methods developed. This updating process helps to ensure that potential vulnerabilities in the information system are identified and addressed as quickly as possible. ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "si-3",
      "si-7"
    ],
    "Parameters": []
  },
  {
    "ControlID": "RA-5",
    "ControlFamily": "RISK ASSESSMENT",
    "ID": "RA-5 (2)",
    "ControlTitle": "VULNERABILITY SCANNING",
    "EnhancementText": "The organization updates the information system vulnerabilities scanned [Selection (one or more): [Assignment: organization-defined frequency]; prior to a new scan; when new vulnerabilities are identified and reported].\n\n",
    "IaseGuidance": "prior to running scans\n\r\nSource:\r\nDoD RMF TAG",
    "FedrampGuidance": "",
    "SupplementalGuidance": "  ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "si-3",
      "si-5"
    ],
    "Parameters": [
      {
        "Level": "High",
        "Param": "RA-5 (2) [prior to a new scan] "
      },
      {
        "Level": "Moderate",
        "Param": "RA-5 (2) [prior to a new scan] "
      }
    ]
  },
  {
    "ControlID": "RA-5",
    "ControlFamily": "RISK ASSESSMENT",
    "ID": "RA-5 (3)",
    "ControlTitle": "VULNERABILITY SCANNING",
    "EnhancementText": "The organization employs vulnerability scanning procedures that can identify the breadth and depth of coverage (i.e., information system components scanned and vulnerabilities checked).\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "RA-5",
    "ControlFamily": "RISK ASSESSMENT",
    "ID": "RA-5 (4)",
    "ControlTitle": "VULNERABILITY SCANNING",
    "EnhancementText": "The organization determines what information about the information system is discoverable by adversaries and subsequently takes [Assignment: organization-defined corrective actions].\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Discoverable information includes information that adversaries could obtain without directly compromising or breaching the information system, for example, by collecting information the system is exposing or by conducting extensive searches of the web. Corrective actions can include, for example, notifying appropriate organizational personnel, removing designated information, or changing the information system to make designated information less relevant or attractive to adversaries. ",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [
      "au-13"
    ],
    "Parameters": [
      {
        "Level": "High",
        "Param": "RA-5 (4) [notify appropriate service provider personnel and follow procedures for organization  and service provider-defined corrective actions]"
      }
    ]
  },
  {
    "ControlID": "RA-5",
    "ControlFamily": "RISK ASSESSMENT",
    "ID": "RA-5 (5)",
    "ControlTitle": "VULNERABILITY SCANNING",
    "EnhancementText": "The information system implements privileged access authorization to [Assignment: organization- identified information system components] for selected [Assignment: organization-defined vulnerability scanning activities].\n\n",
    "IaseGuidance": "all information systems and infrastructure components\n\r\nNot appropriate for DoD to define for all CSP's infrastructure or service offerings\n\r\nSource:\r\nDoD RMF TAG",
    "FedrampGuidance": "",
    "SupplementalGuidance": "  In certain situations, the nature of the vulnerability scanning may be more intrusive or the information system component that is the subject of the scanning may contain highly sensitive information. Privileged access authorization to selected system components facilitates more thorough vulnerability scanning and also protects the sensitive nature of such scanning.\n",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [],
    "Parameters": [
      {
        "Level": "High",
        "Param": "RA-5 (5)-1 [operating systems / web applications / databases] \nRA-5 (5)-2 [all scans]"
      },
      {
        "Level": "Moderate",
        "Param": "RA-5 (5)-1 [operating systems / web applications / databases] \nRA-5 (5)-2 [all scans]"
      }
    ]
  },
  {
    "ControlID": "RA-5",
    "ControlFamily": "RISK ASSESSMENT",
    "ID": "RA-5 (6)",
    "ControlTitle": "VULNERABILITY SCANNING",
    "EnhancementText": "The organization employs automated mechanisms to compare the results of vulnerability scans over time to determine trends in information system vulnerabilities.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "RA-5 (6) Guidance: include in Continuous Monitoring ISSO digest/report to JAB/AO",
    "SupplementalGuidance": "  ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "ir-4",
      "ir-5",
      "si-4"
    ],
    "Parameters": []
  },
  {
    "ControlID": "RA-5",
    "ControlFamily": "RISK ASSESSMENT",
    "ID": "RA-5 (8)",
    "ControlTitle": "VULNERABILITY SCANNING",
    "EnhancementText": "The organization reviews historic audit logs to determine if a vulnerability identified in the information system has been previously exploited.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "RA-5 (8) Requirements: This enhancement is required for all high vulnerability scan findings. \nGuidance: While scanning tools may label findings as high or critical, the intent of the control is based around NIST's definition of high vulnerability.",
    "SupplementalGuidance": "  ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "au-6"
    ],
    "Parameters": []
  },
  {
    "ControlID": "RA-5",
    "ControlFamily": "RISK ASSESSMENT",
    "ID": "RA-5 (10)",
    "ControlTitle": "VULNERABILITY SCANNING",
    "EnhancementText": "The organization correlates the output from vulnerability scanning tools to determine the presence of multi-vulnerability/multi-hop attack vectors.\n",
    "IaseGuidance": null,
    "FedrampGuidance": "RA-5 (10) Guidance: If multiple tools are not used, this control is not applicable.",
    "SupplementalGuidance": "",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "SA-4",
    "ControlFamily": "SYSTEM AND SERVICES ACQUISITION",
    "ID": "SA-4 (1)",
    "ControlTitle": "ACQUISITION PROCESS",
    "EnhancementText": "The organization requires the developer of the information system, system component, or information system service to provide a description of the functional properties of the security controls to be employed.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Functional properties of security controls describe the functionality (i.e., security capability, functions, or mechanisms) visible at the interfaces of the controls and specifically exclude functionality and data structures internal to the operation of the controls. ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "sa-5"
    ],
    "Parameters": []
  },
  {
    "ControlID": "SA-4",
    "ControlFamily": "SYSTEM AND SERVICES ACQUISITION",
    "ID": "SA-4 (2)",
    "ControlTitle": "ACQUISITION PROCESS",
    "EnhancementText": "The organization requires the developer of the information system, system component, or information system service to provide design and implementation information for the security controls to be employed that includes: [Selection (one or more): security-relevant external system interfaces; high-level design; low-level design; source code or hardware schematics; [Assignment: organization-defined design/implementation information]] at [Assignment: organization-defined level of detail].\n\n",
    "IaseGuidance": "Not appropriate for DoD to define for all CSP's infrastructure or service offerings\n\r\nNot appropriate for DoD to define for all CSP's infrastructure or service offerings\n\r\nSource:\r\nDoD RMF TAG",
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Organizations may require different levels of detail in design and implementation documentation for security controls employed in organizational information systems, system components, or information system services based on mission/business requirements, requirements for trustworthiness/resiliency, and requirements for analysis and testing. Information systems can be partitioned into multiple subsystems. Each subsystem within the system can contain one or more modules. The high-level design for the system is expressed in terms of multiple subsystems and the interfaces between subsystems providing security-relevant functionality. The low-level design for the system is expressed in terms of modules with particular emphasis on software and firmware (but not excluding hardware) and the interfaces between modules providing security-relevant functionality. Source code and hardware schematics are typically referred to as the implementation representation of the information system. ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "sa-5"
    ],
    "Parameters": [
      {
        "Level": "High",
        "Param": "SA-4 (2)-1 [at a minimum to include security-relevant external system interfaces; high-level design; low-level design; source code or network and data flow diagram; [organization-defined design/implementation information]]"
      },
      {
        "Level": "Moderate",
        "Param": "SA-4 (2)-1 [to include security-relevant external system interfaces and high-level design]"
      }
    ]
  },
  {
    "ControlID": "SA-4",
    "ControlFamily": "SYSTEM AND SERVICES ACQUISITION",
    "ID": "SA-4 (8)",
    "ControlTitle": "ACQUISITION PROCESS",
    "EnhancementText": "The organization requires the developer of the information system, system component, or information system service to produce a plan for the continuous monitoring of security control effectiveness that contains [Assignment: organization-defined level of detail].\n\n",
    "IaseGuidance": "Not appropriate for DoD to define for all CSP's infrastructure or service offerings\n\r\nSource:\r\nDoD RMF TAG",
    "FedrampGuidance": "SA-4 (8) Guidance: CSP must use the same security standards regardless of where the system component or information system service is acquired.",
    "SupplementalGuidance": "  The objective of continuous monitoring plans is to determine if the complete set of planned, required, and deployed security controls within the information system, system component, or information system service continue to be effective over time based on the inevitable changes that occur. Developer continuous monitoring plans include a sufficient level of detail such that the information can be incorporated into the continuous monitoring strategies and programs implemented by organizations. ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "ca-7"
    ],
    "Parameters": [
      {
        "Level": "High",
        "Param": "SA-4 (8) [at least the minimum requirement as defined in control CA-7]"
      },
      {
        "Level": "Moderate",
        "Param": "SA-4 (8) [at least the minimum requirement as defined in control CA-7]"
      }
    ]
  },
  {
    "ControlID": "SA-4",
    "ControlFamily": "SYSTEM AND SERVICES ACQUISITION",
    "ID": "SA-4 (9)",
    "ControlTitle": "ACQUISITION PROCESS",
    "EnhancementText": "The organization requires the developer of the information system, system component, or information system service to identify early in the system development life cycle, the functions, ports, protocols, and services intended for organizational use.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  The identification of functions, ports, protocols, and services early in the system development life cycle (e.g., during the initial requirements definition and design phases) allows organizations to influence the design of the information system, information system component, or information system service. This early involvement in the life cycle helps organizations to avoid or minimize the use of functions, ports, protocols, or services that pose unnecessarily high risks and understand the trade-offs involved in blocking specific\nports, protocols, or services (or when requiring information system service providers to do so). Early identification of functions, ports, protocols, and services avoids costly retrofitting of security controls after the information system, system component, or information system service has been implemented. SA-9 describes requirements for external information system services with organizations identifying which functions, ports, protocols, and services are provided from external sources. ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "cm-7",
      "sa-9"
    ],
    "Parameters": []
  },
  {
    "ControlID": "SA-4",
    "ControlFamily": "SYSTEM AND SERVICES ACQUISITION",
    "ID": "SA-4 (10)",
    "ControlTitle": "ACQUISITION PROCESS",
    "EnhancementText": "The organization employs only information technology products on the FIPS 201-approved products list for Personal Identity Verification (PIV) capability implemented within organizational information systems.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "ia-2;ia-8"
    ],
    "Parameters": []
  },
  {
    "ControlID": "SA-9",
    "ControlFamily": "SYSTEM AND SERVICES ACQUISITION",
    "ID": "SA-9 (1)",
    "ControlTitle": "EXTERNAL INFORMATION SYSTEM SERVICES",
    "EnhancementText": "The organization:\n (a)   Conducts an organizational assessment of risk prior to the acquisition or outsourcing of dedicated information security services; and\n (b)   Ensures that the acquisition or outsourcing of dedicated information security services is approved by [Assignment: organization-defined personnel or roles].\n\n",
    "IaseGuidance": "b. the DoD Component CIO or their delegate(s)\n\r\nSource:\r\nDoD RMF TAG",
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Dedicated information security services include, for example, incident monitoring, analysis and response, operation of information security-related devices such as firewalls, or key management services. ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "ca-6",
      "ra-3"
    ],
    "Parameters": []
  },
  {
    "ControlID": "SA-9",
    "ControlFamily": "SYSTEM AND SERVICES ACQUISITION",
    "ID": "SA-9 (2)",
    "ControlTitle": "EXTERNAL INFORMATION SYSTEM SERVICES",
    "EnhancementText": "The organization requires providers of [Assignment: organization-defined external information system services] to identify the functions, ports, protocols, and other services required for the use of such services.\n\n",
    "IaseGuidance": "All external information system services\n\r\nSource:\r\nDoD RMF TAG",
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Information from external service providers regarding the specific functions, ports, protocols, and services used in the provision of such services can be particularly useful when the need arises to understand the trade-offs involved in restricting certain functions/services or blocking certain ports/protocols. ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "cm-7"
    ],
    "Parameters": [
      {
        "Level": "High",
        "Param": "SA-9 (2) [all external systems where Federal information is processed or stored]"
      },
      {
        "Level": "Moderate",
        "Param": "SA-9 (2) [all external systems where Federal information is processed or stored]"
      }
    ]
  },
  {
    "ControlID": "SA-9",
    "ControlFamily": "SYSTEM AND SERVICES ACQUISITION",
    "ID": "SA-9 (4)",
    "ControlTitle": "EXTERNAL INFORMATION SYSTEM SERVICES",
    "EnhancementText": "The organization employs [Assignment: organization-defined security safeguards] to ensure that the interests of [Assignment: organization-defined external service providers] are consistent with and reflect organizational interests.\n\n",
    "IaseGuidance": "Not appropriate for DoD to define for all CSP's infrastructure or service offerings\n\r\nAll external service providers from whom services are solicited.\n\r\nSource:\r\nDoD RMF TAG",
    "FedrampGuidance": "",
    "SupplementalGuidance": "  As organizations increasingly use external service providers, the possibility exists that the interests of the service providers may diverge from organizational interests. In such situations, simply having the correct technical, procedural, or operational safeguards in place may not be sufficient if the service providers that implement and control those safeguards are not operating in a manner consistent with the interests of the consuming organizations. Possible actions that organizations might take to address such concerns include, for example, requiring background checks for selected service provider personnel, examining ownership records, employing only trustworthy service providers (i.e., providers with which organizations have had positive experiences), and conducting periodic/unscheduled visits to service provider facilities.\n",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [],
    "Parameters": [
      {
        "Level": "High",
        "Param": "SA-9 (4)-2 [all external systems where Federal information is processed or stored]"
      },
      {
        "Level": "Moderate",
        "Param": "SA-9 (4)-2 [all external systems where Federal information is processed or stored]"
      }
    ]
  },
  {
    "ControlID": "SA-9",
    "ControlFamily": "SYSTEM AND SERVICES ACQUISITION",
    "ID": "SA-9 (5)",
    "ControlTitle": "EXTERNAL INFORMATION SYSTEM SERVICES",
    "EnhancementText": "The organization restricts the location of [Selection (one or more): information processing; information/data; information system services] to [Assignment: organization-defined locations] based on [Assignment: organization-defined requirements or conditions].\n\n",
    "IaseGuidance": "Not appropriate for DoD to define for all CSP's infrastructure or service offerings\n\r\nNot appropriate for DoD to define for all CSP's infrastructure or service offerings\n\r\nSource:\r\nDoD RMF TAG",
    "FedrampGuidance": "",
    "SupplementalGuidance": "  The location of information processing, information/data storage, or information system services that are critical to organizations can have a direct impact on the ability of those organizations to successfully execute their missions/business functions. This situation exists when external providers control the location of processing, storage or services. The criteria external providers use for the selection of processing, storage, or service locations may be different from organizational criteria. For example, organizations may want to ensure that data/information storage locations are restricted to certain locations to facilitate incident response activities (e.g., forensic analyses, after-the-fact investigations) in case of information security breaches/compromises. Such incident response activities may be adversely affected\nby the governing laws or protocols in the locations where processing and storage occur and/or the locations from which information system services emanate.\n",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [],
    "Parameters": [
      {
        "Level": "High",
        "Param": "SA-9 (5)-1 [information processing, information data, AND information services]"
      },
      {
        "Level": "Moderate",
        "Param": "SA-9 (5)-1 [information processing, information data, AND information services]"
      }
    ]
  },
  {
    "ControlID": "SA-10",
    "ControlFamily": "SYSTEM AND SERVICES ACQUISITION",
    "ID": "SA-10 (1)",
    "ControlTitle": "DEVELOPER CONFIGURATION MANAGEMENT",
    "EnhancementText": "The organization requires the developer of the information system, system component, or information system service to enable integrity verification of software and firmware components.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  This control enhancement allows organizations to detect unauthorized changes to software and firmware components through the use of tools, techniques, and/or mechanisms provided by developers. Integrity checking mechanisms can also address counterfeiting of software and firmware components. Organizations verify the integrity of software and firmware components, for example, through secure one-way hashes provided by developers. Delivered software and firmware components also include any updates to such components. ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "si-7"
    ],
    "Parameters": []
  },
  {
    "ControlID": "SA-11",
    "ControlFamily": "SYSTEM AND SERVICES ACQUISITION",
    "ID": "SA-11 (1)",
    "ControlTitle": "DEVELOPER SECURITY TESTING AND EVALUATION",
    "EnhancementText": "The organization requires the developer of the information system, system component, or information system service to employ static code analysis tools to identify common flaws and document the results of the analysis.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "SA-11 (1) Requirement: The service provider documents in the Continuous Monitoring Plan, how newly developed code for the information system is reviewed.",
    "SupplementalGuidance": "  Static code analysis provides a technology and methodology for security reviews. Such analysis can be used to identify security vulnerabilities and enforce security coding practices. Static code analysis is most effective when used early in the development process, when each code change can be automatically scanned for potential weaknesses. Static analysis can provide clear remediation guidance along with defects to enable developers to fix such defects. Evidence of correct implementation of static analysis can include, for example, aggregate defect density for critical defect types, evidence that defects were inspected by developers or security professionals, and evidence that defects were fixed. An excessively high density of ignored findings (commonly referred to as ignored or false positives) indicates a potential problem with the analysis process or tool. In such cases, organizations weigh the validity of the evidence against evidence from other sources.\n",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "SA-11",
    "ControlFamily": "SYSTEM AND SERVICES ACQUISITION",
    "ID": "SA-11 (2)",
    "ControlTitle": "DEVELOPER SECURITY TESTING AND EVALUATION",
    "EnhancementText": "The organization requires the developer of the information system, system component, or information system service to perform threat and vulnerability analyses and subsequent testing/evaluation of the as-built system, component, or service.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Applications may deviate significantly from the functional and design specifications created during the requirements and design phases of the system development life cycle. Therefore, threat and vulnerability analyses of information systems, system components, and information system services prior to delivery are critical to the effective operation of those systems, components, and services. Threat and vulnerability analyses at this phase of the life cycle help to ensure that design or implementation changes have been accounted for, and that any new vulnerabilities created as a result of those changes have been reviewed and mitigated. ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "pm-15",
      "ra-5"
    ],
    "Parameters": []
  },
  {
    "ControlID": "SA-11",
    "ControlFamily": "SYSTEM AND SERVICES ACQUISITION",
    "ID": "SA-11 (8)",
    "ControlTitle": "DEVELOPER SECURITY TESTING AND EVALUATION",
    "EnhancementText": "The organization requires the developer of the information system, system component, or information system service to employ dynamic code analysis tools to identify common flaws and document the results of the analysis.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "SA-11 (8) Requirement: The service provider documents in the Continuous Monitoring Plan, how newly developed code for the information system is reviewed.",
    "SupplementalGuidance": "  Dynamic code analysis provides run-time verification of software programs, using tools capable of monitoring programs for memory corruption, user privilege issues, and other potential security problems. Dynamic code analysis employs run-time tools to help to ensure that security functionality performs in the manner in which it was designed. A specialized type of dynamic analysis, known as fuzz testing, induces program failures by deliberately introducing malformed or random data into software programs. Fuzz testing strategies derive from the intended use of applications and the functional and design specifications for the applications.\n",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "SC-7",
    "ControlFamily": "SYSTEM AND COMMUNICATIONS PROTECTION",
    "ID": "SC-7 (3)",
    "ControlTitle": "BOUNDARY PROTECTION",
    "EnhancementText": "The organization limits the number of external network connections to the information system.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Limiting the number of external network connections facilitates more comprehensive monitoring of inbound and outbound communications traffic. The Trusted Internet Connection (TIC) initiative is an example of limiting the number of external network connections.\n",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "SC-7",
    "ControlFamily": "SYSTEM AND COMMUNICATIONS PROTECTION",
    "ID": "SC-7 (4)",
    "ControlTitle": "BOUNDARY PROTECTION",
    "EnhancementText": "The organization:\n (a)   Implements a managed interface for each external telecommunication service; \n (b)   Establishes a traffic flow policy for each managed interface;\n (c)   Protects the confidentiality and integrity of the information being transmitted across each interface;\n (d)   Documents each exception to the traffic flow policy with a supporting mission/business need and duration of that need; and\n (e)   Reviews exceptions to the traffic flow policy [Assignment: organization-defined frequency] and removes exceptions that are no longer supported by an explicit mission/business need.\n\n",
    "IaseGuidance": "e. every 180 days\n\r\nSource:\r\nDoD RMF TAG",
    "FedrampGuidance": "",
    "SupplementalGuidance": "  ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "sc-8"
    ],
    "Parameters": [
      {
        "Level": "High",
        "Param": "SC-7 (4) (e) [at least every ninety (90) days or whenever there is a change in the threat environment that warrants a review of the exceptions]"
      },
      {
        "Level": "Moderate",
        "Param": "SC-7 (4) (e) [at least annually]"
      }
    ]
  },
  {
    "ControlID": "SC-7",
    "ControlFamily": "SYSTEM AND COMMUNICATIONS PROTECTION",
    "ID": "SC-7 (5)",
    "ControlTitle": "BOUNDARY PROTECTION",
    "EnhancementText": "The information system at managed interfaces denies network communications traffic by default and allows network communications traffic by exception (i.e., deny all, permit by exception).\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  This control enhancement applies to both inbound and outbound network communications traffic. A deny-all, permit-by-exception network communications traffic policy ensures that only those connections which are essential and approved are allowed.\n",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "SC-7",
    "ControlFamily": "SYSTEM AND COMMUNICATIONS PROTECTION",
    "ID": "SC-7 (7)",
    "ControlTitle": "BOUNDARY PROTECTION",
    "EnhancementText": "The information system, in conjunction with a remote device, prevents the device from simultaneously establishing non-remote connections with the system and communicating via some other connection to resources in external networks.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  This control enhancement is implemented within remote devices (e.g., notebook computers) through configuration settings to disable split tunneling in those devices, and by preventing those configuration settings from being readily configurable by users. This control enhancement is implemented within the information system by the detection of split tunneling (or of configuration settings that allow split tunneling) in the remote device, and by prohibiting the connection if the remote device is using split tunneling. Split tunneling might be desirable by remote users to communicate with local information system resources such as printers/file servers. However, split tunneling would in effect allow unauthorized external connections, making the system more vulnerable to attack and to exfiltration of organizational information. The use of VPNs for remote connections, when adequately provisioned with appropriate security controls, may provide the organization with sufficient assurance that it can effectively treat such connections as non-remote connections from the confidentiality and integrity perspective. VPNs thus provide a means for allowing non-remote communications paths from remote devices. The use of an adequately provisioned VPN does not eliminate the need for preventing split tunneling.\n",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "SC-7",
    "ControlFamily": "SYSTEM AND COMMUNICATIONS PROTECTION",
    "ID": "SC-7 (8)",
    "ControlTitle": "BOUNDARY PROTECTION",
    "EnhancementText": "The information system routes [Assignment: organization-defined internal communications traffic] to [Assignment: organization-defined external networks] through authenticated proxy servers at managed interfaces.\n\n",
    "IaseGuidance": "protocols as designated by PPSM guidance (e.g. HTTPS, HTTP, FTP, SNMP)\n\r\nany network external to the authorization boundary\n\r\nSource:\r\nDoD RMF TAG",
    "FedrampGuidance": "",
    "SupplementalGuidance": "  External networks are networks outside of organizational control. A proxy server is a server (i.e., information system or application) that acts as an intermediary for clients requesting information system resources (e.g., files, connections, web pages, or services) from other organizational servers. Client requests established through an initial connection to the proxy server are evaluated to manage complexity and to provide additional protection by limiting direct connectivity. Web content filtering devices are one of the most common proxy servers providing access to the Internet. Proxy servers support logging individual Transmission Control Protocol (TCP) sessions and blocking specific Uniform Resource Locators (URLs), domain names, and Internet Protocol (IP) addresses. Web proxies can be configured with organization-defined lists of authorized and unauthorized websites. ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "ac-3",
      "au-2"
    ],
    "Parameters": []
  },
  {
    "ControlID": "SC-7",
    "ControlFamily": "SYSTEM AND COMMUNICATIONS PROTECTION",
    "ID": "SC-7 (10)",
    "ControlTitle": "BOUNDARY PROTECTION",
    "EnhancementText": "The organization prevents the unauthorized exfiltration of information across managed interfaces.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Safeguards implemented by organizations to prevent unauthorized exfiltration of information from information systems include, for example: (i) strict adherence to protocol formats; (ii) monitoring for beaconing from information systems; (iii) monitoring for steganography; (iv) disconnecting external network interfaces except when explicitly needed; (v) disassembling and reassembling packet headers; and (vi) employing traffic profile analysis to detect deviations from the volume/types of traffic expected within organizations or call backs to command and control centers. Devices enforcing strict adherence to protocol formats include, for example, deep packet inspection firewalls and XML gateways. These devices verify adherence to protocol formats and specification at the application layer and serve to identify vulnerabilities that cannot be detected by devices operating at the network or transport layers. This control enhancement is closely associated with cross-domain solutions and system guards enforcing information flow requirements. ",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [
      "si-3"
    ],
    "Parameters": []
  },
  {
    "ControlID": "SC-7",
    "ControlFamily": "SYSTEM AND COMMUNICATIONS PROTECTION",
    "ID": "SC-7 (12)",
    "ControlTitle": "BOUNDARY PROTECTION",
    "EnhancementText": "The organization implements [Assignment: organization-defined host-based boundary protection mechanisms] at [Assignment: organization-defined information system components].\n\n",
    "IaseGuidance": "McAfee Host Intrusion Prevention (HIPS)\n\r\nAll information system components.\n\r\nSource:\r\nDoD RMF TAG\nNOTE: DISA will evaluate Commercial CSP equivalencies on a case by case basis.",
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Host-based boundary protection mechanisms include, for example, host-based firewalls. Information system components employing host-based boundary protection mechanisms include, for example, servers, workstations, and mobile devices.\n",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [],
    "Parameters": [
      {
        "Level": "High",
        "Param": "SC-7(12)-1 [Host Intrusion Prevention System (HIPS), Host Intrusion Detection System (HIDS), or minimally a host-based firewall] "
      }
    ]
  },
  {
    "ControlID": "SC-7",
    "ControlFamily": "SYSTEM AND COMMUNICATIONS PROTECTION",
    "ID": "SC-7 (13)",
    "ControlTitle": "BOUNDARY PROTECTION",
    "EnhancementText": "The organization isolates [Assignment: organization-defined information security tools, mechanisms, and support components] from other internal information system components by implementing physically separate subnetworks with managed interfaces to other components of the system.\n\n",
    "IaseGuidance": "key information security tools, mechanisms, and support components such as, but not limited to PKI, Patching infrastructure, HBSS, CND Tools, Special Purpose Gateway, vulnerability tracking systems, honeypots, internet access points (IAPs); network element and data center administrative/management traffic; Demilitarized Zones (DMZs), Server farms/computing centers, centralized audit log servers etc.\n\r\nSource:\r\nDoD RMF TAG",
    "FedrampGuidance": "SC-7 (13) Requirement: The service provider defines key information security tools, mechanisms, and support components associated with system and security administration and isolates those tools, mechanisms, and support components from other internal information system components via physically or logically separate subnets.\nGuidance: Examples include: information security tools, mechanisms, and support components such as, but not limited to PKI, patching infrastructure, cyber defense tools, special purpose gateway, vulnerability tracking systems, internet access points (IAPs); network element and data center administrative/management traffic; Demilitarized Zones (DMZs), Server farms/computing centers,  centralized audit log servers etc.",
    "SupplementalGuidance": "  Physically separate subnetworks with managed interfaces are useful, for example, in isolating computer network defenses from critical operational processing networks to prevent adversaries from discovering the analysis and forensics techniques of organizations. ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "sa-8",
      "sc-2",
      "sc-3"
    ],
    "Parameters": []
  },
  {
    "ControlID": "SC-7",
    "ControlFamily": "SYSTEM AND COMMUNICATIONS PROTECTION",
    "ID": "SC-7 (18)",
    "ControlTitle": "BOUNDARY PROTECTION",
    "EnhancementText": "The information system fails securely in the event of an operational failure of a boundary protection device.\n \n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Fail secure is a condition achieved by employing information system mechanisms to ensure that in the event of operational failures of boundary protection devices at managed interfaces (e.g., routers, firewalls, guards, and application gateways residing on protected subnetworks commonly referred to as demilitarized zones), information systems do not enter into unsecure states where intended security properties no longer hold. Failures of boundary protection devices cannot lead to, or cause information external to the devices to enter the devices, nor can failures permit unauthorized information releases. ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "cp-2",
      "sc-24"
    ],
    "Parameters": []
  },
  {
    "ControlID": "SC-7",
    "ControlFamily": "SYSTEM AND COMMUNICATIONS PROTECTION",
    "ID": "SC-7 (20)",
    "ControlTitle": "BOUNDARY PROTECTION",
    "EnhancementText": "The information system provides the capability to dynamically isolate/segregate [Assignment: organization-defined information system components] from other components of the system.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  The capability to dynamically isolate or segregate certain internal components of organizational information systems is useful when it is necessary to partition or separate certain components of dubious origin from those components possessing greater\ntrustworthiness. Component isolation reduces the attack surface of organizational information systems. Isolation of selected information system components is also a means of limiting the damage from successful cyber attacks when those attacks occur.\n",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "SC-7",
    "ControlFamily": "SYSTEM AND COMMUNICATIONS PROTECTION",
    "ID": "SC-7 (21)",
    "ControlTitle": "BOUNDARY PROTECTION",
    "EnhancementText": "The organization employs boundary protection mechanisms to separate [Assignment: organization-defined information system components] supporting [Assignment: organization- defined missions and/or business functions].\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Organizations can isolate information system components performing different missions and/or business functions. Such isolation limits unauthorized information flows among system components and also provides the opportunity to deploy greater levels of protection for selected components. Separating system components with boundary protection mechanisms provides the capability for increased protection of individual components and to more effectively control information flows between those components. This type of enhanced protection limits the potential harm from cyber attacks and errors. The degree of separation provided varies depending upon the mechanisms chosen. Boundary protection mechanisms include, for example, routers, gateways, and firewalls separating system components into physically separate networks or subnetworks, cross-domain devices separating subnetworks, virtualization techniques, and encrypting information flows among system components using distinct encryption keys. ",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [
      "ca-9",
      "sc-3"
    ],
    "Parameters": []
  },
  {
    "ControlID": "SC-8",
    "ControlFamily": "SYSTEM AND COMMUNICATIONS PROTECTION",
    "ID": "SC-8 (1)",
    "ControlTitle": "TRANSMISSION CONFIDENTIALITY AND INTEGRITY",
    "EnhancementText": "The information system implements cryptographic mechanisms to [Selection (one or more): prevent unauthorized disclosure of information; detect changes to information] during transmission unless otherwise protected by [Assignment: organization-defined alternative physical safeguards].\n\n",
    "IaseGuidance": "Protected Distribution System (PDS)\n\r\nSource:\r\nDoD RMF TAG",
    "FedrampGuidance": "",
    "SupplementalGuidance": " Encrypting information for transmission protects information from unauthorized disclosure and modification. Cryptographic mechanisms implemented to protect information integrity include, for example, cryptographic hash functions which have common application in digital signatures, checksums, and message authentication codes. Alternative physical security safeguards include, for example, protected distribution systems. ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "sc-13"
    ],
    "Parameters": [
      {
        "Level": "High",
        "Param": "SC-8 (1)-1 [prevent unauthorized disclosure of information AND detect changes to information] \nSC-8 (1)-2 [a hardened or alarmed carrier Protective Distribution System (PDS)]"
      },
      {
        "Level": "Moderate",
        "Param": "SC-8 (1)-1 [prevent unauthorized disclosure of information AND detect changes to information] \nSC-8 (1)-2 [a hardened or alarmed carrier Protective Distribution System (PDS)]"
      }
    ]
  },
  {
    "ControlID": "SC-12",
    "ControlFamily": "SYSTEM AND COMMUNICATIONS PROTECTION",
    "ID": "SC-12 (1)",
    "ControlTitle": "CRYPTOGRAPHIC KEY ESTABLISHMENT AND\nMANAGEMENT",
    "EnhancementText": "The organization maintains availability of information in the event of the loss of cryptographic keys by users.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Escrowing of encryption keys is a common practice for ensuring availability in the event of loss of keys (e.g., due to forgotten passphrase).\n",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "SC-12",
    "ControlFamily": "SYSTEM AND COMMUNICATIONS PROTECTION",
    "ID": "SC-12 (2)",
    "ControlTitle": "CRYPTOGRAPHIC KEY ESTABLISHMENT AND\nMANAGEMENT",
    "EnhancementText": "The organization produces, controls, and distributes symmetric cryptographic keys using [Selection: NIST FIPS-compliant; NSA-approved] key management technology and processes.\n",
    "IaseGuidance": "NIST Approved for Unclassified systems\r\nNSA Approved for Classified systems\n\r\nSource:\r\nDoD RMF TAG",
    "FedrampGuidance": "",
    "SupplementalGuidance": "",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [],
    "Parameters": [
      {
        "Level": "High",
        "Param": "SC-12 (2) [NIST FIPS-compliant]\n"
      },
      {
        "Level": "Moderate",
        "Param": "SC-12 (2) [NIST FIPS-compliant]\n"
      }
    ]
  },
  {
    "ControlID": "SC-12",
    "ControlFamily": "SYSTEM AND COMMUNICATIONS PROTECTION",
    "ID": "SC-12 (3)",
    "ControlTitle": "CRYPTOGRAPHIC KEY ESTABLISHMENT AND\nMANAGEMENT",
    "EnhancementText": "The organization produces, controls, and distributes asymmetric cryptographic keys using [Selection: NSA-approved key management technology and processes; approved PKI Class 3 certificates or prepositioned keying material; approved PKI Class 3 or Class 4 certificates and hardware security tokens that protect the user’s private key].\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "SC-23",
    "ControlFamily": "SYSTEM AND COMMUNICATIONS PROTECTION",
    "ID": "SC-23 (1)",
    "ControlTitle": "SESSION AUTHENTICITY",
    "EnhancementText": "The information system invalidates session identifiers upon user logout or other session termination.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  This control enhancement curtails the ability of adversaries from capturing and continuing to employ previously valid session IDs.\n",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "SC-28",
    "ControlFamily": "SYSTEM AND COMMUNICATIONS PROTECTION",
    "ID": "SC-28 (1)",
    "ControlTitle": "PROTECTION OF INFORMATION AT REST",
    "EnhancementText": "The information system implements cryptographic mechanisms to prevent unauthorized disclosure and modification of [Assignment: organization-defined information] on [Assignment: organization-defined information system components].\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Selection of cryptographic mechanisms is based on the need to protect the confidentiality and integrity of organizational information. The strength of mechanism is commensurate with the security category and/or classification of the information. This control enhancement applies to significant concentrations of digital media in organizational areas designated for media storage and also to limited quantities of media generally associated with information system components in operational environments (e.g., portable storage devices, mobile devices). Organizations have the flexibility to either encrypt all information on storage devices (i.e., full disk encryption) or encrypt specific data structures (e.g., files, records, or fields). Organizations employing cryptographic mechanisms to protect information at rest also consider cryptographic key management solutions. ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "ac-19",
      "sc-12"
    ],
    "Parameters": [
      {
        "Level": "High",
        "Param": "SC-28 (1)-2 [all information system components storing customer data deemed sensitive]"
      }
    ]
  },
  {
    "ControlID": "SI-2",
    "ControlFamily": "SYSTEM AND INFORMATION INTEGRITY",
    "ID": "SI-2 (1)",
    "ControlTitle": "FLAW REMEDIATION",
    "EnhancementText": "The organization centrally manages the flaw remediation process.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Central management is the organization-wide management and implementation of flaw remediation processes. Central management includes planning, implementing, assessing, authorizing, and monitoring the organization-defined, centrally managed flaw remediation security controls.\n",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "SI-2",
    "ControlFamily": "SYSTEM AND INFORMATION INTEGRITY",
    "ID": "SI-2 (2)",
    "ControlTitle": "FLAW REMEDIATION",
    "EnhancementText": "The organization employs automated mechanisms [Assignment: organization-defined frequency] to determine the state of information system components with regard to flaw remediation.\n\n",
    "IaseGuidance": "Continuously with HBSS 30 days for any additional internal network scans not covered by HBSS Annually for external scans by (Computer Network Defense Service Provider) CNDSP\n\r\nSource:\r\nDoD RMF TAG",
    "FedrampGuidance": "",
    "SupplementalGuidance": "  ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "cm-6",
      "si-4"
    ],
    "Parameters": [
      {
        "Level": "High",
        "Param": "SI-2 (2) [at least monthly] \n"
      },
      {
        "Level": "Moderate",
        "Param": "SI-2 (2) [at least monthly] \n"
      }
    ]
  },
  {
    "ControlID": "SI-2",
    "ControlFamily": "SYSTEM AND INFORMATION INTEGRITY",
    "ID": "SI-2 (3)",
    "ControlTitle": "FLAW REMEDIATION",
    "EnhancementText": "The organization:\n (a)   Measures the time between flaw identification and flaw remediation; and\n (b)   Establishes [Assignment: organization-defined benchmarks] for taking corrective actions.\n\n",
    "IaseGuidance": "b. within the period directed by an authorative source (e.g. IAVM, CTOs, DTMs, STIGs)\n\r\nSource:\r\nDoD RMF TAG",
    "FedrampGuidance": "",
    "SupplementalGuidance": "  This control enhancement requires organizations to determine the current time it takes on the average to correct information system flaws after such flaws have been identified, and subsequently establish organizational benchmarks (i.e., time frames) for taking corrective actions. Benchmarks can be established by type of flaw and/or severity of the potential vulnerability if the flaw can be exploited.\n",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "SI-3",
    "ControlFamily": "SYSTEM AND INFORMATION INTEGRITY",
    "ID": "SI-3 (1)",
    "ControlTitle": "MALICIOUS CODE PROTECTION",
    "EnhancementText": "The organization centrally manages malicious code protection mechanisms.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Central management is the organization-wide management and implementation of malicious code protection mechanisms. Central management includes planning, implementing, assessing, authorizing, and monitoring the organization-defined, centrally managed flaw malicious code protection security controls. ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "au-2",
      "si-8"
    ],
    "Parameters": []
  },
  {
    "ControlID": "SI-3",
    "ControlFamily": "SYSTEM AND INFORMATION INTEGRITY",
    "ID": "SI-3 (2)",
    "ControlTitle": "MALICIOUS CODE PROTECTION",
    "EnhancementText": "The information system automatically updates malicious code protection mechanisms.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Malicious code protection mechanisms include, for example, signature definitions. Due to information system integrity and availability concerns, organizations give careful consideration to the methodology used to carry out automatic updates. ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "si-8"
    ],
    "Parameters": []
  },
  {
    "ControlID": "SI-3",
    "ControlFamily": "SYSTEM AND INFORMATION INTEGRITY",
    "ID": "SI-3 (7)",
    "ControlTitle": "MALICIOUS CODE PROTECTION",
    "EnhancementText": "The information system implements nonsignature-based malicious code detection mechanisms.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Nonsignature-based detection mechanisms include, for example, the use of heuristics to detect, analyze, and describe the characteristics or behavior of malicious code and to provide safeguards against malicious code for which signatures do not yet exist or for which existing signatures may not be effective. This includes polymorphic malicious code (i.e., code that changes signatures when it replicates). This control enhancement does not preclude the use of signature-based detection mechanisms.\n",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "SI-4",
    "ControlFamily": "SYSTEM AND INFORMATION INTEGRITY",
    "ID": "SI-4 (1)",
    "ControlTitle": "INFORMATION SYSTEM MONITORING",
    "EnhancementText": "The organization connects and configures individual intrusion detection tools into an information system-wide intrusion detection system.\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "SI-4",
    "ControlFamily": "SYSTEM AND INFORMATION INTEGRITY",
    "ID": "SI-4 (2)",
    "ControlTitle": "INFORMATION SYSTEM MONITORING",
    "EnhancementText": "The organization employs automated tools to support near real-time analysis of events.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Automated tools include, for example, host-based, network-based, transport-based, or storage-based event monitoring tools or Security Information and Event Management (SIEM) technologies that provide real time analysis of alerts and/or notifications generated by organizational information systems.\n",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "SI-4",
    "ControlFamily": "SYSTEM AND INFORMATION INTEGRITY",
    "ID": "SI-4 (4)",
    "ControlTitle": "INFORMATION SYSTEM MONITORING",
    "EnhancementText": "The information system monitors inbound and outbound communications traffic [Assignment: organization-defined frequency] for unusual or unauthorized activities or conditions.\n\n",
    "IaseGuidance": "Continuously\n\r\nSource:\r\nDoD RMF TAG",
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Unusual/unauthorized activities or conditions related to information system inbound and outbound communications traffic include, for example, internal traffic that indicates the presence of malicious code within organizational information systems or propagating among system components, the unauthorized exporting of information, or signaling to external information systems. Evidence of malicious code is used to identify potentially compromised information systems or information system components.\n",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [],
    "Parameters": [
      {
        "Level": "High",
        "Param": "SI-4 (4) [continuously]"
      },
      {
        "Level": "Moderate",
        "Param": "SI-4 (4) [continuously]"
      }
    ]
  },
  {
    "ControlID": "SI-4",
    "ControlFamily": "SYSTEM AND INFORMATION INTEGRITY",
    "ID": "SI-4 (5)",
    "ControlTitle": "INFORMATION SYSTEM MONITORING",
    "EnhancementText": "The information system alerts [Assignment: organization-defined personnel or roles] when the following indications of compromise or potential compromise occur: [Assignment: organization- defined compromise indicators].\n\n",
    "IaseGuidance": "at a minimum, the ISSM and ISSO\n\r\nReal time intrusion detection and when there are threats identified by authoritative sources (e.g. CTOs) and IAW incident categories I, II, IV, & VII within CJCSM 6510.01B\n\r\nSource:\r\nDoD RMF TAG",
    "FedrampGuidance": "SI-4 (5) Guidance: In accordance with the incident response plan.",
    "SupplementalGuidance": "  Alerts may be generated from a variety of sources, including, for example, audit records or inputs from malicious code protection mechanisms, intrusion detection or prevention mechanisms, or boundary protection devices such as firewalls, gateways, and routers. Alerts can be transmitted, for example, telephonically, by electronic mail messages, or by text messaging. Organizational personnel on the notification list can include, for example, system administrators, mission/business owners, system owners, or information system security officers. ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "au-5",
      "pe-6"
    ],
    "Parameters": []
  },
  {
    "ControlID": "SI-4",
    "ControlFamily": "SYSTEM AND INFORMATION INTEGRITY",
    "ID": "SI-4 (11)",
    "ControlTitle": "INFORMATION SYSTEM MONITORING",
    "EnhancementText": "The organization analyzes outbound communications traffic at the external boundary of the information system and selected [Assignment: organization-defined interior points within the system (e.g., subnetworks, subsystems)] to discover anomalies.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Anomalies within organizational information systems include, for example, large file transfers, long-time persistent connections, unusual protocols and ports in use, and attempted communications with suspected malicious external addresses.\n",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "SI-4",
    "ControlFamily": "SYSTEM AND INFORMATION INTEGRITY",
    "ID": "SI-4 (14)",
    "ControlTitle": "INFORMATION SYSTEM MONITORING",
    "EnhancementText": "The organization employs a wireless intrusion detection system to identify rogue wireless devices and to detect attack attempts and potential compromises/breaches to the information system.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Wireless signals may radiate beyond the confines of organization- controlled facilities. Organizations proactively search for unauthorized wireless connections including the conduct of thorough scans for unauthorized wireless access points. Scans are not limited to those areas within facilities containing information systems, but also include areas outside of facilities as needed, to verify that unauthorized wireless access points are not connected to the systems. ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "ac-18",
      "ia-3"
    ],
    "Parameters": []
  },
  {
    "ControlID": "SI-4",
    "ControlFamily": "SYSTEM AND INFORMATION INTEGRITY",
    "ID": "SI-4 (16)",
    "ControlTitle": "INFORMATION SYSTEM MONITORING",
    "EnhancementText": "The organization correlates information from monitoring tools employed throughout the information system.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Correlating information from different monitoring tools can provide a more comprehensive view of information system activity. The correlation of monitoring tools that usually work in isolation (e.g., host monitoring, network monitoring, anti-virus software) can provide an organization-wide view and in so doing, may reveal otherwise unseen attack patterns. Understanding the capabilities/limitations of diverse monitoring tools and how to maximize the utility of information generated by those tools can help organizations to build, operate, and maintain effective monitoring programs. ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "au-6"
    ],
    "Parameters": []
  },
  {
    "ControlID": "SI-4",
    "ControlFamily": "SYSTEM AND INFORMATION INTEGRITY",
    "ID": "SI-4 (18)",
    "ControlTitle": "INFORMATION SYSTEM MONITORING",
    "EnhancementText": "The organization analyzes outbound communications traffic at the external boundary of the information system (i.e., system perimeter) and at [Assignment: organization-defined interior points within the system (e.g., subsystems, subnetworks)] to detect covert exfiltration of information.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Covert means that can be used for the unauthorized exfiltration of organizational information include, for example, steganography.\n",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "SI-4",
    "ControlFamily": "SYSTEM AND INFORMATION INTEGRITY",
    "ID": "SI-4 (19)",
    "ControlTitle": "INFORMATION SYSTEM MONITORING",
    "EnhancementText": "The organization implements [Assignment: organization-defined additional monitoring] of individuals who have been identified by [Assignment: organization-defined sources] as posing an increased level of risk.\n\n",
    "IaseGuidance": "Not appropriate for DoD to define for all CSP's infrastructure or service offerings\n\r\nNot appropriate for DoD to define for all CSP's infrastructure or service offerings\n\r\nSource:\r\nDoD RMF TAG",
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Indications of increased risk from individuals can be obtained from a variety of sources including, for example, human resource records, intelligence agencies, law enforcement organizations, and/or other credible sources. The monitoring of individuals is closely coordinated with management, legal, security, and human resources officials within organizations conducting such monitoring and complies with federal legislation, Executive Orders, policies, directives, regulations, and standards.\n",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "SI-4",
    "ControlFamily": "SYSTEM AND INFORMATION INTEGRITY",
    "ID": "SI-4 (20)",
    "ControlTitle": "INFORMATION SYSTEM MONITORING",
    "EnhancementText": "The organization implements [Assignment: organization-defined additional monitoring] of privileged users.\n",
    "IaseGuidance": "Not appropriate for DoD to define for all CSP's infrastructure or service offerings\n\r\nSource:\r\nDoD RMF TAG",
    "FedrampGuidance": "",
    "SupplementalGuidance": "",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "SI-4",
    "ControlFamily": "SYSTEM AND INFORMATION INTEGRITY",
    "ID": "SI-4 (22)",
    "ControlTitle": "INFORMATION SYSTEM MONITORING",
    "EnhancementText": "The information system detects network services that have not been authorized or approved by [Assignment: organization-defined authorization or approval processes] and [Selection (one or more): audits; alerts [Assignment: organization-defined personnel or roles]].\n\n",
    "IaseGuidance": "at a minimum, the ISSM or ISSO\n\r\nat a minimum, the ISSM or ISSO\n\r\nSource:\r\nDoD RMF TAG",
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Unauthorized or unapproved network services include, for example, services in service-oriented architectures that lack organizational verification or validation and therefore may be unreliable or serve as malicious rogues for valid services. ",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [
      "ac-6",
      "cm-7",
      "sa-5",
      "sa-9"
    ],
    "Parameters": []
  },
  {
    "ControlID": "SI-4",
    "ControlFamily": "SYSTEM AND INFORMATION INTEGRITY",
    "ID": "SI-4 (23)",
    "ControlTitle": "INFORMATION SYSTEM MONITORING",
    "EnhancementText": "The organization implements [Assignment: organization-defined host-based monitoring mechanisms] at [Assignment: organization-defined information system components].\n\n",
    "IaseGuidance": "HBSS\n\r\nall components\n\r\nSource:\r\nDoD RMF TAG\nNOTE: DISA will evaluate Commercial CSP equivalencies on a case by case basis.",
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Information system components where host-based monitoring can be implemented include, for example, servers, workstations, and mobile devices. Organizations consider employing host-based monitoring mechanisms from multiple information technology product developers.\n",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "SI-4",
    "ControlFamily": "SYSTEM AND INFORMATION INTEGRITY",
    "ID": "SI-4 (24)",
    "ControlTitle": "INFORMATION SYSTEM MONITORING",
    "EnhancementText": "The information system discovers, collects, distributes, and uses indicators of compromise.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Indicators of compromise (IOC) are forensic artifacts from intrusions that are identified on organizational information systems (at the host or network level). IOCs provide organizations with valuable information on objects or information systems that have been compromised. IOCs for the discovery of compromised hosts can include for example, the creation of registry key values. IOCs for network traffic include, for example, Universal Resource Locator (URL) or protocol elements that indicate malware command and control servers. The rapid distribution and adoption of IOCs can improve information security by reducing the time that information systems and organizations are vulnerable to the same exploit or attack.\n",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "SI-5",
    "ControlFamily": "SYSTEM AND INFORMATION INTEGRITY",
    "ID": "SI-5 (1)",
    "ControlTitle": "SECURITY ALERTS, ADVISORIES, AND DIRECTIVES",
    "EnhancementText": "The organization employs automated mechanisms to make security alert and advisory information available throughout the organization.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  The significant number of changes to organizational information systems and the environments in which those systems operate requires the dissemination of security-related information to a variety of organizational entities that have a direct interest in the success of organizational missions and business functions. Based on the information provided by the security alerts and advisories, changes may be required at one or more of the three tiers related to the management of information security risk including the governance level, mission/business process/enterprise architecture level, and the information system level.\n",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "SI-7",
    "ControlFamily": "SYSTEM AND INFORMATION INTEGRITY",
    "ID": "SI-7 (1)",
    "ControlTitle": "SOFTWARE, FIRMWARE, AND INFORMATION\nINTEGRITY",
    "EnhancementText": "The information system performs an integrity check of [Assignment: organization-defined software, firmware, and information] [Selection (one or more): at startup; at [Assignment: organization-defined transitional states or security-relevant events]; [Assignment: organization- defined frequency]].\n\n",
    "IaseGuidance": "Not appropriate for DoD to define for all CSP's infrastructure or service offerings\n\r\nNot appropriate for DoD to define for all CSP's infrastructure or service offerings\n\r\nAnnually\n\r\nSource:\r\nDoD RMF TAG",
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Security-relevant events include, for example, the identification of a new threat to which organizational information systems are susceptible, and the installation of new hardware, software, or firmware. Transitional states include, for example, system startup, restart, shutdown, and abort.\n",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [],
    "Parameters": [
      {
        "Level": "High",
        "Param": "SI-7(1)-1 [selection to include security relevant events]  \nSI-7(1)-2 [at least monthly]"
      },
      {
        "Level": "Moderate",
        "Param": "SI-7(1)-1 [selection to include security relevant events]  \nSI-7(1)-2 [at least monthly]"
      }
    ]
  },
  {
    "ControlID": "SI-7",
    "ControlFamily": "SYSTEM AND INFORMATION INTEGRITY",
    "ID": "SI-7 (2)",
    "ControlTitle": "SOFTWARE, FIRMWARE, AND INFORMATION\nINTEGRITY",
    "EnhancementText": "The organization employs automated tools that provide notification to [Assignment: organization- defined personnel or roles] upon discovering discrepancies during integrity verification.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  The use of automated tools to report integrity violations and to notify organizational personnel in a timely matter is an essential precursor to effective risk response. Personnel having an interest in integrity violations include, for example, mission/business owners, information system owners, systems administrators, software developers, systems integrators, and information security officers.\n",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "SI-7",
    "ControlFamily": "SYSTEM AND INFORMATION INTEGRITY",
    "ID": "SI-7 (5)",
    "ControlTitle": "SOFTWARE, FIRMWARE, AND INFORMATION\nINTEGRITY",
    "EnhancementText": "The information system automatically [Selection (one or more): shuts the information system down; restarts the information system; implements [Assignment: organization-defined security safeguards]] when integrity violations are discovered.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Organizations may define different integrity checking and anomaly responses: (i) by type of information (e.g., firmware, software, user data); (ii) by specific information (e.g., boot firmware, boot firmware for a specific types of machines); or (iii) a combination of both. Automatic implementation of specific safeguards within organizational information systems includes, for example, reversing the changes, halting the information system, or triggering audit alerts when unauthorized modifications to critical security files occur.\n",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [],
    "Parameters": []
  },
  {
    "ControlID": "SI-7",
    "ControlFamily": "SYSTEM AND INFORMATION INTEGRITY",
    "ID": "SI-7 (7)",
    "ControlTitle": "SOFTWARE, FIRMWARE, AND INFORMATION\nINTEGRITY",
    "EnhancementText": "The organization incorporates the detection of unauthorized [Assignment: organization-defined security-relevant changes to the information system] into the organizational incident response capability.\n\n",
    "IaseGuidance": "Not appropriate for DoD to define for all CSP's infrastructure or service offerings\n\r\nSource:\r\nDoD RMF TAG",
    "FedrampGuidance": "",
    "SupplementalGuidance": "  This control enhancement helps to ensure that detected events are tracked, monitored, corrected, and available for historical purposes. Maintaining historical records is important both for being able to identify and discern adversary actions over an extended period of time and for possible legal actions. Security-relevant changes include, for example, unauthorized changes to established configuration settings or unauthorized elevation of information system privileges. ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "ir-4",
      "ir-5",
      "si-4"
    ],
    "Parameters": []
  },
  {
    "ControlID": "SI-7",
    "ControlFamily": "SYSTEM AND INFORMATION INTEGRITY",
    "ID": "SI-7 (14)",
    "ControlTitle": "SOFTWARE, FIRMWARE, AND INFORMATION\nINTEGRITY",
    "EnhancementText": "The organization:\n (a)   Prohibits the use of binary or machine-executable code from sources with limited or no warranty and without the provision of source code; and\n (b)   Provides exceptions to the source code requirement only for compelling mission/operational requirements and with the approval of the authorizing official.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  This control enhancement applies to all sources of binary or machine- executable code including, for example, commercial software/firmware and open source software. Organizations assess software products without accompanying source code from sources with limited or no warranty for potential security impacts. The assessments address the fact that these types of software products may be very difficult to review, repair, or extend, given that organizations, in most cases, do not have access to the original source code, and there may be no owners who could make such repairs on behalf of organizations. ",
    "Impacts": [
      "High"
    ],
    "RelatedControls": [
      "sa-5"
    ],
    "Parameters": []
  },
  {
    "ControlID": "SI-8",
    "ControlFamily": "SYSTEM AND INFORMATION INTEGRITY",
    "ID": "SI-8 (1)",
    "ControlTitle": "SPAM PROTECTION",
    "EnhancementText": "The organization centrally manages spam protection mechanisms.\n\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "  Central management is the organization-wide management and implementation of spam protection mechanisms. Central management includes planning, implementing, assessing, authorizing, and monitoring the organization-defined, centrally managed spam protection security controls. ",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [
      "au-3",
      "si-2",
      "si-7"
    ],
    "Parameters": []
  },
  {
    "ControlID": "SI-8",
    "ControlFamily": "SYSTEM AND INFORMATION INTEGRITY",
    "ID": "SI-8 (2)",
    "ControlTitle": "SPAM PROTECTION",
    "EnhancementText": "The information system automatically updates spam protection mechanisms.\n",
    "IaseGuidance": null,
    "FedrampGuidance": "",
    "SupplementalGuidance": "",
    "Impacts": [
      "High",
      "Moderate"
    ],
    "RelatedControls": [],
    "Parameters": []
  }
]
